Repository: progval/Limnoria
Catalog: plugins/Later/locales/*.po
Languages: de, fr, it

source: Determines the maximum number of messages to be queued for a user. If this value is 0, there is no maximum.
de: Legt die maximalanzahl von Nachrichten fest die in einer Warteschlange abgelegt werden. Falls dieser Wert 0 ist, gibt es keine begrenzung.
fr: Détermine le nombre maximum de messages en attente d'un utilisateur. Si la valeur est 0, il n'y a pas de maximum
it: Determina il numero massimo di messaggi da mettere in coda per un utente. Se questo valore è uguale a 0, non c'è un limite massimo.

source: Determines whether users will be notified in the first place in which they're seen, or in private.
de: Legt fest ob der Benutzer dort benachrichtig wird wo er zuerst gesehen wird, oder privat.
fr: Détermine si les utilisateurs seront notifiés au premier endroit où ils sont vus, ou en privé.
it: Determina se gli utenti riceveranno una nota nel primo luogo in cui sono visti o in privato.

source: Determines whether users will be notified upon joining any channel the bot is in, or only upon sending a message.
de: Legt fest ob ein Benutzer benachrichtig werden soll sobald er einen Kanal des Bots betritt, oder nach dem senden einer Nachricht.
fr: Détermine si les utilisateurs seront notifiés au premier endroit où ils sont vus, ou seulement lorsqu'ils envoient un message.
it: Determina se gli utenti riceveranno una nota entrando in qualsiasi canale in cui è presente il bot o solo dopo aver inviato un messaggio.

source: Determines the maximum number of days that a message will remain queued for a user. After this time elapses, the message will be deleted. If this value is 0, there is no maximum.
de: Legt die maximal Anzahl an Tagen fest, die eine Nachricht in der Warteschlange bleibt. Nach dieser Zeit wird die Nachricht gelöscht. Falls dieser Wert 0 ist gibt es keine Begrenzung.
fr: Détermine le nombre maximum de messages en attente d'un utilisateur. Après que ce temps se soit écoulé, le message sera supprimé. Si la valeur est 0, il n'y a pas de maximum.
it: Determina il numero massimo di giorni che un messaggio rimarrà in coda per un utente. Allo scadere di questo tempo il messaggio verrà cancellato. Se questo valore è uguale a 0, non c'è un limite massimo.

source: Used to do things later; currently, it only allows the sending of nick-based notes. Do note (haha!) that these notes are *not* private and don't even pretend to be; if you want such features, consider using the Note plugin.
de: Wird benutzt um Sachen später zu machen, momentan kann man nur Notizen an andere Nutzer senden. Beachte, dass diese Notizen *nicht* privat sind und auch nicht sein wollen; falls du soetwas sucht, überlege das Note Plugin zu benutzen.
fr: Utilisé pour faire des choses plus tard ; actuellement, il n'autorise que les notes basées sur des nicks. Notez (haha !) que ces notes ne sont *pas* privées, et qu'elle ne sont pas conçues pour l'être ; si vous voulez une telle fonctionnalité, utilisez le plugin Note.
it: Utilizzato per fare cose in seguito; attualmente permette solo l'invio di note basate sul nick. Nota (haha!) che queste note *non* sono private e non sono state progettate per esserlo; se vuoi questa caratteristica considera l'utilizzo del plugin Note.

source: %s ago
de: vor %s
it: %s fa

source: just now
de: jetzt
fr: à l'instant
it: proprio ora

source: Validate nick according to the IRC RFC 2812 spec. Reference: http://tools.ietf.org/rfcmarkup?doc=2812#section-2.3.1 Some irc clients' tab-completion feature appends 'address' characters to nick, such as ':' or ','. We try correcting for that by trimming a char off the end. If nick incorrigibly invalid, return False, otherwise, return (possibly trimmed) nick.
de: Validiert den Nick nach der IRC RFC 2812 spec. Referenz: http://tools.ietf.org/rfcmarkup?doc=2812#section-2.3.1 Manche Klienten fügen bei der Tabvervollständigung 'addressierungs' Zeichen hinzu, sowie ':' oder','. Wir probieren das zu korregieren indem wir das letzte Zeichen abschneiden. Falls der Nick nicht korrigiert werden kann, wird False zurückgegeben, andererseits der (möglicherweise gekürzte) Nick.
it: Convalida il nick secondo la specifica IRC RFC 2812. Riferimento: http://tools.ietf.org/rfcmarkup?doc=2812#section-2.3.1 Alcuni client IRC hanno l'autocompletamento del nick che aggiunge caratteri di "indirizzamento" come ":" o "," alla fine. Si cerca di correggere questo comportamento tagliando un carattere al fondo. Se il nick non è valido restituisce False, altrimenti lo riporta (possibilmente tagliato).

source: <nick> <text> Tells <nick> <text> the next time <nick> is in seen. <nick> can contain wildcard characters, and the first matching nick will be given the note.
de: <Nick> <Text> Sagt <Nick> <Text>, sobald <Nick> das nächste Mal gesehen wird. <Nick> kann Platzhalter enthalten, und der erste Nick der darauf passt wird die Notiz bekommen.
it: <nick> <testo> Riferisce <testo> a <nick> la prima volta che lo vede. <nick> può contenere caratteri jolly, il primo che corrisponde riceverà la notifica.

source: I can't send notes to myself.
de: Ich kann keine Notizen an mich selbst senden.
fr: Je ne peux m'envoyer de notes à moi-même.
it: Non posso inviare note a me stesso.

source: That person's message queue is already full.
de: Die Warteschlange dieser person ist bereits voll.
fr: La file d'attente des messages de cette personne est déjà pleine.
it: La coda dei messaggi di questo utente è già piena.

source: [<nick>] If <nick> is given, replies with what notes are waiting on <nick>, otherwise, replies with the nicks that have notes waiting for them.
de: [<Nick>] Falls <Nick> angegeben wird, wird mit den Notizen geantwortet die auf <Nick> waren, andernfalls wird mit den Nicks geanwortet die Notizen in der Warteschlange haben.
fr: [<nick>] Si le <nick> est donné, répond avec les notes en attente pour <nick> ; sinon, répond avec les nicks ayant des notes en attente.
it: [<nick>] Se <nick> è fornito, risponde con le note in coda per <nick>, altrimenti con i nick che hanno note in coda.

source: I have no notes for that nick.
de: Ich habe keine Notizen für diesen Nick.
fr: Je n'ai pas de note pour ce nick.
it: Non ho note per questo nick.

source: I currently have notes waiting for %L.
de: Ich habe momentan keine Notizen in der Warteschlange für %L.
fr: J'ai actuellement des notes en attente pour %L.
it: Al momento non ho note in coda per %L.

source: I have no notes waiting to be delivered.
de: Ich habe keine Notizen, die darauf warten zugestellt zu werden.
fr: Je n'ai pas de note à délivrer.
it: Non ho note in attesa di essere consegnate.

source: <nick> Removes the notes waiting on <nick>.
de: <Nick> Entfernt die wartenden Notizen für <Nick>.
fr: <nick> Supprime les notes en attente pour <nick>.
it: <nick> Rimuove le note in coda per <nick>.

source: There were no notes for %r
de: Da waren keine Nachrichten für %r
fr: Il n'y a pas de note pour %r
it: Non ci sono note per %r

source: <nick> Removes the latest note you sent to <nick>.
de: <Nick> Entfern die letzte Notiz die du an <Nick> gesendet hast.
fr: <nick> Supprime la dernière note que vous avez envoyée à <nick>.
it: <nick> Rimuove l'ultima nota inviata a <nick>.

source: There are no note waiting for %s.
de: Es gibt keine Notiz, die auf %s wartet.
fr: Il n'y a pas de note en attente de %r
it: Non ci sono note in attesa per %s.

source: There are no note from you waiting for %s.
de: Es gibt keine Notiz von dir, die auf %s wartet.
fr: Il n'y a pas de note de vous en attente pour %s.
it: Non ci sono note in attesa per %s da te inviate.

source: Sent %s: <%s> %s
de: %s gesendet: <%s> %s
fr: Envoyé %s : <%s> %s
it: Inviata %s: <%s> %s

source: <nick> <text> Tells <nick> <text> the next time <nick> is seen. <nick> can contain wildcard characters, and the first matching nick will be given the note.
fr: <nick> <texte> Dit le <texte> à <nick> la prochaine fois qu'iel est vu-e. <nick> peut contenir des jokers, et le premier nick correspondant recevra la note.
