Repository: progval/Limnoria
Catalog: plugins/Time/locales/*.po
Languages: de, fr, hu

source: Determines the format string for timestamps. Refer to the Python documentation for the time module to see what formats are accepted. If you set this variable to the empty string, the timestamp will not be shown.
de: Legt die Formatiertung der Zeichenkette für Zeitstempel fest. Siehe Python Dokumentation für das time Modul um zu sehen welche Formate akzeptiert werden. Falls du diese Variable auf eine leere Zeichenkette setzt, wird kein Zeitstempel angezeigt.
fr: Détermine la chaîne de format pour les timestamps. Référez-vous à la documentation du module Python time pour voir quels formats sont acceptés. Si vous définissez cette variable à une chaîne vide, le timestamp ne sera pas affiché.
hu: Meghatározza az időbélyegzők formátum karakterláncát. Lásd a time modul Python dokumentációját, hogy lásd, milyen formátumok fogadhatók el. Ha ezt a változót üres karakterláncra állítod, az időbélygező nem lesz megjelenítve.

source: [<years>y] [<weeks>w] [<days>d] [<hours>h] [<minutes>m] [<seconds>s] Returns the number of seconds in the number of <years>, <weeks>, <days>, <hours>, <minutes>, and <seconds> given. An example usage is "seconds 2h 30m", which would return 9000, which is '3600*2 + 30*60'. Useful for scheduling events at a given number of seconds in the future.
de: [<Jahre>y] [<Wochen>w] [<Tage>d] [<Stunden>h] [<Minuten>m] [<Sekunden>s] Gibt die Sekunden von der Anzahl von <Jahren>, <Wochen>, <Tagen>, <Stunden>, <Minuten> und Sekunden an. Ein Beispiel ist "seconds 2h 30m", das würde 9000 zurückgeben, dass ist '3600*2 + 30*60'. Nützlich um Events zu einem Zeitpunkt von Sekunden in der Zukunft zu planen.
fr: [<années>y] [<semaines>w] [<jours>d] [<heures>h] [<minutes>m] [<secondes>s] Retourne le nombre de secondes de la date donnée. Un exemple d'utilisation est "seconds 2h 30m", ce qui retournera 9000. Utile pour planifier des évènement à un certain nombre de secondes dans le futur.
hu: [<évek>y] [<hetek>w] [<napok>d] [<órák>h] [<percek>m] [<másodpercek>s] Kiírja a másodpercek számát a megadott számú <évek>-ben, <hetek>-ben, <napok>-ban, <órák>-ban és <másodperc>-ekben. Egy lehetőség "seconds 2h 30m", amely 9000-et írna ki, ami '3600*2 + 30*60'. Hasznos az események időzítésére megadott számú másodpercek múlva a jövőben.

source: <time string> Returns the number of seconds since epoch <time string> is. <time string> can be any number of natural formats; just try something and see if it will work.
de: <Zeit Zeichenkette> Gibt die
hu: <időkarakterlánc> Kiírja az epoch (1970. január 1. 0:00) óta eltelt másodpercek számát az <időkarakterlánc> alapján. Az <időkarakterlány> lehet bármilyen természetes formátum; csak próbálj ki valamit, és nézd meg, hogy működik-e.

source: That's right now!
de: Das ist jetzt
fr: C'est maintenant !
hu: Ez éppen most van!

source: <time string> Returns the number of seconds until <time string>.
de: <Zeit Zeichenkette> Gibt die Nummer der Sekunden bis <Zeit Zeichenkette> zurück.
fr: <moment> Retourne le nombre de secondes depuis le <moment>.
hu: <időkarakterlánc> Kiírja, az <időkarakterlánc>-ig hátralévő másodpercek számát.

source: [<seconds since epoch>] Returns the ctime for <seconds since epoch>, or the current ctime if no <seconds since epoch> is given.
de: [<Sekunden seit Beginn der Unix Zeitrechnung>] Gibt ctime for <Sekunden seit Beginn der Unix Zeitrechnung> an oder die momentane ctime, falls <Sekunden seit Beginn der Unix Zeitrechnung> nicht angegeben wurde.
fr: [<temps>] Renvoie le ctime pour le moment il y a <temps> secondes, ou le ctime courant, si aucun <temps> n'est donné.
hu: [<epoch óta eltelt másodpercek>] Kiírja az időkarakterláncot az <epoch óta eltelt másodpercek>-hez, vagy a jelenlegi időt ha nincs <epoch óta eltelt másodpercek> megadva.

source: number of seconds since epoch
de: Sekunden seit Beginn der Unix Zeitrechnung
fr: nombre de secondes depuis une époque
hu: epoch óta eltelt másodpercek száma

source: [<format>] [<seconds since epoch>] Returns the current time in <format> format, or, if <format> is not given, uses the configurable format for the current channel. If no <seconds since epoch> time is given, the current time is used.
de: <Format> [<Sekunden seit Beginn der Unix Zeitrechnung>] Gibt die Zeit im <Format> an oder falls die <Format> nicht angegeben wird, wird das konfigurierte Format für den Kanal benutzt. Falls <Sekunden seit Beginn der Unix Zeitrechnung> nicht angegeben ist, wird die momentante Zeit benutzt.
hu: [<formátum>] [<epoch óta eltelt másodpercek>] Kiírja a jelenlegi időt <formátum> formátumban, vagy, ha a <formátum> nincs megadva, a konfigurálható formátumot használja a jelenlegi csatornához. Ha nincs <epoch üta eltelt másodpercek> idő megadva, a jelenlegi idő használt.

source: <seconds> Returns a pretty string that is the amount of time represented by <seconds>.
de: <Sekunden> Gibt eine schöne Zeichenkette zurück die die Zeitspanne von <Sekunden> repräsentiert.
fr: <secondes> Retourne le nombre de <secondes>, joliement formatté.
hu: <másodpercek> Kiír egy szép karakterláncot, amely a <másodpercek> által képviselt idő mennyisége.

source: <region>/<city> Takes a city and its region, and returns the locale time.
de: <Region>/<Stadt> Gibt die lokale zeit von <Region>/<Stadt> zurück
hu: <régió>/<város> Egy várost és a régióját fogadja, és kiírja az időzóna szerinti időt.

source: Python-tz is required by the command, but is not installed on this computer.
de: Python-tz wird für diesen Befehl benötigt, ist aber nicht installiert.
hu: A Python-tz szükséges ehhez a parancshoz, de nincs telepítve ezen a számítógépen.

source: Unknown timezone
de: Unbekannte Zeitzone
fr: Timezone inconnue
hu: Ismeretlen időzóna

source: [<time string>] Returns the number of seconds since epoch <time string> is. <time string> can be any number of natural formats; just try something and see if it will work. If the <time string> is not given, defaults to now.
fr: <moment> Retourne le nombre de secondes depuis le <moment>. Le <moment> peut être n'importe lequel des formats naturels, essayez seulement, et voyez si ça marche.<moment> vaut l’instant actuel par défaut.

source: This command is not available on this bot, ask the owner to install the python-dateutil library.
fr: Cette commande n’est pas disponible sur ce bot, demandez au/à la propriétaire d’installer la bibliothèque python-dateutil.
