Repository: progval/Limnoria
Catalog: plugins/Topic/locale/*.po
Languages: fi

source: Value must include $topic, otherwise the actual topic would be left out.
fi: Arvon täytyy sisältää $topic, muutoin itse aihe jätettäisiin pois.

source: Determines what separator is used between individually added topics in the channel topic.
fi: Määrittää mitä eroittajaa käytetään erikseen lisättyjen aiheiden välissä kanavan aiheessa.

source: Determines what format is used to add topics in the topic. All the standard substitutes apply, in addition to "$topic" for the topic itself.
fi: Määrittää mitä muotoa käytetään lisäämään aiheita kanavan aiheessa. Kaikki perus muunnokset ovat voimassa, "$topic":n lisäksi aiheelle itselleen.

source: Determines whether the bot will recognize the TOPICLEN value sent to it by the server and thus refuse to send TOPICs longer than the TOPICLEN. These topics are likely to be truncated by the server anyway, so this defaults to True.
fi: Määrittää tunnistaako botti TOPICLEN arvon, jonka palvelin on lähettänyt sille ja näin kieltäytyy asettamasta pidempiä aiheita, kuin TOPICLEN. Nämä aiheet tulisivat muutenkin palvelimen lyhentämiksi, joten tämä on oletuksena True.

source: Determines what the default topic for the channel is. This is used by the default command to set this topic.
fi: Määrittää mikä on oletus aihe kanavalle. 'Default' komento käyttää tätä.

source: Determines the number of previous topics to keep around in case the undo command is called.
fi: Määrittää edellisten aiheiden määrän, jotka säilytetään siltä varalta, että 'undo' komentoa käytetään.

source: Determines the capabilities required (if any) to make any topic changes, (everything except for read-only operations). Use 'channel,capab' for channel-level capabilities. Note that absence of an explicit anticapability means user has capability.
fi: Määrittää valtuudet, jotka (jos mitkään) vaaditaan aiheen vaihtamiseen, (kaikki, paitsi vain-luku komennot). Käytä valtuutta 'channel,capab' kanava-tason valtuuksia varten. Huomaa, että anti-valtuuden poissaolo tarkoittaa, että käyttäjällä on valtuus.

source: I'm not currently in %s.
fi: En tällä hetkellä ole kanavalla %s.

source: I can't change the topic, I'm not opped and %s is +t.
fi: En voi vaihtaa aihetta, koska en ole kanavaoperaattori ja kanavalla %s on tila +t.

source: The topic must not include %q.
fi: %q ei saa olla aiheessa.

source: topic number
fi: aiheen numero

source: There are no topics in %s.
fi: Kanavalla %s ei ole aiheita.

source: That topic is too long for this server (maximum length: %i; this topic: %i).
fi: Tuo aihe on liian pitkä tälle palvelimelle (maksimi pituus: %i; tämä aihe: %i).

source: Check if the user has any of the required capabilities to manage the channel topic. The list of required capabilities is in requireManageCapability channel config. Also allow if the user is a chanop. Since he can change the topic manually anyway.
fi: Tarkista onko käyttäjällä valtuudet, jotka on vaadittu kanavan aiheen hallintaan. Lista vaadituista valtuuksista on kanava-asetusarvossa requireManageCapability Salli myös jos käyttäjä on kanavaoperaattori, koska hän voisi vaihtaa aiheen muutenkin manuaalisesti.

source: [<channel>] Returns the topic for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa <kanavan> aiheen. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <topic> Adds <topic> to the topics for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <aihe> Lisää <aiheen> <kanavan> aiheisiin. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <topic> Adds <topic> to the topics for <channel>. If the topic is too long for the server, topics will be popped until there is enough room. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <aihe> Lisää <aiheen> <kanavan> aiheisiin. Jos aihe on liian pitkä palvelimelle, aihetta kutistetaan kunnes sille on tarpeeksi tilaa. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <number> <topic> Replaces topic <number> with <topic>.
fi: [<kanava>] <numero> <aihe> Korvaa aiheen <numero> <aiheella>.

source: [<channel>] <topic> Adds <topic> to the topics for <channel> at the beginning of the topics currently on <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <aihe> Lisää <aiheen> <kanavan> aiheisiin <kanavalla> sillä hetkellä olevien aiheiden alkuun. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] Shuffles the topics in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Sekoittaa aiheet <kanavalla>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: I can't shuffle 1 or fewer topics.
fi: En voi sekoittaa yhtä tai vähempää aihetta.

source: [<channel>] <number> [<number> ...] Reorders the topics from <channel> in the order of the specified <number> arguments. <number> is a one-based index into the topics. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <numero> [<numero> ...] Järjestää aiheet <kanavalla> järjestyksessä, joka on määritetty <numero> parametreillä. <Numero> on yksi-indexinen aiheisiin. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: I cannot reorder 1 or fewer topics.
fi: En voi uudelleen järjestää yhtä tai vähempää aihetta.

source: All topic numbers must be specified.
fi: Kaikki numerot täytyy määrittää.

source: Duplicate topic numbers cannot be specified.
fi: Kaksoiskappaleita aiheen numeroista ei voi määrittää.

source: [<channel>] Returns a list of the topics in <channel>, prefixed by their indexes. Mostly useful for topic reordering. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa listan aiheista <kanavalla>, etuliitettyinä indekseihinsä. Enimmäkseen hyödyllinen aiheen uudelleenjärjestämisessä. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <number> Returns topic number <number> from <channel>. <number> is a one-based index into the topics. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <numero> Palauttaa aiheen <numero> <kanavalta>. <Numero> on yksi-indexinen aiheissa. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <number> <regexp> Changes the topic number <number> on <channel> according to the regular expression <regexp>. <number> is the one-based index into the topics; <regexp> is a regular expression of the form s/regexp/replacement/flags. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <numero> <säännöllinen lauseke> Vaihtaa aiheen <numero> <kanavalla> <säännöllisen lausekkeen> mukaan. <numero> on yksi-indexinen aiheissa; <säännöllinen lauseke> on säännöllinen lauseke muodossa s/säännöllinen lauseke/korvaus/liput. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] [<number>] <topic> Sets the topic <number> to be <text>. If no <number> is given, this sets the entire topic. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [<numero>] <aihe> Asettaa aiheen <numero> <tekstiksi>. Jos <numeroa> ei ole annettu, tämä asettaa koko aiheen. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <number> Removes topic <number> from the topic for <channel> Topics are numbered starting from 1; you can also use negative indexes to refer to topics starting the from the end of the topic. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <numero> Poistaa aiheen <numero> <kanavan> aiheesta. Aiheet on numeroitu alkaen numerosta 1; voit käyttää negatiivisiä indexejä saadaksesi ne viittaamaan aiheisiin, jotka alkavat lopusta. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] Locks the topic (sets the mode +t) in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Lukitsee aiheen (asettaa tilan +t) <kanavalla>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: lock the topic
fi: lukitse aihe

source: [<channel>] Unlocks the topic (sets the mode -t) in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<channel>] Avaa aiheen (asettaa tilan -t) <kanavalla>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: unlock the topic
fi: avaa aiheen

source: [<channel>] Restores the topic to the last topic set by the bot. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa aiheen viimeiseksi aiheeksi, jonka botti on asettanut. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: I haven't yet set the topic in %s.
fi: En ole vielä asettanut aihetta kanavalla %s.

source: [<channel>] Restores the topic to the one previous to the last topic command that set it. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa aiheen yhdeksi edellisistä aiheista, jotka "last" komento on asettanut siksi. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: There are no more undos for %s.
fi: Kanavalle %s ei ole enempää kumouksia.

source: [<channel>] Undoes the last undo. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Kumoaa viimeisen kumouksen. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: There are no redos for %s.
fi: Kanavalle %s ei ole enempää kumouksia.

source: I refuse to swap the same topic with itself.
fi: Kieltäydyn vaihtamasta aiheen paikkaa sen itsensä kanssa.

source: [<channel>] Sets the topic in <channel> to the default topic for <channel>. The default topic for a channel may be configured via the configuration variable supybot.plugins.Topic.default.
fi: [<kanava>] Asettaa <kanavan> aiheen <channel>. Oletusaihe kanavalle voidaan määrittää asetusarvolla supybot.plugins.Topic.default.

source: There is no default topic configured for %s.
fi: Kanavalle %s ei ole määritetty oletusaihetta.

source: [<channel>] <separator> Sets the topic separator for <channel> to <separator> Converts the current topic appropriately.
fi: [<kanava>] <eroittaja> Asettaa <kanavan> eroittajan <eroittajaksi>, muuntaa nykyisen aiheen kunnollisesti.
