Repository: progval/Limnoria
Catalog: plugins/Plugin/locales/*.po
Languages: fr

source: This plugin exists to help users manage their plugins. Use 'plugin list' to list the loaded plugins; use 'plugin help' to get the description of a plugin; use the 'plugin' command itself to determine what plugin a command exists in.
fr: Ce plugin existe pour aider les utilisateurs à gérer leurs plugins. Utilisez 'list' pour liser les plugins chargés ; utilisez 'help' pour avoir de l'aide quant à d'autres plugins ; utilisez la commande 'plugin' elle-même pour déterminer dans quel plugin une commande existe.

source: <plugin> Returns a useful description of how to use <plugin>, if the plugin has one.
fr: <plugin> Retourne une description utile de comment utiliser le <plugin>, si le plugin en a une.

source: That plugin is loaded, but has no plugin help.
fr: Ce plugin est chargé mais n'a pas d'aide.

source: takes no arguments Returns a list of the currently loaded plugins.
fr: ne prend pas d'argument Retourne une liste des plugins actuellement chargés.

source: <command> Returns the name of the plugin that would be used to call <command>. If it is not uniquely determined, returns list of all plugins that contain <command>.
fr: <commande> Retourne le nom du plugin qui serait utilisé pour appeller la <commande>. Si il ne peut être déterminé (c'est à dire s'il y a un conflit, sans plugin par défaut), la liste de tous les plugins contenant cette commande sera renvoyée.

source: The %q command is available in the %L %s.
fr: La commande %q est disponibles dans le(s) plugin(s) %L%v.

source: There is no command %q.
fr: Il n'y a pas de commande %q.

source: <command> Returns the names of all plugins that contain <command>.
fr: <commande> Retourne les noms de tous les plugins contenant la <commande>.

source: <plugin> Returns the author of <plugin>. This is the person you should talk to if you have ideas, suggestions, or other comments about a given plugin.
fr: <plugin> Retourne l'auteur du <plugin>. C'est la personne à qui vous devriez parler si vous avez des idées, suggestions, ou d'autres commentaires à propos d'un plugin donné.

source: That plugin does not seem to be loaded.
fr: Ce plugin ne semble pas être chargé.

source: That plugin doesn't have an author that claims it.
fr: Ce plugin n'a pas d'auteur.

source: <plugin> [<nick>] Replies with a list of people who made contributions to a given plugin. If <nick> is specified, that person's specific contributions will be listed. Note: The <nick> is the part inside of the parentheses in the people listing.
fr: <plugin> [<nick>] Renvoie une liste des personnes ayant contribué à un plugin donné. Si le <nick> est spécifié, les contributions de cette personne seront lisées. Note : <nick> est la partie entre parenthèses lors du listing des personnes.

source: The %s plugin
fr: Le plugin s

source: has not been claimed by an author
fr: n'a aucun auteur

source: and
fr: et

source: has no contributors listed.
fr: n'a pas de contributeur listé.

source: was written by %s
fr: a été écrit par %s

source: %s %h contributed to it.
fr: %s y %h contribué.

source: has no additional contributors listed.
fr: n'a pas d'autre contributeur listé.

source: but
fr: mais

source: The nick specified (%s) is not a registered contributor.
fr: Le nick spécifié(%s) n'est pas un contributeur enregistré.

source: The %s plugin does not have '%s' listed as a contributor.
fr: Le plugin %s n'a pas '%s' listé comme contributeur.

source: command
fr: commande

source: the %L %s
fr: La/les commande(s) %L%v

source: the %L
fr: La/les %L

source: %s wrote the %s plugin and also contributed %L.
fr: %s a écrit le plugin %s et a aussi contribué à %L

source: %s contributed %L to the %s plugin.
fr: %s a contribué à %L et au plugin %s

source: %s wrote the %s plugin
fr: %s a écrit le plugin %s

source: %s has no listed contributions for the %s plugin.
fr: %s n'a pas de contribution listée pour le plugin %s.
