Repository: progval/Limnoria
Catalog: plugins/AutoMode/locales/*.po
Languages: es, fr

source: Determines whether this plugin is enabled.
es: Determina si este plugin está habilitado.
fr: Détermine si ce plugin est activé.

source: Determines whether this plugin will automode owners even if they don't have op/halfop/voice/whatever capability.
es: Determina si este plugin AutoMode propietarios incluso si no tienen lo que sea la capacidad op/halfop/voz.
fr: Détermine si ce plugin mettra des modes automatiques sur les owners, même si ils n'ont pas la capacité op/halfop/voice/...

source: Determines whether the bot will check for 'alternative capabilities' (ie. autoop, autohalfop, autovoice) in addition to/instead of classic ones.
es: Determina si el bot comprobar 'capacidades alternativas "(es decir. autoop, autohalfop, autovoz) además de/en lugar de los clásicos.
fr: Détermine si le bot vérifiera les « capacités alternatives » (ie. autoop, autohalfop, autovoice) en plus/à la place des capacités classiques.

source: Determines whether the bot will "fall through" to halfop/voicing when auto-opping is turned off but auto-halfopping/voicing are turned on.
es: Determina si el bot "caerá a través "de HALFOP / sonoridad cuando auto-Op está apagado pero auto-halfop a si mismos / sonido están activados.
fr: Détermine si le bot ne halfopera/voicera pas lorsque l'auto-op est désactivé, même si l'auto-halfopvoice est activé.

source: Determines whether the bot will automatically op people with the <channel>,op capability when they join the channel.
es: Determina si el bot automáticamente dar op con el <channel>, capacidad de op cuando se unen al canal.
fr: Détermine si le bot opera automatiquement les gens qui ont la capacité <canal>,op lorsqu'ils rejoignent le canal.

source: Determines whether the bot will automatically halfop people with the <channel>,halfop capability when they join the channel.
es: Determina si el bot automáticamente personas HALFOP con el <channel>, capacidad halfop cuando se unen a la canal.
fr: Détermine si le bot halfopera les gens qui ont la capacité <canal>,halfop lorsqu'ils rejoignent le canal.

source: Determines whether the bot will automatically voice people with the <channel>,voice capability when they join the channel.
es: Determina si el bot automáticamente gente de voz con el <channel>, capacidad de voz cuando se unen a la canal.
fr: Détermine si le bot voicera automatiquement les gens avec la capacité <canal>,voice lorsqu'ils rejoingent le canal.

source: Determines whether the bot will automatically ban people who join the channel and are on the banlist.
es: Determina si el bot automáticamente prohibir a la gente que se unen al canal y están en la lista de ban.
fr: Détermine si le bot bannira automatiquement les personnes qui rejoignent le canal et qui sont sur la liste de bannissement.

source: Determines how many seconds the bot will automatically ban a person when banning.
es: Determina cuántos segundos el bot prohibirá automáticamente a una persona cuando la prohibición.
fr: Détermine combien de secondes durera le bannissement que le bot posera sur une personne.

source: Determines how many seconds the bot will wait before applying a mode. Has no effect on bans.
es: Determina cuántos segundos esperará el bot antes de aplicar un modo. No tiene ningún efecto sobre las prohibiciones.
fr: Détermine combien de secondes le bot attendra avant d'appliquer un mode. Cela n'a aucun effet sur les bannissements.

source: Extra modes that will be applied to a user. Example syntax: user1+o-v user2+v user3-v
es: Modos adicionales que serán se aplica a un usuario. Ejemplo de sintaxis: usuario1 + o-v + v usuario2 usuario3-v
fr: Des modes supplémentaires à appliquer à un utilisateur. Par exemple : user1+o-v user2+v user3-v

source: This plugin, when configured, allows the bot to automatically set modes on users when they join.
es: Este plugin, cuando se configura, permite al bot para establecer automáticamente los modos en los usuarios cuando se unen.

source: Determines whether or not a mode has already been applied.
es: Determina si un modo ya tiene o ha aplicado.
fr: Détermine si un mode a déjà été appliqué ou non.
