Repository: progval/Limnoria
Catalog: plugins/Google/locale/*.po
Languages: fr

source: The Google plugin has the functionality to watch for URLs that match a specific pattern. (We call this a snarfer) When supybot sees such a URL, it will parse the web page for information and reply with the results.
fr: Le plugin Google sert à lire des URLs qui correspondent à un masque spécifique (nous appelons ça un 'snarfer'). Lorsque Supybot voit une telle URL, il parse la page web pour trouver des informations et répond avec les résultats.

source: Do you want the Google search snarfer enabled by default?
fr: Voulez-vous activer le snarfer de recherche Google par défaut ?

source: Value must be 1 <= n <= 8
fr: La valeur doit être comprise entre 1 et 8 (inclus)

source: Determines the URL that will be sent to Google for the Referer field of the search requests. If this value is empty, a Referer will be generated in the following format: http://$server/$botName
fr: Détermine l'URL qui sera envoyée à Google comme Referer pour les recerches. Si la valeur est vide, un Refere sera automatiquement généré dans le format : http://$server/$botNamr

source: Determines whether the search snarfer is enabled. If so, messages (even unaddressed ones) beginning with the word 'google' will result in the first URL Google returns being sent to the channel.
fr: Détermine si le snarger de recherche est activé. Si c'est le cas, les messages (même non adressés) commençant par 'google' seront répondus par la première URL que Google donne pour cette recherche.

source: Determines whether the word 'google' in the bot's output will be made colorful (like Google's logo).
fr: Détermine si le mot 'google' dans la sortie du bot sera coloré (comme le logo de Google)

source: Determines whether results are bolded.
fr: Détermine si les résultats sont mis en gras.

source: Determines the maximum number of results returned from the google command.
fr: Détermine le nombre maximum de résultats retournés par la commande google.

source: Determines what default language is used in searches. If left empty, no specific language will be requested.
fr: Détermine quand langue par défaut est utilisée dans les recherches. Si laissé vide, aucune langue spécifique ne sera demandée.

source: en
fr: fr

source: Determines what level of search filtering to use by default. 'active' - most filtering, 'moderate' - default filtering, 'off' - no filtering
fr: Détermine le niveau de filtrage à utiliser par défaut. 'active' filtre tout, 'moderate' est le filtre par défaut, et 'off' désactive le filtrage.

source: We broke The Google!
fr: Google est toukassay !

source: No matches found.
fr: Aucune correspondance.

source: [--snippet] <search> Does a google search, but only returns the first result. If option --snippet is given, returns also the page text snippet.
fr: [--snippet] <recherche> Effectue une recherche google, mais ne retourne que le premier résultat. Si l'option --snippet est donnée, retournera également un fragment de la page.

source: Google found nothing.
fr: Google n'a rien trouvé.

source: <search> [--{filter,language} <value>] Searches google.com for the given string. As many results as can fit are included. --language accepts a language abbreviation; --filter accepts a filtering level ('active', 'moderate', 'off').
fr: <recherche> [--filtre <valeur>] [--language <valeur>] Rercherche la chaîne donnée sur Google. Autant de résultats que possible sont donnés. --language accepte une abbréviation de langue ; --filter accepte un niveau de filtrage ('active', 'moderate', 'off').

source: <url> Returns a link to the cached version of <url> if it is available.
fr: <url> Retourne un lien vers la version en cache de l'<url>, si elle est disponible.

source: Google seems to have no cache for that site.
fr: Google semble ne pas avoir de cache pour ce site.

source: <search string> <search string> [<search string> ...] Returns the results of each search, in order, from greatest number of results to least.
fr: <chaîne 1> <chaîne 2> [<chaîne 3> ...] Retourne les résultats de chaque recherche, dans l'ordre, par ordre croissant du nombre de résultats.

source: <from-language> [to] <to-language> <text> Returns <text> translated from <from-language> into <to-language>. Beware that translating to or from languages that use multi-byte characters may result in some very odd results.
fr: <langue de départ> [to] <langue finale> <texte>

source: from language
fr: de la langue

source: Valid languages are: %L
fr: Les langues valides sont : %L

source: to language
fr: vers la langue

source: <expression> Uses Google's calculator to calculate the value of <expression>.
fr: <expression> Utilise la calculatrice Google pour calculer la valeur de l'<expression>.

source: Google says: Error: %s.
fr: Google dit : Erreur : %s.

source: <phone number> Looks <phone number> up on Google.
fr: <numéro de téléphone> Recherche le <numéro de téléphone> sur Google.

source: Google's phonebook didn't come up with anything.
fr: L'annuaire téléphonique de Google ne donne aucun résultat.
