Repository: progval/Limnoria
Catalog: plugins/Unix/locales/*.po
Languages: fi, fr, it

source: The "progstats" command can reveal potentially sensitive information about your machine. Here's an example of its output: %s
fi: "Progstats" komento voi paljastaa mahdollisesti henkilökohtaista tietoa tietokoneestasi. Tässä on näyte sen ulostulosta: %s
fr: La commande "progstats" peut révéler des informations potentiellement sensibles à propos de votre machine. Voici un exemple de sa sortie : %s
it: Il comando "progstats" può potenzialmente rivelare informazioni sensibili riguardo la tua macchina. Ecco un esempio del suo output: %s

source: Would you like to disable this command for non-owner users?
fi: Haluaisitko poistaa tämän komennon käytöstä muille käyttäjille, kuin omistajille?
fr: Voulez-vous désactiver cette commande pour les utilisateurs non-owners ?
it: Vuoi disabilitare questo comando per gli utenti non proprietari (owner)?

source: Determines what command will be called for the fortune command.
fi: Määrittää minkä komennon 'fortune' komento kutsuu.
fr: Détermine quelle commande doit être appelée par la commande 'fortune'
it: Determina quale comando verrà richiamato tramite "fortune".

source: Determines whether only short fortunes will be used if possible. This sends the -s option to the fortune program.
fi: Määrittää käytetäänkö vain lyhyitä ennustuksia, jos se on mahdollista. Tämä lähettää fortune ohjelmalle -s asetuksen.
fr: Détermine si seules les fortunes courtes seront utilisées si possible. Ceci envoie l'option -s au programme fortune.
it: Determina se verranno utilizzati solo fortune brevi. Questo invia l'opzione -s al programma fortune.

source: Determines whether fortune will give equal weight to the different fortune databases. If false, then larger databases will be given more weight. This sends the -e option to the fortune program.
fi: Määrittää antaako 'fortune' yhtäpaljon painoa erilaisille ennustustietokannoille. Jos tämä asetus on 'false', niin suuremmille tietokannoille annetaan enemmän painoa. Tämä lähettää -e asetuksen ennustus ohjelmalle.
fr: Détermine si les fortunes auront le même poids quel que soit la base de données. Si c'est False, alors les plus grandes bases de données auront plus de poids. Ceci envoie l'option -e au programme fortune.
it: Determines se fortune darà uguale peso ai diversi database; se impostato a False, quelli più grossi avranno la priorità. Questo invia l'opzione -e al programma fortune.

source: Determines whether fortune will retrieve offensive fortunes along with the normal fortunes. This sends the -a option to the fortune program.
fi: Määrittää hakeeko 'fortune' myös loukkaavia ennustuksia tavallisten ennustusten lisäksi. Tämä lähettää -a asetuksen ennustus ohjelmalle.
fr: Détermine si 'fortune' récupérera des fortunes offensibles, en plus des fortunes normales. Ceci envoie l'option -a au programme 'fortune'.
it: Determina se fortune recupererà citazioni offensive insieme alle normali. Questo invia l'opzione -a al programma fortune.

source: Determines what specific file (if any) will be used with the fortune command; if none is given, the system-wide default will be used. Do note that this fortune file must be placed with the rest of your system's fortune files.
fi: Määrittää mitä tiettyä tietokantaa (jos mitään) 'fortune' käyttää; jos yhtään ei ole käytetty, järjestelmän laajuista oletusta käytetään. Huomaa, että tämän ennustustiedoston täytyy olla sijoitettuna muiden järjestelmän ennustustiedostojen kanssa.
fr: Détermine quel fichier spécifique (si il y en a un) est utilisé par la commande 'fortune' ; si aucune n'est donné, le réglage par défaut du système sera utilisé. Notez que ce fichier doit être placé avec le reste de vos fichiers de fortunes.
it: Determina quale file specifico (eventuale) verrà usato con il comando fortune, se non è specificato utilizzerà il predefinito a livello di sistema. Nota che questo file va collocato insieme agli altri file di fortune presenti nel sistema.

source: Determines what command will be called for the spell command.
fi: Määrittää minkä komennon 'spell' komento kutsuu.
fr: Détermine quelle commande sera appelée par la commande 'spell'.
it: Determina quale comando verrà richiamato tramite "spell".

source: Determines what aspell dictionary will be used for spell checking.
fi: Määrittää mitä aspell sanakirjaa käytetään oikeinkirjoituksen tarkistukseen.
fr: Détermine quelle commande sera appelée par la commande 'spell'.
it: Determina quale dizionario di aspell verrà utilizzato per il controllo ortografico.

source: Determines what command will be called for the wtf command.
fi: Määrittää minkä komennon 'wtf' komento kutsuu.
fr: Détermine quelle commande sera appelée par la commande 'wtf'.
it: Determina quale comando verrà richiamato tramite "wtf".

source: Provides Utilities for Unix-like systems.
fi: Tarjoaa työkaluja Unixin kaltaisille järjestelmille.

source: <error number or code> Returns the number of an errno code, or the errno code of a number.
fi: <virhenumero tai koodi> Palauttaa virhenumeron , tai virhekoodin virhenumeron.
fr: <numéro d'erreur|code> Retourne le code du numéro d'erreur, ou le numéro d'erreur du code.
it: <numero errore o codice> Restituisce il numero di un codice di errore (errno) o il codice di errore di un numero.

source: I can't find the errno number for that code.
fi: En voi löytää virhenumeroa tuolle koodille.
fr: Je ne peux trouver le numéro d'erreur pour ce code.
it: Non trovo un numero di errore per quel codice.

source: (unknown)
fi: (tuntematon)
fr: (inconnu)
it: (sconosciuto)

source: takes no arguments Returns various unix-y information on the running supybot process.
fi: ei ota parametrejä Palauttaa muutamia unixmaisia tietoja suoritettavasta supybot prosessista.
fr: ne prend pas d'argument Retourn différentes informations unix-y à propos du processus de supybot.
it: non necessita argomenti Riporta varie informazioni unix-y sul processo supybot in esecuzione.

source: takes no arguments Returns the current pid of the process for this Supybot.
fi: ei ota parametrejä Palauttaa tämän Supybot prosessin nykyisen pidin.
fr: ne prend pas d'argument Retourne le pid du processus de Supybot.
it: non necessita argomenti Riporta l'attuale PID del processo per questo Supybot.

source: <password> [<salt>] Returns the resulting of doing a crypt() on <password>. If <salt> is not given, uses a random salt. If running on a glibc2 system, prepending '$1$' to your salt will cause crypt to return an MD5sum based crypt rather than the standard DES based crypt.
fi: <salasana> [<suola>] Palauttaa crypt():in tuloksen <salasanaan>. Jos <suola> ei ole annettu, satunnaista suolaa käytetään. Jos suoritetaan glibc2 järjestelmällä, '$1$' lisääminen kryptaukseesi aiheuttaa MD5 summaan perustuvan kryptauksen, mielummin kuin normaalin DES pohjaisen kryptin.
fr: <mot de passe> [<sel>] Retourne le résultat d'un crypt() sur le <mot de passe>. Si le <sel> n'est pas donné, utilise un sel aléatoire. Si on est sur un système glibc2, ajouter '$1$' au début de votre sel fera que crypt retournera un crypt basé sur MD5sum plutôt que sur le crypt basé sur DES standard.
it: <password> [<sale>] Riporta il risultato di crypt() su <password>. Se <sale> non è specificato, ne utilizza uno casuale. Se eseguito su un sistema glibc2, preporre '$1$' al sale restituirà una cifratura basata su MD5sum piuttosto che la standard DES.

source: <word> Returns the result of passing <word> to aspell/ispell. The results shown are sorted from best to worst in terms of being a likely match for the spelling of <word>.
fi: <sana> Palauttaa <sanan> lähetyksen aspell/ispell ohjelmaan. Palautuvat tulokset näytetään järjestyksessä parhaasta huonompaan sillä perusteella, kuinka todennäköisesti ne ovat oikein kirjoitettuja <sanoja>.
fr: <mot> Retourne le résultat du parsage du <mot> avec aspell/ispell. Les résultats affichés sont triés du meilleur au pire en fonction de comment ils correspondent au <mot>.
it: <parola> Riporta il risultato di passare <parola> ad aspell/ispell. I risultati mostrati sono ordinati dal migliore al peggiore in termini di essere una potenziale ortografia corretta di <parola>.

source: The spell checking command is not configured. If one is installed, reconfigure supybot.plugins.Unix.spell.command appropriately.
fi: Oikeinkirjoituksen tarkistusohjelma ei ole säädetty. Jos sellainen on asennttu, säädä supybot.plugins.Unix.spell.command sopivaksi.
fr: La commande de vérification orthographique ne semble pas être installée. Si il y en a une, configurez supybot.plugins.Unix.spell.command de façon appropriée.
it: Il comando di correzione ortografica non è configurato. Se ve n'è uno installato, configurare la variabile supybot.plugins.Unix.spell.command in modo appropriato.

source: <word> must begin with an alphabet character.
fi: <Sanan> täytyy alkaa aakkosellisella merkillä.
fr: <mo> doit commencer par une lettre de l'alphabet.
it: <parola> deve iniziare con un carattere dell'alfabeto.

source: No results found.
fi: Tuloksia ei löytynyt.
fr: Aucun résultat trouvé.
it: Nessun risultato trovato.

source: %q may be spelled correctly.
fi: %q saattaa olla kirjoitettu oikein.
fr: %q semble être orthographié correctement.
it: %q sembra scritto correttamente.

source: I could not find an alternate spelling for %q
fi: En löytänyt vaihtoehtoista kirjoitustapaa sanalle %q
fr: Je ne peux pas trouver d'orthographe alternative pour %q
it: Impossibile trovare un'ortografia alternativa per %q

source: Possible spellings for %q: %L.
fi: Mahdolliset kirjoitustavat sanalle %q ovat: %L.
fr: Orthographes possibles pour %q : %L
it: Ortografia possibile per %q: %L.

source: Something unexpected was seen in the [ai]spell output.
fi: Jotakin odottamatonta nähtiin [ai]spellin ulostulossa.
fr: Quelque chose d'imprévu a été trouvé dans la sortie de [ai]spell.
it: È stato trovato qualcosa di inaspettato nell'output di [ai]spell.

source: takes no arguments Returns a fortune from the *nix fortune program.
fi: ei ota parametrejä Palauttaa ennustuksen *nix ennustusohjelmalta.
it: non necessita argomenti Restituisce un biscottino della fortuna dal programma *nix fortune.

source: It seems the configured fortune command was not available.
fi: Näyttää siltä, että määritetty ennustusohjelma ei ollut saatavilla.
fr: Il semble que la commande fortune configurée ne soit pas disponible.
it: Sembra che il comando fortune configurato non sia disponibile.

source: The fortune command is not configured. If fortune is installed on this system, reconfigure the supybot.plugins.Unix.fortune.command configuration variable appropriately.
fi: Ennustuskomento ei ole määritetty. Jos fortune on asennettu tähän järjestelmään, määritä uudelleen asetusarvo supybot.plugins.Unix.fortune.command oikein.
fr: La commande fortune n'est pas configurée. Si fortune est installé sur ce système, configurez supybot.plugins.Unix.fortune.command de façon appropriée.
it: Il comando fortune non è configurato. Se ve n'è uno installato, configurare la variabile supybot.plugins.Unix.fortune.command in modo appropriato.

source: [is] <something> Returns wtf <something> is. 'wtf' is a *nix command that first appeared in NetBSD 1.5. In most *nices, it's available in some sort of 'bsdgames' package.
fi: [is] <jokin> Palauttaa mikä ihme <jokin> on. 'wtf' on *nix komento, joka ilmestyi ensin NetBSD 1.5 käyttöjärjestelmässä. Suurimmassa osassa *nixeistä, se on saatavilla jonkinlaisessa 'bsdgames' paketissa.
it: [is] <acronimo> Restituisce il significato di <acronimo>. "wtf" è un comando *nix apparso la prima volta in NetBSD 1.5. Nella maggior parte delle macchine *nix è disponibile nel pacchetto "bsdgames".

source: It seems the configured wtf command was not available.
fi: Vaikuttaa siltä, ettei määritetty wtf komento ollut saatavilla.
fr: Il semble que la commande wtf ne soit pas disponible.
it: Sembra che il comando wtf configurato non sia disponibile.

source: The wtf command is not configured. If it is installed on this system, reconfigure the supybot.plugins.Unix.wtf.command configuration variable appropriately.
fi: Wtf komento ei ole määritetty. Jos se on asennettu tähän järjestelmään, määritä supybot.plugins.Unix.wtf.command asetusarvo oikein.
fr: La commande wtf n'est pas configurée. Si elle est installée sur ce système, veuillez configurer supybot.plugins.Unix.wtf.command de façon appropriée.
it: Il comando wtf non è configurato. Se ve n'è uno installato, configurare la variabile supybot.plugins.Unix.wtf.command in modo appropriato.

source: takes no arguments Returns the uptime from the system the bot is runnning on.
fi: ei ota parametrejän Palauttaa järjestelmän, jolla botti on ylläoloajan.

source: takes no arguments Returns the uname -a from the system the bot is runnning on.
fi: ei ota parametrejä Palauttaa komennon "uname -a" ulostulon järjestelmästä, jossa botti on.

source: <command to call with any arguments> Calls any command available on the system, and returns its output. Requires owner capability. Note that being restricted to owner, this command does not do any sanity checking on input/output. So it is up to you to make sure you don't run anything that will spamify your channel or that will bring your machine to its knees.
fi: <komento kutsuttavaksi millä tahansa parametreillä> Kutsuu minkä tahansa komennon, joka on saatavilla järjestelmässä palauttaen sen ulostulon. Vaatii owner-valtuuden. Huomaa että, koska tämä komento on rajoitettu omistajalle, se ei tee minkäänlaista järjellisyystarkistusta sisäänmenoon/ulostuloon. Joten on oma tehtäväsi varmistaa, ettet suorita mitään, mikä sotkee kanavaasi, tai laittaa koneesi polvilleen.

source: <command to call with any arguments> Calls any command available on the system using the shell specified by the SHELL environment variable, and returns its output. Requires owner capability. Note that being restricted to owner, this command does not do any sanity checking on input/output. So it is up to you to make sure you don't run anything that will spamify your channel or that will bring your machine to its knees.
fi: <komento kutsuttavaksi millä tahansa patametreillä> Kutsuu minkä tahansa komennon, joka on saatavilla järjestelmässä käyttäen SHELL ympäristömuuttujaa, ja palauttaa sen ulostulon. Vaatii owner-valtuuden. Huomaa, että, koska tämä komento on rajoitettu omistajalle, se ei tee minkäänlaista järjellisyystarkistusta sisäänmenoon/ulostuloon. Joten on oma tehtäväsi varmistaa, ettet suorita mitään, mikä sotkee kanavaasi tai joka laittaa koneesi polvilleen.

source: [--c <count>] [--i <interval>] [--t <ttl>] [--W <timeout>] <host or ip> Sends an ICMP echo request to the specified host. The arguments correspond with those listed in ping(8). --c is limited to 10 packets or less (default is 5). --i is limited to 5 or less. --W is limited to 10 or less.
it: [--c <conteggio>] [--i <intervallo>] [--t <ttl>] [--W <timeout>] <host o ip> Invia una pacchetto ICMP di tipo echo request all'host specificato. Gli argomenti corrispondono a quelli del comando ping(8). --c è limitato a 10 pacchetti (il default è 5). --i è limitato a 5. --W è limitato a 10.

source: takes no arguments Returns the uptime from the system the bot is running on.
fr: ne prend pas d'argument Retourne l'uptime du système sur lequel fonctionne le bot.
it: non necessita argomenti Riporta l'uptime del sistema su cui è in esecuzione il bot.

source: takes no arguments Returns the uname -a from the system the bot is running on.
fr: ne prend pas d'argument Retourne le "uname -a" du système sur lequel le bot fonctionne.
it: non necessita argomenti Riporta il risultato di 'uname -a' dal sistema su cui è in esecuzione il bot.

source: <command to call with any arguments> Calls any command available on the system, and returns its output. Requires owner capability. Note that being restricted to owner, this command does not do any sanity checking on input/output. So it is up to you to make sure you don't run anything that will spamify your channel or that will bring your machine to its knees.
it: <comando da richiamare con qualsiasi argomento> Richiama qualsiai comando disponibile sul sistema e restituisce il suo output; richiede la capacità owner. Essendo limitato al proprietario, questo comando non fa alcun controllo su input e output; per cui sta a te assicurarti di non eseguire nulla che possa inviare molto testo in canale (flood) o che metta in ginocchio la tua macchina.
