Repository: progval/Limnoria
Catalog: plugins/RSS/locales/*.po
Languages: de, fi, fr, hu, it

source: Valid values include 'asInFeed', 'oldestFirst', 'newestFirst'.
fi: Kelvolliset arvot ovat 'asInFeed' (kuten syötteessä), 'oldestFirst' (vanhin ensin), 'newestFirst' (uusin ensin).
fr: Les valeurs valides sont 'asInFeed', 'oldestFirst', et 'newestFirst'.
it: I valori validi sono 'asInFeed', 'oldestFirst', 'newestFirst'.

source: Determines whether the bot will bold the title of the feed when it announces news.
fr: Détermine si le bot mettera en gras le titre des flux lorsqu'il annoncera des news.
hu: Meghatározza, hogy a bot félkövér betűvel írja-e ki a hírcsatorna címét, amikor bejelenti a híreket.

source: Determines what string is used to separate headlines in new feeds.
de: Gibt an welche Zeichenkette verwendet wird um Kopfzeilen neuer Feeds zu separieren.
fi: Määrittää mitä merkkiketjua käytetään erottamaan otsikot uusissa syötteissä.
fr: Détermine quelle chaîne est utilisé pour séparer les titres dans les nouveaux flux.
hu: Meghatározza, hogy milyen karakterlánc használt a főcímek elválasztására az új hírcsatornákban.
it: Determina quale stringa utilizzare per separare i titoli nei nuovi feed.

source: Determines what prefix is prepended (if any) to the news item announcements made in the channel.
fr: Détermine quel préfixe (s'il y en a un) est utilisé pour annoncer les news sur le canal.
hu: Meghatározza, hogy milyen előtag (ha van ilyen) legyen a csatornában bejelentett hírek előtt.

source: New news from
fr: Nouvelle(s) news de

source: Determines what suffix is appended to the feed name in a news item.
fr: Détermine quel suffixe est utilisé pour annoncer les news sur le canal.

source: Determines which RSS feeds should be announced in the channel; valid input is a list of strings (either registered RSS feeds or RSS feed URLs) separated by spaces.
de: Legt fest welche RSS Feeds in einem Kanal verkündet werden. Zulässige eingaben sind Listen von Zeichenketten (entweder registrierte RSS Feed oder URLs zu RSS Feed), mit einem Leerzeichen getrennt
fi: Määrittää kanavalla kuulutettavat RSS-syötteet. Kelvollinen asetusarvo on merkkiketju luettelo (joka sisältää rekisteröityjä RSS-syötteitä tai syöte -osoitteita) välilyönneillä erotettuina.
fr: Détermine quels flux RSS seront annoncés sur le canal ; une entrée valide est une liste de chaînes (des flux enregistrés ou des URLs de flux RSS), séparées par des espaces.
hu: Meghatározza, hogy melyik RSS hírcsatornák legyenek bejelentve a csatornában; az érvényes bemenet: karakterláncok (regisztrált RSS hírcsatornák vagy RSS hírcsatorna hivatkozások) szóközzel elválasztott listája.
it: Determina quali feed RSS sono annunciati in canale; una voce valida è un elenco di stringhe (sia di feed registrati sia di URL di feed) separate da spazi.

source: Indicates how many seconds the bot will wait between retrieving RSS feeds; requests made within this period will return cached results.
de: Zeigt wieviele Sekunden der Bot wartet, zwischen dem Empfangen von RSS Feeds; Anfragen die innerhalb dieser Zeit gemachten werden, führt zu zwischengespeicherten Ergebnissen.
fi: Määrittää kuinka monta sekuntia botti odottaa RSS syötteiden päivittämisten välillä; pyynnöt, jotka tehdän tällä ajalla palauttavat välimuistissa olevia tuloksia.
fr: Détermine le temps (en secondes) entre deux rafraichissement des flux RSS. Durant cette période, les flux seront mis en cache.
hu: Azt jelzi, hány másodpercet vár a bot az RSS hírcsatornák letöltése között; az ebben az időszakban végrehajtott kérések gyorsítótárazott eredményeket adnak vissza.
it: Indica ogni quanti secondi il bot recupererà i feed RSS; le richieste effettuate entro questo periodo verranno memorizzate nella cache.

source: Determines whether feed items should be sorted by their update timestamp or kept in the same order as they appear in a feed.
fr: Détermine si les éléments du flux doivent être triés selon la date de leur mise à jour ou si ils doivent être conservés dans l'ordre original du flux.
it: Determina se gli elementi del feed debbano essere ordinati per data di aggiornamento o mantenuti nello stesso ordine con il quale appaiono.

source: Determines what feeds should be accessible as commands.
de: Legt fest auf welche Feeds per Befehl zugegriffen werden darf.
fi: Määrittää mitten syötteiden pitäisi olla käytettävissä komentoina.
fr: Détermine quels flux sont accessibles en tant que commande.
hu: Meghatározza, hogy melyik hírcsatornák legyenek elérhetők parancsokként.
it: Determina quali feed siano accessibili come comandi.

source: Determines whether the bot will list the link along with the title of the feed when the rss command is called. supybot.plugins.RSS.announce.showLinks affects whether links will be listed when a feed is automatically announced.
de: Legt fest ob der Bot den Link zusammen mit dem Titel des Feeds aufgelistet wird, wenn der RSS Befehl aufgerufen wird. supybot.plugins.RSS.announce.showLinks ist zuständig dafür falls der Feed automatisch verkündet wird.
fr: Détermine si le bot listera le lien de chaque flus avec son titre, lorsque la commande rss est appelée. supybot.plugins.RSS.announce.showLinks affecte si les liens sont affichés lorsqu'un flux est annoncé automatiquement.
hu: Meghatározza, hogy a bot kiírja-e a hírcsatorna hivatkozását a címmel együtt az rss command meghívásakor. A supybot.plugins.RSS.announce.showLinks befolyásolja, hogy a linkek ki legyenek-e írva, amikor egy hírcsatorna automatikusan be van jelentve.
it: Determina se il bot elencherà i link con il titolo del feed quando viene richiamato il comando "rss". La variabile supybot.plugins.RSS.announce.showLinks determina se i link saranno mostrati quando un feed è annunciato automaticamente.

source: Indicates how many headlines an rss feed will output by default, if no number is provided.
fi: Ilmaisee kuinka monta otsikkoa RSS-syötteen ulostulossa on oletuksena, jos määrää ei määritetä komennossa.
fr: Indique combien d'éléments un flux rss affichera par défaut, si aucun nombre n'est donné.

source: Indicates how many headlines an rss feed will output when it is first added to announce for a channel.
fi: Ilmaisee kuinka monta otsikkoa RSS-syötteen ulostulossa on ensimmäisellä kerralla, kun sen kuuluttaminen lisätään kanavalle.
fr: Indique combien d'éléments un flux rss affichera lorsque qu'il vient d'être configuré pour être annoncé sur le salon.

source: Space separated list of strings, lets you filter headlines to those containing one or more items in this whitelist.
fi: Välilyönneillä erotettu lista merkkiketjuista, sallii otsikoiden suodattamisen yhteen tai useampaan kohteeseen, jotka ovat tällä valkoisella listalla.
fr: Liste séparée par des espaces de chaînes, qui vous permet de filtrer les éléments par liste blanche.

source: Space separated list of strings, lets you filter headlines to those not containing any items in this blacklist.
fi: Välilyönneillä erotettu lista merkkiketjuista, tämä sallii kohteiden, jotka ovat tällä mustalla listalla, suodattamisen pois.
fr: Liste séparée par des espaces de chaînes, qui vous permet de filtrer les éléments par liste noire.

source: Determines whether the bot will list the link along with the title of the feed when a feed is automatically announced.
de: Legt fest ob der Bot einen Link mit dem Feed Titel angeben soll wenn ein Feed automatisch verkündet wird.
fr: Détermine si le bot listera le lien de chaque flux avec le titre lorsqu'un flux est automatiquement annoncé.
hu: Meghatározza, hogy a bot kiírja-e a hírcsatorna hivatkozását a címmel együtt amikor egy hírcsatorna automatikusan be van jelentve.
it: Determina se il bot elencherà i link con il titolo del feed quando questo è annunciato automaticamente.

source: This plugin is useful both for announcing updates to RSS feeds in a channel, and for retrieving the headlines of RSS feeds via command. Use the "add" command to add feeds to this plugin, and use the "announce" command to determine what feeds should be announced in a given channel.
de: Dieses plugin wird verwendet um Updates eines RSS Feed in einem Kanal zu verkünden und um die Kopfzeilen des RSS Feeds über einen Befehl zu empfangen. Benutze "add" um Feeds zu diesem Plugin hinzuzufügen und benutze "announce" um festzulegen ob der Feed im gegeben Kanal verkündet werden soll.
fr: Ce plugin est utile pour annoncer des flux RSS sur un canal, et pour récupérer les en-tête des flux RSS via une commande. Utilisez la commande "add" pour ajouter des flux au plugin, et utilisez la commande "annonce" pour détermine quels flux pourront être annoncés sur un canal donné.
hu: Ez a bővítmény hasznos mind az RSS hírcsatornák frissítéseinek bejelentésére egy csatornában, és az RSS hírcsatornák főhivatkozásainek letöltésére egy parancssal. Használd az "add" parancsot hírcsatornák hozzáadásához, és használd az "announce" parancsot, hogy meghatározd, milyen hírcsatornák legyenek bejelentve a megadott csatornában.
it: Questo plugin è utile sia per annunciare feed RSS in un canale, sia per recuperare i titoli dei feed tramite un comando. Utilizza il comando "add" per aggiungere feed e "announce" per determinare quali feed devono essere annunciati in un dato canale.

source: <name> <url> Adds a command to this plugin that will look up the RSS feed at the given URL.
de: <Name> <URL> Fügt einen Befehl zu diesem Plugin hinzu, der den RSS Feed von angegebener URL abruft.
fi: <nimi> <url> Lisää tähän lisäosaan komennon, joka hakee RSS syötteen annetusta URL osoitteesta..
fr: <nom> <url> Ajoute un commande à ce plugin qui permet de regarder le flux situé à l'<url>.
hu: <név> <cím> Hozzáad egy parancsot ehhez a bővítményhez, amely le fogja kérdezni az RSS hírcsatornát a megadott hivatkozáson.
it: <nome> <url> Aggiunge un comando a questo plugin che cercherà i feed RSS all'URL specificato.

source: <name> Removes the command for looking up RSS feeds at <name> from this plugin.
de: <Name> Entfernt den Befehl um RSS Feeds von <Name> abzurufen aus diesem Plugin
fi: <nimi> Poistaa komennon, joka hakee RSS syötteet <nimestä>, lisäosasta.
fr: <nom> Supprime le flux des flux qui peuvent être lus grâce à une commande.
hu: <név> Eltávolítja a <név> RSS hírcsatornáinak lekérdezéséhez a bővítményből.
it: <nome> Rimuove il comando per cercare feed RSS con <nome>.

source: That's not a valid RSS feed command name.
de: Das ist kein gültiger RSS Feed Befehl.
fi: Tuo ei ole kelvollinen RSS sylte komento nimi.
fr: Ce n'est pas une commande de flux RSS valide
hu: Ez nem egy érvényes RSS hírcsatorna parancsnév.
it: Questo non è un comando di feed RSS valido.

source: [<channel>] Returns the list of feeds announced in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] Gibt eine Liste der Feeds, die in einem <Kanal> verkündet werden, zurück. <Kanal> ist nur nötig falls der Befehl nicht direkt im Kanal abgegeben wird.
fi: [<kanava>] Palauttaa listan RSS syötteistä, joita kuulutetaan <kanavalla>. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Retourne la liste des flux annoncés sur le <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
hu: [<csatorna>] Kiírja a <csatorna>-n bejelentett hírcsatornákat. <csatorna> csak akkor szükséges, ha az üzenet nem a csatornában van elküldve.
it: [<canale>] Restituisce l'elenco dei feed annunciati in <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I am currently not announcing any feeds.
de: Momentan kündige ich keine Feeds an.
fi: Minä en tällä hetkellä kuuluta yhtään syötettä.
fr: Je n'annonce actuellement aucun flux.
hu: Jelenleg nem jelentek be semmilyen hírcsatornát.
it: Attualmente non sto annunciando alcun feed.

source: [<channel>] <name|url> [<name|url> ...] Adds the list of feeds to the current list of announced feeds in <channel>. Valid feeds include the names of registered feeds as well as URLs for RSS feeds. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] <Name|URL> [<Name|URL> ...] Fügt die Liste der Feeds zur momentanen Liste der verkündeten Feeds eines <Kanal> hinzu. Zulässige Feeds umfassen die Namen von registrierten Feed als auch URLs für RSS Feeds. <Kanal> ist nur nötig falls die Nachricht nicht im Kanal gesendet wird.
fi: [<kanava>] <nimi|url> [<nimi|url> ...] Lisää listan syötteistä tällä hetkellä <kanavalla> kuulutettaviin syötteisiin. Kelvolliset syötteet sisältävät rekisteröityjen syötteiden nimet, kuten myös RSS syötteiden URL-osoitteet. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <nom|url> [<nom|url> ...] Ajoute la liste de flux à la liste actuelle des flux annoncés sur le <canal>. Vous devez indiquer le <nom> du flux si il est déjà enregistré, ou l'<url> dans le cas contraire. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
hu: [<csatorna>] <név|hivatkozás> [<név|hivatkozás> ...] Hozzáadja a hírcsatornák listáját a bejelentett hírcsatornák listájához <csatorna>-ban. Érvényes hírcsatornák közé tartoznak a regisztrált hírcsatornák nevei és az RSS hírcsatornák hivatkozásai. <csatorna> csak akkor szükséges, ha az üzenet nem a csatornában van elküldve.
it: [<canale>] <nome|url> [<nome|url> ...] Aggiunge l'elenco dei feed all'attuale elenco di quelli da annunciare in <canale>. Valori validi includono sia i nomi dei feed registrati sia i loro URL. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <name|url> [<name|url> ...] Removes the list of feeds from the current list of announced feeds in <channel>. Valid feeds include the names of registered feeds as well as URLs for RSS feeds. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] <Name|URL> [<Name|URL> ...] Entfernt die Liste der Feeds von der momentanen Liste der verkündeten Feeds eines <Kanal>. Zulässige Feeds umfassen die Namen von registrierten Feed als auch URLs für RSS Feeds. <Kanal> ist nur nötig falls die Nachricht nicht im Kanal gesendet wird.
fi: [<kanava>] <nimi|url> [<nimi|url> ...] Poistaa listan RSS syötteistä botin tällä hetkellä <kanavalla> kuuluttamista syötteistä. Kelvolliset syötteen nimet sisältävät URL osoitteet, kuten myös rekisteröidyt RSS syötteet. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <nom|url> [<nom|url> ...] Supprime la liste de flux de la liste actuelle des flux annoncés sur le <canal>. Vous devez indiquer le <nom> du flux si il est déjà enregistré, ou l'<url> dans le cas contraire. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
hu: [<csatorna>] <név|hivatkozás> [<név|hivatkozás> ...] Eltávolítja a hírcsatornák listáját a jelenleg bejelentett hírcsatornák listájából <csatorna>-ban. Érvényes hírcsatornák közé tartoznak a regisztrált hírcsatornák nevei és az RSS hírcsatornák hivatkozásai. <csatorna> csak akkor szükséges, ha az üzenet nem a csatornában van elküldve.
it: [<canale>] <nome|url> [<nome|url> ...] Rimuove l'elenco dei feed dall'attuale elenco dei feed da annunciare in. <canale>. Valori validi includono sia i nomi dei feed registrati sia i loro URL. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: <url> [<number of headlines>] Gets the title components of the given RSS feed. If <number of headlines> is given, return only that many headlines.
de: <URL> [<Anzahl der Kopfzeilen>] Empfängt die Titel des angegeben RSS Feeds. Falls <Anzahl der Kopfzeilen> angegeben wurde, werden nur soviele Kopfzeilen ausgegeben.
fr: <url> [<nombre de lignes>] Récupère le titre des éléments du flux RSS donné. si le <nombre de lignes> est donné, ne retourne que ce nombre de lignes d'en-tête.
hu: <hivatkozás> [<főcímek száma>] Lekérdezi a főcímeket a megadott RSS hírcsatornából. Ha <főcímek száma> meg van adva, csak annyi főcímet ír ki.
it: <url> [<numero di titoli>] Recupera i titoli del feed RSS specificato. Se <numero di titoli> è fornito, restituisce solo quella quantità.

source: Couldn't get RSS feed.
de: Konnte den RSS Feed nicht bekommen.
fi: RSS syötettä ei pystytty hakemaan.
fr: Ne peut récupérer le flux RSS.
hu: Nem sikerült elérni az RSS hírcsatornát.
it: Impossibile recuperare il feed RSS.

source: <url|feed> Returns information from the given RSS feed, namely the title, URL, description, and last update date, if available.
de: <URL|Feed> Gibt Informationen zum angegeben RSS Feed aus. Den Titel, URL, Beschreibung und das Datum des letzten Updates, wenn verfügbar.
fi: <url|syöte> Palauttaa tietoja annetusta RSS syötteestä, nimellisesti otsikon, URL, kuvauksen, ja viimeisen päivityksen, jos saatavilla.
fr: <url|flux> Retourne des informations sur le flux RSS donné : le titre, l'URL, la description, et la dernière mise à jour.
hu: <hivatkozás|hírcsatorna> Információt ír ki a megadott RSS hírcsatornáról, név szerint a címet, a hivatkozást, a leírást és a legutóbbi frissítés idejét, ha elérhető.
it: <url|feed> Riporta informazioni sul feed RSS specificato: titolo, URL, descrizione e data dell'ultimo aggiornamento.

source: I couldn't retrieve that RSS feed.
de: Ich konnte den RSS Feed nicht empfangen.
fi: En voinut noutaa tuota RSS syötettä.
fr: Je ne peux récupérer ce flux RSS.
hu: Nem tudtam lekérdezni a megadott RSS hírcsatornát.
it: Non riesco a recuperare questo feed RSS.

source: Title: %s; URL: %u; Description: %s; Last updated: %s.
de: Titel: %s; URL: %u; Beschreibung: %s; Zuletzt aktualisiert: %s.
fi: Otsikko: %s; URL: %u; Kuvaus: %s; Viimeeksi päivitetty: %s.
fr: Titre : %s , URL : %u ; description : %s ; dernière mise à jour : %s.
hu: Cím: %s; Hivatkozás: %u; Leírás: %s; Legutóbbi frissítés: %s.
it: Titolo: %s; URL: %u; Descrizione: %s; Ultimo aggiornamento: %s.

source: News from $feed_name: $title <$link>
fi: Uutisia lähteestä $feed_name: $title <$link>

source: The format the bot will use for displaying headlines of a RSS feed that is announced. See supybot.plugins.RSS.format for the available variables.
fi: Muoto, jotaa botti käyttää kuulutettavan RSS-syötteen otsikoiden näyttämiseen. Kelvolliset muuttujat näkee asetuksesta supybot.plugins.RSS.format.

source: [<number of headlines>] Reports the titles for %s at the RSS feed %u. If <number of headlines> is given, returns only that many headlines. RSS feeds are only looked up every supybot.plugins.RSS.waitPeriod seconds, which defaults to 1800 (30 minutes) since that's what most websites prefer.
fi: [<otsikoiden määrä>] Raportoi otsikot kohteelle %s RSS-syötteessä %u. Jos <otsikoiden määrä> on annettu, tämä palauttaa vain sen määrän otsikoita. RSS-syötteitä tarkistetaan asetuksen supybot.plugins.RSS.waitPeriod sekuntejen mukaan, joka on oletuksena 1800 (30 minuuttia), koska se on useimpien verkkosivujen suosima aika.

source: Return feed items, sorted according to sortFeedItems.
fi: Palauttaa syötteen kohteet järjestettynä sortFeedItems :in mukaan.
it: Riporta gli elementi del feed in base a sortFeedItems.

source: I already have a command in this plugin named %s.
fi: Minulla on jo komento %s tässä lisä-osassa.

source: I already have a feed with that URL named %s.
fi: Minulla on jo syöte nimeltä %s.

source: unavailable
fi: ei saatavilla

source: News from
hu: Hírek innen:
