Repository: progval/Limnoria
Catalog: plugins/BadWords/locales/*.po
Languages: es, fi, fr, it

source: Would you like to add some bad words?
es: ¿Te gustaría añadir alguna mala palabra?
fi: Haluaisitko lisätä joitakin pahoja sanoja?
fr: Voulez-vous ajouter quelques mots interdits ?
it: Vuoi aggiungere delle parole volgari?

source: What words? (separate individual words by spaces)
es: ¿Qué palabras? (palabras individuales separadas por espacios)
fi: Mitkä sanat? (Rajoita erilliset sanat käyttämällä välilyöntiä).
fr: Quels mots ? (séparez chaque mot par un espace)
it: Quali parole? (separa ciascuna con uno spazio)

source: Determines what words are considered to be 'bad' so the bot won't say them.
es: Determina qué palabras son considera que es "malo" por lo que el bot no decirlas.
fi: Määrittää mitkä sanat ovat 'pahoja', jottei botti sano niitä.
fr: Détermine quels mots sont considérés comme interdits, donc le bot ne les dira pas.
it: Determina quali parole sono considerate "volgari" per cui il bot non le pronuncerà.

source: Determines whether the bot will require bad words to be independent words, or whether it will censor them within other words. For instance, if 'darn' is a bad word, then if this is true, 'darn' will be censored, but 'darnit' will not. You probably want this to be false. After changing this setting, the BadWords regexp needs to be regenerated by adding/removing a word to the list, or reloading the plugin.
es: Determina si el bot requerirá mal palabras sean palabras independientes, o si se van a censurar dentro de otra palabras. Por ejemplo, si 'maldito' es una mala palabra, entonces si esto es cierto, 'maldito' serán censurados, pero 'darnit' no lo hará. Es probable que esta sea falsa. Después de cambiar este ajuste, los badwords expresión regular tiene que ser regenerado por añadir/eliminar una palabra a la lista, o volver a cargar el plugin.
fi: Määrittää vaatiiko botti pahojen sanojen olevan toisistaan riippumattomia sanoja, vai sensuroiko se ne toisten sanojen sisältä. Esimerkiksi, jos 'pah' on paha sana, ja jos tämä on asetus on true, 'pah' sensuroidaan, mutta 'pahus' ei sensuroida. Sinä luultavasti tahdot pitää tämän false:na. Tämän asetuksen muuttamisen jälkeen, BadWords säännöllinen lauseke täytyy luoda uudelleen lisäämällä/poistamalla sana listalta, tai lataamalla lisäosa uudelleen.
fr: Détermine si le bot requiert que les gros mots soient indépendants, ou si ils peuvent être dans d'autres mots. Par exemple, si 'merde' est censuré et que c'est True, 'merde' sera censuré, mais pas 'emmerder'. Il est probablement mieux que ceci soit False. Après avoir modifié ce paramètre, l'expression régulière de BadWords doit être regénérée en ajoutant/supprimant un mot de la liste, ou en rechargeant le plugin.
it: Determina se il bot richieda che le parole volgari siano indipendenti o all'interno di altre parole. Ad esempio, se "merda" è volgare e questa opzione è impostata a True, verrà censurata, ma "merdata" non lo sarà; probabilmente si preferisce che questa sia su False. Dopo aver modificato questa impostazione, la regexp di BadWords deve essere rigenerata con l'aggiunta o la rimozione di una parola dall'elenco o ricaricando il plugin.

source: Determines what characters will replace bad words; a chunk of these characters matching the size of the replaced bad word will be used to replace the bad words you've configured.
es: Determina qué caracteres reemplazarán malas palabras; un parte de estos caracteres que coincida con el tamaño de la mala palabra reemplazado voluntad usarse para reemplazar las malas palabras que ha configurado.
fi: Määrittä mitkä merkit korvaavat pahat sanat; osia näistä merkeistä, jotka sopivat pahan sanan kokoon, käytetään määrittämiesi pahojen sanojen korvaamisessa.
fr: Détermine par quels caractères seront remplacés les gros mots ; un morceau de ces caractères ayant la même taille que le mot remplacé sera utilisé pour remplacer les gros mots que vous avez configurés.
it: Determina quali caratteri sostituiranno le parole volgari, verranno utilizzati rimpiazzando la parola da censurare in tutta la sua lunghezza.

source: Determines the manner in which bad words will be replaced. 'nastyCharacters' (the default) will replace a bad word with the same number of 'nasty characters' (like those used in comic books; configurable by supybot.plugins.BadWords.nastyChars). 'simple' will replace a bad word with a simple strings (regardless of the length of the bad word); this string is configurable via supybot.plugins.BadWords.simpleReplacement.
es: Determina la manera en que serán reemplazados malas palabras. 'NastyCharacters' (por defecto), sustituirá a un mala palabra con el mismo número de 'personajes desagradables' (como los utilizados en cómics; configurable por supybot.plugins.BadWords.nastyChars). "Simple" reemplazará una mala palabra con un simple cuerdas (independientemente de la longitud de la mala palabra); esta cadena es configurable a través de supybot.plugins.BadWords.simpleReplacement.
fi: Määrittää millä tavalla pahat sanat korvataan. 'nastyCharacters' (oletus) korvaa pahan sanan samalla määrällä 'häijyjä merkkejä' (kuten ne jotka ovat sarjakuvissa; muokattavissa supybot.plugins.BadWords.nastyChars asetuksella). 'simple' korvaa pahan sanan yksinkertaisella merkkiketjulla (riippumatta pahan sanan koosta); tämä merkkiketju on muokattavissa asetuksella supybot.plugins.BadWords.simpleReplacement.
fr: Détermine la manière dont les gros mots sont remplacés. 'nastyCharacters' (par défaut) remplacera un gros mot par le même nombre de 'caractères obscènes' (comme ceux utilisés dans les bandes dessinées ; configurables dans supybot.plugins.BadWords.nastyChars). 'simple' remplacera le mot pas une simple chaîne (peu importe la taille du gros mot) ; cette chaîne est configurable dans supybot.plugins.BadWords.simpleReplacement.
it: Determina come verranno sostituite le parole volgari. "nastyCharacters" (predefinito) rimpiazzerà la parola con lo stesso numero di "brutti caratteri" (come quelli usati nei fumetti; configurabile da supybot.plugins.BadWords.nastyChars). "simple" sostituirà una parola volgare con una stringa semplice (indipendentemente dalla lunghezza della parola); questa stringa è configurabile tramite supybot.plugins.BadWords.simpleReplacement.

source: Determines what word will replace bad words if the replacement method is 'simple'.
es: Determina qué palabra reemplazará mal es decir, si el método de sustitución es "simple".
fi: Määrittää mikä sana korvaa pahat sanat jos korvausmenetelmä on 'simple'.
fr: Détermin quel mot remplacera les mots interdits, si la méthode de remplacement est 'simple'.
it: Determina quale parola sostituirà quelle volgari se viene usato il metodo "simple".

source: Determines whether the bot will strip formatting characters from messages before it checks them for bad words. If this is False, it will be relatively trivial to circumvent this plugin's filtering. If it's True, however, it will interact poorly with other plugins that do coloring or bolding of text.
es: Determina si el bot se tira caracteres de formato de los mensajes antes de que se les comprueba malas palabras. Si esto es falso, será relativamente trivial para eludir de este plugin filtrado. Si es cierto, sin embargo, va a interactuar mal con otro plugins que hacen coloración o la negrita del texto.
fi: Määrittää riisuuko botti muotoilun merkeistä ennen kuin se tarkistaa ne pahojen sanojen varalta. Jos tämä on 'False', on hyvin pinnallista kiertää tämän lisäosan suodatusta. Jos se kuitenkin on 'True', se on huonosti vuorovaikutuksessa tekstin värittämistä tai korostamista tekevien lisäosien kanssa.
fr: Détermine si le bot retirera les caractères de formattage avant de vérifier qu'ils contiennent des gros mots. Si ceci est False, ce sera relativement simple de contourner la protection. Si c'est True, toutefois, il fera perdre toute couleur ou formattage des autres plugins
it: Determina se il bot rimuoverà i caratteri di formattazione prima di controllare che contengano parole volgari. Se impostato a False sarà relativamente facile aggirare i filtri di questo plugin; tuttavia se impostato a True non interagirà con altri plugin che colorano o rendono il testo grassetto.

source: Determines whether the bot will kick people with a warning when they use bad words.
es: Determina si el bot se iniciará a las personas con una advertencia cuando use malas palabras.
fi: Määrittää potkiiko botti ihmiset varoituksella jos he käyttävät pahoja sanoja.
fr: Détermine si le bot kickera les gens avec un avertissement lorsqu'ils utilisent des gros mots.
it: Determina se il bot caccerà (kick) gli utenti con un avvertimento quando usano volgarità.

source: You have been kicked for using a word prohibited in the presence of this bot. Please use more appropriate language in the future.
es: Has sido expulsado por usar una palabra prohibido en la presencia de este robot. Por favor, use más apropiado idioma en el futuro.
fi: Sinut on potkittu kielletyn sanan käytöstä tämän botin läsnäollessa. Ole hyvä ja käytä asianmukaisempaa kieltä tulevaisuudessa.
fr: Vous avez été kické(e) parce que vous avez utilisé un mot interdit en la présence de ce bot. Veuillez utiliser un langage plus approprié par le futur.
it: Sei stato/a cacciato/a per aver usato parole proibite in presenza del bot. In futuro utilizza un linguaggio più appropriato.

source: Determines the kick message used by the bot when kicking users for saying bad words.
es: Determina el mensaje patada utilizado por el bot cuando patadas usuarios por decir malas palabras.
fi: Määrittää potkimisviestin, jota botti käyttää, kun potkii käyttäjiä pahojen sanojen käyttämistä.
fr: Détermine le message de kick utilisé par le bot lorsqu'il kick des utilisateurs utilisant des gros mots.
it: Determina il messaggio del kick utilizzato dal bot per espellere gli utenti che scrivono volgarità.

source: Maintains a list of words that the bot is not allowed to say. Can also be used to kick people that say these words, if the bot has op.
es: Mantiene una lista de palabras que el bot no está permitido decir. También se puede utilizar para echar a la gente que dicen estas palabras, si el bot tiene op.
fi: Säilyttää listaa sanoista, joita botin ei ole sallittua sanoa. Voidaan myös käyttää potkimaan ihmisiä, jotka sanovat näitä sanoja, jos botilla on opit.
it: Mantiene un elenco di parole che il bot non può dire. Se il bot ha lo stato di operatore, può essere anche utilizzato per cacciare (kick) utenti che scrivono queste parole.

source: takes no arguments Returns the list of words being censored.
es: no tiene argumentos Devuelve la lista de palabras que se censuró.
fi: ei ota parametrejä Palauttaa listan sanoista, joita sensuroidaan.
fr: ne prend pas d'argument Retourne une liste de mots qui sont censurés.
it: non necessita argomenti Riporta l'elenco delle parole censurate.

source: I'm not currently censoring any bad words.
es: No estoy actualmente censurando las malas palabras.
fi: En ole sensuroimassa yhtään pahaa sanaa juuri nyt.
fr: Je ne censure actuellement aucun mot.
it: Al momento non ho alcuna parola censurata.

source: <word> [<word> ...] Adds all <word>s to the list of words being censored.
es: <Palabra> [<palabra> ...] Añade todos <palabra> s a la lista de palabras que se censuró.
fi: <sana> [<sana> ...] Lisää kaikki <sana>(t) sensuroitaviin sanoihin.
fr: <mot> [<mot> ...] Ajoute tous les mots à la liste des mots que le bot ne doit pas dire.
it: <parola> [<parola> ...] Aggiunge <parola> all'elenco di quelle da censurare.

source: <word> [<word> ...] Removes <word>s from the list of words being censored.
es: <Palabra> [<palabra> ...] Elimina <palabra> s de la lista de palabras que se censuró.
fi: <sana> [<sana> ...] Poistaa <sana>(t) sensuroitujen sanojen listalta.
fr: <mot> [<mot> ...] Retire les <mot>s de la liste des mots que le bot ne doit pas dire.
it: <parola> [<parola> ...] Rimuove <parola> dall'elenco di quelle da censurare.
