Repository: progval/Limnoria
Catalog: plugins/ChannelLogger/locales/*.po
Languages: fi, fr, hu, it

source: Determines whether logging is enabled.
fi: Määrittää onko lokin pitäminen käytössä.
fr: Détermine si les logs sont activés.
hu: Meghatározza, hogy a naplózás engedélyezve van-e.
it: Determina se i log sono abilitati.

source: Determines whether channel logfiles will be flushed anytime they're written to, rather than being buffered by the operating system.
fi: Määrittää pitäisikö kanava lokitiedostot tallentaa silloin kun ne kirjoitetaan, mielummin kuin käyttöjärjestelmän puskuroimana.
fr: Détermine si le fichier de logs sera enregistré à chaque fois que l'on y écrit plutôt que d'être mis en buffer par le système d'exploitation.
hu: Meghatározza, hogy a csatorna naplófájlok mentve legyenek-e, amikor írva vannak, ahelyett, hogy az operációs rendszer pufferelje őket.
it: Determina se i file di log del canale verranno salvati ogni volta che sono scritti piuttosto che tenuti in memoria dal sistema.

source: Determines wether joins and parts are logged
fi: Määrittää kirjoitetaanko liittymiset ja poistumiset lokiin
fr: Détermine si les arrivées et les départs sont loggués.

source: Determines whether formatting characters (such as bolding, color, etc.) are removed when writing the logs to disk.
fi: Määrittää pitääkö muotoilumerkit (kuten korostukset, väri, jne.) poistaa kun lokeja kirjoitetaan levylle.
fr: Détermine si les caractères de formattage (comme le gras, la couleurs) sont supprimés lors de l'écriture des logs sur le disque.
hu: Meghatározza, hogy milyen formázási karakterek (olyan, mint félkövér, szín stb.) vannak eltávolítva a naplófájlok lemezre írásakor.
it: Determina se la formattazione dei caratteri (come grassetto, colori, ecc.) viene rimossa una volta che i log sono scritti sul disco.

source: Determines whether the logs for this channel are timestamped with the timestamp in supybot.log.timestampFormat.
fi: Määrittää laitetaanko tämän kanavan lokitiedostoihin aikaleimat aikaleimalla, joka on määritetty asetuksella supybot.log.timestampFormat.
fr: Détermine si les logs de ce canal sont 'timestampés' avec le format dans supybot.log.timestampFormat
hu: Meghatározza, hogy a csatorna naplójai el legyenek-e látva a supybot.log.timestampFormat-ban lévő időbélyegzővel.
it: Determina se i log per questo canale riportano data e ora (timestamp) con il formato indicato in supybot.log.timestampFormat.

source: Determines what string a message should be prefixed with in order not to be logged. If you don't want any such prefix, just set it to the empty string.
fi: Määrittää millä merkkiketjulla aloitettuja viestejä ei tallenneta lokiin. Jos et halua merkkiketjua, aseta se tyhjäksi merkkiketjuksi.
fr: Détermine par quelle chaîne un message doit être préfixé pour ne pas être loggué. Vous ne voulez probablement pas d'un tel préfixe, et simplement définir une chaîne vide.
hu: Meghatározza, hogy milyen karakterlánccal kell kezdődnie egy üzenetnek, hogy ne legyen naplózva. Ha nem szeretnél semmi ilyen előtagot, csak állítsd üres karakterláncra.
it: Determina con quale stringa debba essere prefissato un messaggio per non essere registrato. Se non si vuole alcun prefisso, impostare una stringa vuota.

source: Determines whether the bot will automatically rotate the logs for this channel. The bot will rotate logs when the timestamp for the log changes. The timestamp is set according to the 'filenameTimestamp' configuration variable.
fi: Määrittää kääntääkö botti automaattisesti lokit tällä kanavalla. Botti kääntää lokit kun kun aikaleima lokeille vaihtuu. Aikaleima asetetaan 'filenameTimestamp' asetusarvon mukaan.
fr: Détermine si le bot fera automatiquement une rotation des logs pour ce canal. Le bot fera tourner les logs lorsque leur timestamp changera. Le timestamp est défini par la variable de configuration 'filenameTimestamp'.
hu: Meghatározza, hogy a bot automatikusan elforgassa-e a csatorna naplófájljait. A bot elforgatja a naplófájlokat, amikor a naplófájl időbélyegzője megváltozik. Az időbélyegző a 'filenameTimestamp' konfigurációs változó szerint van beállítva.
it: Determina se il bot ruoterà automaticamente i log di questo canale. Verranno ruotati quando cambiano data e ora; il timestamp è impostato in base alla variabile "filenameTimestamp".

source: Determines how to represent the timestamp used for the filename in rotated logs. When this timestamp changes, the old logfiles will be closed and a new one started. The format characters for the timestamp are in the time.strftime docs at python.org. In order for your logs to be rotated, you'll also have to enable supybot.plugins.ChannelLogger.rotateLogs.
fi: Määrittää kuinka aikaleima, jota käytetään tiedostonimenä käännetyille lokeille, esitetään. Kun tämä aikaleima muuttuu vanhat lokitiedostot suljetaan ja uudet aloitetaan. Muotomerkit aikaleimoille ovat time.strftime documenteissa python.org :issa. Saadaksesi lokisi käännetyksi, sinun täytyy myös ottaa käyttöön supybot.plugins.ChannelLogger.rotateLogs.
fr: Détermine comment représenter le timestamp utilisé pour les noms de fichiers de logs 'tournants'. Lorsque ce timestamp change, l'ancien fichier de logs sera fermé, et un nouveau sera ouvert. Le format du timestamp est le même que celui de time.strftime (documentation disponible sur python.org). Pour avoir des logs 'tournant', vous devez activer supybot.plugins.ChannelLogger.rotateLogs.
hu: Meghatározza, hogyan legyen az elforgatott naplófájlok fájlnevéhez használt időbélyegző ábrázolva. Amikor ez az időbélyegző megváltozik, a régi naplófájlok le lesznek zárva és újak lesznek nyitva. A formázási karakterek az időbélyegzőhez a time.strftime-ban vannak a python.org dokumentációiban. Ahhoz, hogy a naplófájljaid el legyenek forgatva, engedélyezned kell a supybot.plugins.ChannelLogger.rotateLogs-t is.
it: Determina come rappresentare il timestamp usato per il nome del file da ruotare. Quando questo cambia, il vecchio file di log verrà chiuso e ne inizierà uno nuovo; il formato è lo stesso di time.strftime (documentazione su python.org). Affinché i log vengano ruotati, è inoltre necessario abilitare supybot.plugins.ChannelLogger.rotateLogs.

source: Determines whether the bot will partition its channel logs into separate directories based on different criteria.
fi: Määrittää osioiko botti kanavalokinsa eri hakemistoihin perustuen eri kriteereihin.
fr: Détermine si le bot partitionnera les logs de canaux dans des répertoires séparés, en fonction de différents critères.
hu: Meghatározza, hogy a bot szétválassza-e a csatorna naplóit különálló könyvtárakba különböző kritériumok alapján.
it: Determina se il bot suddividerà i log del canale in directory separate in base a criteri differenti.

source: Determines whether the bot will use a network directory if using directories.
fi: Määrittää käyttääkö botti verkkohakemistoa jos käytetään hakemistoja.
fr: Détermine si le bot utilisera un répertoire par réseau, si il utilise des répertoires.
hu: Meghatározza, hogy a bot használjon-e egy könyvtárat a hálózatnak, ha használ könyvtárakat.
it: Determina se, in caso si utilizzino directory, il bot userà una directory per network.

source: Determines whether the bot will use a channel directory if using directories.
fi: Määrittää käyttääkö botti kanavahakemistoa jos käytetään hakemistoja.
fr: Détermine si le bot utilisera un répertoire par canal, si il utilise des répertoires.
hu: Meghatározza, hogy a bot használjon-e egy könyvtárat a csatornának, ha használ könyvtárakat.
it: Determina se, in caso si utilizzino directory, il bot userà una directory per canale.

source: Determines whether the bot will use a timestamp (determined by supybot.plugins.ChannelLogger.directories.timestamp.format) if using directories.
fi: Määrittää käyttääkö botti aikaleimaa (supybot.plugins.ChannelLogger.directories.timestamp.format määrittämänä jos käytetään hakemistoja.
fr: Détermine si le bot utilisera un timestamp (déterminé par supybot.plugins.ChannelLogger.directories.timestamp.format), si il utilise des répertoires.
hu: Meghatározza, hogy a bot használjon-e egy időbályegzőt (a supybot.plugins.ChannelLogger.directories.timestamp.format által meghatározott) ha használ könyvtárakat.
it: Determina se, in caso si utilizzino directory, il bot userà un timestamp (definito da supybot.plugins.ChannelLogger.directories.timestamp.format).

source: Determines what timestamp format will be used in the directory structure for channel logs if supybot.plugins.ChannelLogger.directories.timestamp is True.
fi: Määrittää mitä aikaleimamuotoa käytetään hakemistorakenteessa kanavalokeille jos supybot.plugins.ChannelLogger.directories.timestamp on True.
fr: Détermine quel format de timestamp sera utilisé dans la structure de répertoires pour les logs de canaux si supybot.plugins.ChannelLogger.directories.timestamp est True.
hu: Meghatározza, milyen időbélyegző formátum lesz használva a könyvtárstruktúrában a csatorna naplófájlokhoz, ha a supybot.plugins.ChannelLogger.directories.timestamp True.
it: Determina quale formato di timestamp sarà utilizzato nella struttura della directory dei log del canale se supybot.plugins.ChannelLogger.directories.timestamp è impostata a True.

source: This plugin allows the bot to log channel conversations to disk.
fi: Tämä plugin sallii botin tallentaa kanavan keskustelut levylle.
