Repository: progval/Limnoria
Catalog: plugins/String/locales/*.po
Languages: fi, fr

source: Determines the maximum size of a string given to the levenshtein command. The levenshtein command uses an O(m*n) algorithm, which means that with strings of length 256, it can take 1.5 seconds to finish; with strings of length 384, though, it can take 4 seconds to finish, and with strings of much larger lengths, it takes more and more time. Using nested commands, strings can get quite large, hence this variable, to limit the size of arguments passed to the levenshtein command.
fi: Määrittää levenshtein komentoon annettavan merkkiketjun maksimimäärän. Levenshtein komento käyttää O(m*n) algoritmiä, mikä tarkoittaa, että merkkiketju, jonka koko on 256 voi viedä 1.5 sekuntia valmistumiseen; 384:n merkit piduudella se voi viedä 4 sekuntia valmistumiseen, ja suuremmilla merkkiketjuilla, se vie enemmän ja enemmän aikaa. Käyttäen sisäkkäisia komentoja, merkkiketjut voivat tulla hyvin pitkiksi ja tästä johtuen tämä asetusarvo on olemassa, rajoittaakseen levenshtein komentoon annettujen parametrien määrää.
fr: Détermine la taille maximum d'une chaîne donnée à la commande 'levenshtein'. Cette commande utiliser un algorithme O(m*n), ce qui signifie que pour une chaîne de taille 256, il peut prendre 1,5 seconde à se finir ; pour les chaînes de taille 384, il peut en prendre 4, et ainsi de suite. En utilisant des commandes inmbriquées, les chaînes peuvent devenir très grandes, donc, utilisez cette variable pour limiter la taille des arguments passés à la commande 'levenshtein'.

source: Determines the maximum time, in seconds, that a regular expression is given to execute before being terminated. Since there is a possibility that user input for the re command can cause it to eat up large amounts of ram or cpu time, it's a good idea to keep this low. Most normal regexps should not take very long at all.
fi: Määrittää enimmäisajan sekunteissa, joka annetaan säännöllisen lausekkeen suorittamiseksi, ennen lopetusta. Koska on mahdollista, että käyttäjän syöte re-komennolle voi aiheuttaa suuren RAM- tai CPU-ajan käytön, on hyvä ajatus pitää tämä matalana. Tavallisten säännöllisten lausekkeiden ei pitäisi kestää kauan.
fr: Détermine le temps maximum, en seconde, que peut prendre l’exécution d’une expression rationnelle avant qu’elle ne soit terminée. Étant donné qu’il est possible aux utilisateurs de donner des paramètres à la commande « re » qui font qu’elle utilise beaucoup de RAM ou de temps CPU, c’est une bonne idée de garder ce temps assez bas. L’exécution de la plupart des expressions rationnelles normales n’est pas longue du tout.

source: Provides useful commands for manipulating characters and strings.
fi: Tarjoaa hyödyllisiä komentoja merkkien ja merkkiketjujen manipulointiin.

source: <letter> Returns the 8-bit value of <letter>.
fi: <kirjain> Palauttaa <kirjaimen> 8-bittisen arvon.
fr: <lettre> Retourne la valeur 8 bits de la <lettre>.

source: <number> Returns the character associated with the 8-bit value <number>
fi: <numero> Palauttaa merkin, joka on yhdistetty 8-bittisen <numeron> arvon.
fr: <nombre> Retourne le caractère associé à la valeur 8-bits du <nombre>

source: That number doesn't map to an 8-bit character.
fi: Tuo numero ei kartoitu 8-bittiseen merkkiin.
fr: Ce nombre ne correspond pas à un caractère 8 bits.

source: <encoding> <text> Returns an encoded form of the given text; the valid encodings are available in the documentation of the Python codecs module: <http://docs.python.org/library/codecs.html#standard-encodings>.
fi: <salaus> <teksti> Palauttaa salatun version annetusta tekstistä; kelvolliset salaukset ovat saatavilla Python codecs moduulin dokumentaatiossa: <http://docs.python.org/library/codecs.html#standard-encodings>.
fr: <encodage> <texte> Retourne la forme encodée du texte donnée ; les encodages valides sont disponibles dans la documentation du module codec de Python : http://docs.python.org/library/codecs.html#standard-encodings

source: encoding
fi: salaus
fr: encodage

source: <encoding> <text> Returns an un-encoded form of the given text; the valid encodings are available in the documentation of the Python codecs module: <http://docs.python.org/library/codecs.html#standard-encodings>.
fi: <salaus> <teksti> Palauttaa salaamattoman version annetusta tekstistä; kelvolliset salaukset ovat saatavilla Python codecs moduulin dokumentaatiossa: <http://docs.python.org/library/codecs.html#standard-encodings>.
fr: <encodage> <texte> Retourne la forme désencodée du texte donnée ; les encodages valides sont disponibles dans la documentation du module codec de Python : http://docs.python.org/library/codecs.html#standard-encodings

source: base64 string
fi: base64 merkkiketju
fr: chaîne base64

source: Base64 strings must be a multiple of 4 in length, padded with '=' if necessary.
fi: Base64 merkkiketjujen täytyy olla kerrollisia 4:llä, pehmustettuna '='-merkillä jos vaadittu.
fr: Les chaînes base64 doivent avoir une longueur multiple de 4, entourées de '=' si nécessaire.

source: <string1> <string2> Returns the levenshtein distance (also known as the "edit distance" between <string1> and <string2>)
fi: <mekkiketju1> <merkkiketju2> Palauttaa levenshtein etäisyyden (tunnetaan myös nimellä "muokkaus etäisyys" <merkkiketju1:den> ja <merkkiketju2:den> välillä.)
fr: <chaîne 1> <chaîne 2> Retourne la distance levenhtein (aussi connue sous le nom de "distance d'édition) entre les deux chaînes.

source: Levenshtein distance is a complicated algorithm, try it with some smaller inputs.
fi: Levenshtein etäisyys on monimutkainen algoritmi, kokeile sitä pienemmillä sisäänmenoilla.
fr: La distance levenshtein est un algorithme compliqué ; essayez avec des données plus petites.

source: <text> Returns the length of <text>.
fi: <teksti> Palauttaa <tekstin> pituuden.
fr: <texte> Retourne la longueur du <texte>.

source: <regexp> <text> If <regexp> is of the form m/regexp/flags, returns the portion of <text> that matches the regexp. If <regexp> is of the form s/regexp/replacement/flags, returns the result of applying such a regexp to <text>.
fi: <säännöllinen lauseke> <teksti> Jos <säännöllinen lauseke> on yksi muodosta m/säännöllinen lauseke/liput, palauta <tekstin> osa, joka täsmää säännölliseen lausekkeeseen. Jos <säännöllinen lauseke> on muotoa s/säännöllinen lauseke/korvaus/liput, palauttaa sellaisen säännöllisen lausekkeen käytön <tekstiin>.
fr: <expression régulière> <texte> Si l'<expression régulière> est de la forme de m/regexp/flags, retourne la portion du <texte> correspondant à l'expression régulière. Si l'<expression régulière> est de la forme de s/regexp/remplacement/flags, retourne le résultat de l'application de l'expression régulière sur le <texte>.

source: You probably don't want to match the empty string.
fi: Et luultavasti halua täsmätä tyhjään merkkiketjuun.
fr: Vous ne voulez probablement appliquer une expression régulière sur une chaîne vide.

source: <password> <text> Returns <text> XOR-encrypted with <password>. See http://www.yoe.org/developer/xor.html for information about XOR encryption.
fi: <salasana> <teksti> Palauttaa <tekstin> XOR-salattuna <salasanalla>. Katso http://www.yoe.org/developer/xor.html saadaksesi lisätietoja XOR salauksesta.
fr: <mot de passe> <texte> Retourne le <texte>, encrypté par la méthode XOR avec le <mot de passe>. Lisez http://www.yoe.org/developer/xor.html pour plus d'informations sur le cryptage XOR.

source: <text> Returns the md5 hash of a given string. Read http://www.rsasecurity.com/rsalabs/faq/3-6-6.html for more information about md5.
fi: <teksti> Palauttaa md5 hashin annetusta merkkiketjusta. Lue http://www.rsasecurity.com/rsalabs/faq/3-6-6.html saadaksesi lisätietoja md5:stä.
fr: <texte> Retourne le hash md5 de la chaîne donnée. Lisez http://www.rsasecurity.com/rsalabs/faq/3-6-6.html pour plus d'informations à propos de md5.

source: <text> Returns the SHA hash of a given string. Read http://www.secure-hash-algorithm-md5-sha-1.co.uk/ for more information about SHA.
fi: <teksti> Palauttaa SHA hashin annetulle merkkiketjulle. Lue http://www.secure-hash-algorithm-md5-sha-1.co.uk/ saadaksesi lisätietoa SHA:sta.
fr: <texte> Retourne le hash SDA de la chaîne donnée. Lisez http://www.secure-hash-algorithm-md5-sha-1.co.uk/ pour plus d'informations à propos de SHA.

source: <string> [<length>] Returns the Soundex hash to a given length. The length defaults to 4, since that's the standard length for a soundex hash. For unlimited length, use 0. Maximum length 1024.
fr: <chaîne> [<longueur>] Retourne un hash Soundex de la longueur donnée. La longueur par défaut est de 4, c'est le standard pour un hash soundex. Pour une longueur illimitée, utilisez 0. La longueur maximum est 1024.
