Repository: progval/Limnoria
Catalog: plugins/Services/locales/*.po
Languages: de, fi, fr, it

source: Determines what password the bot will use with NickServ when identifying as %s.
de: Legt fest welches Passwort der Bot verwenden wird um sich als %s bei NickServ zu identifizieren.
fi: Määrittää mitä salasanaa botti käyttää, kun tunnistautuu %s:ksi NickServillä.
fr: Détermine quel mot de passe le bot utilisera pour s'identifier à NickServ lors de l'identification à %s.
it: Determina quale password il bot userà con NickServ per identificarsi come %s.

source: What is your registered nick?
de: Wie ist der registrierte Nick?
fi: Mikä on rekisteröity nimimerkkisi?
fr: Quel est votre nick enregistré ?
it: Qual è il tuo nick registrato?

source: What is your password for that nick?
de: Was ist dein Passwort für den Nick?
fi: Mikä on salasanasi tuolle nimimerkille?
fr: Quel est votre mot de passe pour ce nick ?
it: Qual è la password per questo nick?

source: What is your ChanServ named?
de: Wie heißt der ChanServ?
fi: Minkä niminen ChanServisi on?
fr: Comment est nommé ChanServ ?
it: Come si chiama ChanServ?

source: What is your NickServ named?
de: Wie heißt der NickServ?
fi: Minkä niminen NickServisi on?
fr: Comment est nommé NickServ ?
it: Come si chiama NickServ?

source: Determines what networks this plugin will be disabled on.
de: Legt fest auf welchen Netzwerken dieses Plugin deaktiviert sein soll.
fi: Määrittää missä verkoissa tämä lisäosa on poistettu käytöstä.
fr: Détermine sur quels réseaux ce plugin sera désactivé.
it: Determina su quali reti sarà disattivato questo plugin.

source: Determines whether the bot will not join any channels until it is identified. This may be useful, for instances, if you have a vhost that isn't set until you're identified, or if you're joining +r channels that won't allow you to join unless you identify.
de: Legt fest ob der Bot Kanäle betreten soll, solange er noch nicht identifiziert ist. Das könnte nützlich sein falls du einen vHost hast der erst nach dem Identifizeren gesetzt wird, oder du +R Kanaäle betreten willt, die es nicht erlauben sie zu betreten solange du nicht identifiziert bist.
fi: Määrittää liittyykö botti millekään kanavalle ennen kuin se on tunnistautunut. Tämä voi olla hyödyllinen, esimerkiksi, jos sinulla on vhost, jota ei aseteta ennen kuin tunnistaudut, tai jos olet liittymässä +r kanaville, jotka eivät salli sinun liittyvän, paitsi jos olet tunnistautunut.
fr: Détermine si le bot peut rejoindre un ou des canal(aux) avant d'être identifié. Ce peut être utilise, par exemple si vous utilisez une vhost qui n'est activée qu'une fois que vous êtes identifié, ou encore si vous devez rejoindre des canaux en +r (=des canaux que l'on ne peut joindre sans être identifié)
it: Determina se il bot non entrerà in alcun canale finché non è identificato. Può essere utile, ad esempio, se si utilizza un vhost che non viene impostato fino a che non ci si identifica oppure se si necessita di entrare in un canale con un mode +r (su Freenode, +j su Azzurra) che non permette il join a utenti non identificati.

source: Determines what nick the 'NickServ' service has.
de: Legt fest welchen Nick der 'NickServ' Service hat.
fi: Määrittää mikä nimimerkki 'NickServ' palvelulla on.
fr: Détermine quel nick NickServ a.
it: Determina quale nick ha il servizio "NickServ".

source: Determines what nick the 'ChanServ' service has.
de: Legt fest welchen Nick der 'ChanServ' Service hat.
fi: Määrittää mikä nimimerkki 'ChanServ' palvelulla on.
fr: Détermine quel nick ChanServ a.
it: Determina quale nick ha il servizio "ChanServ".

source: Determines what password the bot will use with ChanServ.
de: Legt fest welches Passwort der Bot für den ChanServ nutzt.
fi: Määrittää mitä salasanaa botti käyttää ChanServin kanssa.
fr: Détermine quel mot de passe le bot utilisera avec ChanServ.
it: Determina quale password il bot userà con ChanServ.

source: Determines whether the bot will request to get opped by the ChanServ when it joins the channel.
de: Legt fest ob der Bot Op von ChanServ erfragen soll, sobald er einen Kanal betritt.
fi: Määrittää pyytääkö botti ChanServin oppaamaksi tulemista, kun se liittyy kanavalle.
fr: Détermine si le bot demandera à être oppé par ChanServ lorsqu'il rejoint le canal.
it: Determina se il bot richiederà lo stato di op da ChanServ quando entra nel canale.

source: Determines whether the bot will request to get half-opped by the ChanServ when it joins the channel.
de: Legt fest ob der Bot halb-Op von ChanServ erfragen soll, sobald er einen Kanal betritt.
fi: Määrittää pyytääkö botti tulla ChanServin puolioppaamaksi, kun se liittyy kanavalle.
fr: Détermine si le bot demandera à être oppé par NickServ lorsqu'il rejoint le canal.
it: Determina se il bot richiederà lo stato di halfop da ChanServ quando entra nel canale.

source: Determines whether the bot will request to get voiced by the ChanServ when it joins the channel.
de: Legt fest ob der Bot Voice von ChanServ erfragen soll, sobald er einen Kanal betritt.
fi: Määrittää pyytääkö botti ChanServiltä äänen, kun se liittyy kanavalle.
fr: Détermine si le bot demandera à être voicé par ChanServ lorsqu'il rejoint le canal.
it: Determina se il bot richiederà il voice da ChanServ quando entra nel canale.

source: This plugin handles dealing with Services on networks that provide them. Basically, you should use the "password" command to tell the bot a nick to identify with and what password to use to identify with that nick. You can use the password command multiple times if your bot has multiple nicks registered. Also, be sure to configure the NickServ and ChanServ configuration variables to match the NickServ and ChanServ nicks on your network. Other commands such as identify, op, etc. should not be necessary if the bot is properly configured.
de: Die Plugin kümmert sich um die Services, die das Netzwerk anbietet. Du solltest den "password" Befehl nutzen um den Bot zu sagen mit welchem Nick er sich identifizieren soll und welches Passwort er verwenden soll um sich zu identifizieren. Du kanns den Passwort Befehl mehrere Male benutzen, falls dein Bot mehrere Nicks registriert hat. Stelle außerdem sicher,dass die NickServ und ChanServ Variablen auf die NickServ und ChanServ Nicks im Netzwerk zutreffen. Andere Befehle, wie identify, op etc., sollten nicht nötig sein falls der Bot richtig konfiguriert ist.
fi: Tämä lisäosa hoitaa palvelut verkoissa, jotka tarjoavat niitä. Perusteellisesti, sinun pitäisi käyttää komentoa "password" kertoaksesi botille millä salasanalla ja tunnuksella se tunnistautuu. Voit käyttää salasanakomentoa monta kertaa, mikäli botillasi on monta rekisteröityä nimimerkkiä. Varmista myös, että asetusarvot täsmäävät NickServin ja ChanServin nimimerkkeihin verkossasi. Muiden komentojen, kuten identify, op, jne. ei pitäisi olla vaadittuja, jos botti on määritetty hyvin.
fr: Ce plugin gère les services sur les réseaux qui en fournissent. En général, vous pouvez utiliser la commande 'password' pour dire au bot de prendre un nick et de s'identifier avec le mot de passe. Vous pouvez utiliser la commande 'password' autant de fois que le bot a de nicks enregistrés. Aussi, assurez-vous de configurer les variables NickServ et ChanServ pour correspondre à leurs nicks respectifs sur le réseau en question. D'autres commandes, comme 'identify', 'op', ... ne sont pas nécessaires quand le bot est configuré correctement.
it: Questo plugin gestisce i servizi su reti che li forniscono. Fondamentalmente va usato il comando "password" per fornire al bot un nick con il quale identificarsi e quale password usare; se il bot ha più nick registrati, è possibile usare tale comando più volte. Assicurati di impostare le variabili di configurazione NickServ e ChanServ in modo che corrispondano ai rispettivi nick sulla rete in questione. Se il bot è ben configurato, gli altri comandi come "identify", "op", ecc. non dovrebbero essere necessari.

source: You must set supybot.plugins.Services.ChanServ before I'm able to send the %s command.
de: Du musst supybot.plugins.Services.ChanServ setzen, damit es mir möglich ist den %s Befehl auszuführen.
fi: Sinun täytyy asettaa supybot.plugins.Services.ChanServ ennen kuin pystyn lähettämään komennon %s.
fr: vous devez définir supybot.plugins.Services.ChanServ avant que je ne puisse envoyer la commande %s
it: È necessario impostare la variabile supybot.plugins.Services.ChanServ affinché possa inviare il comando %s.

source: [<channel>] Attempts to get opped by ChanServ in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] Versucht Op durch ChanServ im <Kanal> zu bekommen. <Kanal> ist nur notwendig, falls die Nachricht nicht im Kanal selbst gesendet wurde.
fi: [<kanava>] Yrittää päästä ChanServin oppaamaksi <kanavalla>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Demande à être opé par ChanServ sur le <canal>. <canal> n'est nécessaire que si la commande n'est pas envoyée sur le canal lui-même.
it: [<canale>] Tenta di ricevere lo stato di op da ChanServ in <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I'm already opped in %s.
de: Ich habe schon Op in %s.
fi: Minut on jo opattu kanavalla %s.
fr: Je suis déjà opé sur %s.
it: Sono già op in %s.

source: [<channel>] Attempts to get voiced by ChanServ in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] Versucht Voice durch ChanServ im <Kanal> zu bekommen. <Kanal> ist nur notwendig, falls die Nachricht nicht im Kanal selbst gesendet wurde.
fi: [<kanava>] Yrittää saada ChanServiltä äänen <kanavalla>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Demande à être voicé par ChanServ sur le <canal>. <canal> n'est nécessaire que si la commande n'est pas envoyée sur le canal lui-même.
it: [<canale>] Tenta di ricevere il voice da ChanServ in <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I'm already voiced in %s.
de: Ich habe schon Voice in %s.
fi: Minulla on jo ääni kanavalla %s.
fr: Je suis déjà voicé sur %s.
it: Ho già il voice in %s.

source: [<channel>] Attempts to get unbanned by ChanServ in <channel>. <channel> is only necessary if the message isn't sent in the channel itself, but chances are, if you need this command, you're not sending it in the channel itself.
de: [<Kanal>] Versucht Op durch ChanServ im <Kanal> zu bekommen. <Kanal> ist nur notwendig, falls die Nachricht nicht im Kanal selbst gesendet wurde, wahrscheinlich wird der Befehl sowieso nicht im Kanal selbst gesendet, wenn du den Befehl braucht.
fi: [<kanava>] Yrittää poistaa porttikiellon <kanavalta> käyttämällä ChanServiä. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään, mutta luultavast jos tarvitset tätä komentoa, et ole kanavallai itsellään.
fr: [<canal>] Cherche à être débanni par ChanServ sur le <canal>. <canal> n'est nécessaire que si la commande n'est pas envoyée sur le canal lui-même, mais, vous n'avez probablement pas besoin d'utiliser cette commande sur le canal en question.
it: [<canale>] Tenta di farsi rimuovere il ban da ChanServ in <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso, ma è probabile che se serve questo comando non lo si stia inviando in canale.

source: [<channel>] Attempts to get invited by ChanServ to <channel>. <channel> is only necessary if the message isn't sent in the channel itself, but chances are, if you need this command, you're not sending it in the channel itself.
de: [<Kanal>] Versucht Op durch ChanServ im <Kanal> zu bekommen. <Kanal> ist nur notwendig, falls die Nachricht nicht im Kanal selbst gesendet wurde, wahrscheinlich wird der Befehl sowieso nicht im Kanal selbst gesendet, wenn du den Befehl braucht.
fi: [<channel>] Yrittää saada ChanServiltä kutsun <kanavalle>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään, mutta luultavasti jos tarvitset tätä komentoa, et lähetä sitä kanavalla itsellään.
fr: [<canal>] Cherche à être invité par ChanServ sur le <canal>. <canal> n'est nécessaire que si la commande n'est pas envoyée sur le canal lui-même, mais, vous n'avez probablement pas besoin d'utiliser cette commande sur le canal en question.
it: [<canale>] Tenta di essere invitato da ChanServ in <canale>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso, ma è probabile che se serve questo comando non lo si stia inviando in canale.

source: takes no arguments Identifies with NickServ using the current nick.
de: hat keine Argumente Identifiziert mit dem NickServ mit dem momentanen Nick.
fi: ei ota parametrejä Tunnistautuu NickServille käyttämällä nykyistä nimimerkkiä.
fr: ne prend pas d'argument S'identifie auprès de NickServ, en utilisant le nick actuel.
it: non necessita argomenti Si identifica con NickServ utilizzando l'attuale nick in uso.

source: I don't have a configured password for my current nick.
de: Du hast kein Passwort für meinen momentanen Nick konfiguriert.
fi: Minulla ei ole määritettyä salasanaa nimimerkilleni.
fr: Je n'ai pas de mot de passe configuré pour mon nick actuel.
it: Non ho una password configurata per il mio attuale nick.

source: You must set supybot.plugins.Services.NickServ before I'm able to do identify.
de: Du musst supybot.plugins.Services.NickServ setzen, damit es mich möglich ist mich zu identifizieren.
fi: Sinun täytyy asettaa supybot.plugins.Services.NickServ ennen kuin pystyn tunnistautumaan.
fr: Vous devez définir supybot.plugins.Services.NickServ avant que je ne puisse m'identifier
it: È necessario impostare la variabile supybot.plugins.Services.NickServ affinché possa identificarmi.

source: [<nick>] Ghosts the bot's given nick and takes it. If no nick is given, ghosts the bot's configured nick and takes it.
de: [<Nick>] 'Ghost' den Bot Nick und nimmt ihn sich. Falls kein Nick angegeben wirde, wird 'ghost' für den konfigurierten Nick gesendet.
fi: [<nimimerkki>] Ghostaa botin annetun nimimerkin ja ottaa sen. Jos nimimerkkiä ei ole annettu, ghostaa botin määritetyn nimimerkin ja ottaa sen.
fr: [<nick>] Ghost le nick donné du bot et le prend. Si aucun nick n'est donné, utilise celui configuré.
it: [<nick>] Termina una connessione "fantasma" (ghost) e riprende il nick del bot. Se non è specificato alcun nick, riprende quello configurato.

source: I cowardly refuse to ghost myself.
de: Ich verweigere es auf mich selbst 'ghost' anzuwenden.
fi: Minä pelkurimaisesti kieltäydyn ghostaamasta itseäni.
fr: Je suis trop couard pour me ghoster moi-même.
it: Codardamente mi rifiuto di terminare una connessione "fantasma" (ghost).

source: You must set supybot.plugins.Services.NickServ before I'm able to ghost a nick.
de: Du musst supybot.plugins.Services.NickServ setzen, erst dann ist es mir möglich 'ghost' auf einen Nick anzuwenden.
fi: Sinun täytyy asettaa supybot.plugins.Services.NickServ ennen kuin pystyn ghostaamaan nimimerkin.
fr: Vous devez définir supybot.plugins.Services.NickServ avant que je ne puisse ghoster un nick.
it: È necessario impostare la variabile supybot.plugins.Services.NickServ affinché possa riprendermi il nick (ghost).

source: <nick> [<password>] Sets the NickServ password for <nick> to <password>. If <password> is not given, removes <nick> from the configured nicks.
de: <Nick> [<Passwort>]\n Setzt das NickServ Passwort für <Nick> auf <Password>. Falls <Passwort> nicht angegeben wurde, wird der <Nick> aus der Liste der konfigurierten Nicks entfernt.
fi: <nimimerkki> [<salasana>] Asettaa NickServin salasanan <nimimerkille> <salasanaksi>. Jos <salasana> ei ole annettu, poistaa <nimimerkin> määritetyistä nimimerkeistä.
fr: <nick> [<mot de passe>] Défini le <mot de passe> NickServ pour le <nick>. Si le <mot de passe> n'est pas donné, supprime <nick> de la liste des nis, configurés.
it: <nick> [<password>] Imposta la password di NickServ per <nick>. Se <password> non è specificata, rimuove <nick> dai nick configurati.

source: That nick was not configured with a password.
de: Für diesen Nick wurde kein Passwort konfiguriert.
fi: Tuota nimimerkkiä ei ole määritetty salasanan kanssa.
fr: Ce nick n'est pas configuré avec un mot de passe.
it: Questo nick non è stato configurato con una password.

source: takes no arguments Returns the nicks that this plugin is configured to identify and ghost with.
de: hat keine Argumente Gibt die Nicks aus, für die dieses Plugin konfiguriert wurde um sich zu identifizieren und 'ghost' zu benutzen.
fi: ei ota parametrejä Palauttaa nimimerkin, jolla tämä lisäosa on määritetty tunnistautumaan ja ghostaamaan.
fr: ne prend pas d'argument Retourne les nicks pour lesquels ce plugin est configuré pour s'identifier et ghoster.
it: non necessita argomenti Restituisce i nick per i quali questo plugin è configurato per l'identificazione e il ghost.

source: I'm not currently configured for any nicks.
de: Ich habe zur Zeit keine Nicks konfiguriert.
fi: Minulle ei ole tällä hetkellä määritetty yhtään nimimerkkiä.
fr: Je ne suis actuellement configuré pour aucun nick.
it: Al momento non sono configurato per alcun nick.
