Repository: progval/Limnoria
Catalog: plugins/User/locales/*.po
Languages: fr

source: [--capability=<capability>] [<glob>] Returns the valid registered usernames matching <glob>. If <glob> is not given, returns all registered usernames.
fr: [--capacility=<capacité>] [<glob>] Retourne les utilisateurs enregistrés correspondant au <glob>. Si <glob> n'est pas donné, retourne tous les noms d'utilisateur.

source: This is a private capability. Only admins can see who has it.
fr: C'est une capacité privée. Seuls les admins peuvent voir qui la possède.

source: There are no matching registered users.
fr: Il n'y a pas d'utilisateur enregistré correspondant.

source: There are no registered users.
fr: Il n'y a pas d'utilisateur enregistré.

source: <name> <password> Registers <name> with the given password <password> and the current hostmask of the person registering. You shouldn't register twice; if you're not recognized as a user but you've already registered, use the hostmask add command to add another hostmask to your already-registered user, or use the identify command to identify just for a session. This command (and all other commands that include a password) must be sent to the bot privately, not in a channel.
fr: <nom> <mot de passe> Enregistre <nom> avec le mot de passe donné, et le masque d'hôte actuel de la personne s'inscrivant. Vous ne devez pas vous enregistrer deux fois ; si vous n'êtes pas reconnu(e) comme un utilisateur(trice) alors que vous êtes déjà enregistré(e), utilisez la commande 'hostmask add' pour ajouter un masque d'hôte à votre compte, ou utilisez la commande 'identify' pour vous identifier, juste le temps d'une session. Cette commande (et toutes les autres commandes qui nécessitent un mot de passe) doivent être envoyées en privé, et non sur un canal.

source: That name is already assigned to someone.
fr: Ce nom est déjà utilisé par quelqu'un.

source: username
fr: nom d'utilisateur

source: Hostmasks are not valid usernames.
fr: Les masques d'hôte ne sont pas des noms d'utilisateur valides.

source: Your hostmask is already registered to %s
fr: Votre masque d'hôte est déjà enregistré à %s

source: <name> [<password>] Unregisters <name> from the user database. If the user giving this command is an owner user, the password is not necessary.
fr: <nom> [<mot de passe>] Supprime <nom> de la base de données des utilisateurs. Si l'utilisateur appellant cette commande est le propriétaire, le mot de passe n'est pas requis.

source: This command has been disabled. You'll have to ask the owner of this bot to unregister your user.
fr: Cette commande a été désactivée. Vous devez contacter le propriétaire du bot pour vous désenregistrer.

source: <name> <new name> [<password>] Changes your current user database name to the new name given. <password> is only necessary if the user isn't recognized by hostmask. This message must be sent to the bot privately (not on a channel) since it may contain a password.
fr: <nom> <nouveau nom> [<mot de passe>] Change votre nom actuel dans la base de données des utilisateurs. <mot de passe> n'est requis que si vous n'êtes pas actuellement reconnu(e) par masque d'hôte. Si vous avez le paramètre <mot de passe> le message doit être envoyé en privé (et non sur un canal).

source: %q is already registered.
fr: %q est déjà enregistré.

source: [<name>] <old password> <new password> Sets the new password for the user specified by <name> to <new password>. Obviously this message must be sent to the bot privately (not in a channel). If the requesting user is an owner user (and the user whose password is being changed isn't that same owner user), then <old password> needn't be correct.
fr: <nom> <ancien mot de passe> <nouveau mot de passe> Définit le nouveau mot de passe pour l'utilisateur spécifié par <name>. Évidemment, ce message doit être envoyé au bot en privé (= pas sur un canal). Si l'utilisateur est le propriétaire (et si l'utilisateur dont on change le mot de passe n'est pas le même propriétaire), l'<ancien mot de passe> ne requiert pas d'être correct.

source: <password> [<True|False>] Sets the secure flag on the user of the person sending the message. Requires that the person's hostmask be in the list of hostmasks for that user in addition to the password being correct. When the secure flag is set, the user *must* identify before they can be recognized. If a specific True/False value is not given, it inverts the current value.
fr: <mot de passe> [<on|off>] Défini le flag 'secure' sur l'utilisateur envoyant le message. Requiert que la personne soit reconnue par masque d'hôte, en plus du fait que le mot de passe doit être correct. Lorsque le flag 'secure' est défini, l'utilisateur *doit* être identifié avant d'être reconnu. Si l'argument on/off n'est pas donné, l'état courant est inversé.

source: Secure flag set to %s
fr: Flag secure déjà défini à %s

source: <hostmask|nick> Returns the username of the user specified by <hostmask> or <nick> if the user is registered.
fr: <masque d'hôte|nick> Retourne le nom d'utilisateur de la personne spécifiée par <masque d'hôte> ou par <nick>, si cette personne est enregistrée.

source: I haven't seen %s.
fr: Je n'ai pas vu %s.

source: I don't know who that is.
fr: Je ne sais pas qui c'est.

source: [<nick>] Returns the hostmask of <nick>. If <nick> isn't given, return the hostmask of the person giving the command.
fr: [<nick>] Retourne le masque d'hôte de <nick>. Si <nick> n'est pas donné, retourne le masque d'hôte de la personne envoyant la commande.

source: [<name>] Returns the hostmasks of the user specified by <name>; if <name> isn't specified, returns the hostmasks of the user calling the command.
fr: [<nom>] Retourne les masques d'hôte de l'utilisateur spécifié par <nom> ; si <nom> n'est pas spécifié, retourne le masque d'hôte de la personne appelant la commande.

source: %s has no registered hostmasks.
fr: %s n'a pas de masque d'hôte enregistré.

source: You may only retrieve your own hostmasks.
fr: Vous ne pouvez récupérer que vos propres masques d'hôte.

source: [<name>] [<hostmask>] [<password>] Adds the hostmask <hostmask> to the user specified by <name>. The <password> may only be required if the user is not recognized by hostmask. <password> is also not required if an owner user is giving the command on behalf of some other user. If <hostmask> is not given, it defaults to your current hostmask. If <name> is not given, it defaults to your currently identified name. This message must be sent to the bot privately (not on a channel) since it may contain a password.
fr: [<nom>] [<masque d'hôte>] [<mot de passe>] Ajoute le <masque d'hôte> à l'utilisateur <nom>. Le <mot de passe> n'est requis que si l'utilisateur n'est pas reconnu par masque d'hôte. <mot de passe> peut également être omis si l'expéditeur est le propriétaire, et envoie la commande au nom de quelqu'un d'autre. Si le <masque d'hôte> n'est pas donné, ce sera le masque d'hôte de l'expéditeur. Si <nom> n'est pas donné, il s'agit par défaut de votre nom d'utilisateur. Ce message doit être envoyé au bot en privé (pas sur un canal) si il contient un mot de passe.

source: hostmask
fr: masque d'hôte

source: Make sure your hostmask includes a nick, then an exclamation point (!), then a user, then an at symbol (@), then a host. Feel free to use wildcards (* and ?, which work just like they do on the command line) in any of these parts.
fr: Assurez-vous que votre masque d'hôte inclue un nick, un point d'exclamation, une ident, un arobase, puis un hôte. Sentez-vous libre d'utiliser des jokers (* et ?, qui fonctionnent comme dans la ligne de commande), dans n'importe lequel de ces termes.

source: That hostmask is already registered.
fr: Ce masque d'hôte est déjà enregistré.

source: [<name>] [<hostmask>] [<password>] Removes the hostmask <hostmask> from the record of the user specified by <name>. If the hostmask given is 'all' then all hostmasks will be removed. The <password> may only be required if the user is not recognized by their hostmask. This message must be sent to the bot privately (not on a channel) since it may contain a password. If <hostmask> is not given, it defaults to your current hostmask. If <name> is not given, it defaults to your currently identified name. This message must be sent to the bot privately (not on a channel) since it may contain a password.
fr: [<nom>] [<masque d'hôte>] [<mot de passe>] Supprime le <masque d'hôte> de l'utilisateur <nom>. Si le masque d’hôte donné est « all », alors tous les masques d’hôte seront supprimés. Le <mot de passe> n'est requis que si l'utilisateur n'est pas reconnu par masque d'hôte. <mot de passe> peut également être omis si l'expéditeur est le propriétaire, et envoie la commande au nom de quelqu'un d'autre. Si le <masque d'hôte> n'est pas donné, ce sera le masque d'hôte de l'expéditeur. Si <nom> n'est pas donné, il s'agit par défaut de votre nom d'utilisateur. Ce message doit être envoyé au bot en privé (pas sur un canal) si il contient un mot de passe.

source: All hostmasks removed.
fr: Tous les masques d'hôte ont été supprimés.

source: There was no such hostmask.
fr: Il n'y avait pas ce masque d'hôte.

source: GPG features are not enabled.
fr: Les fonctionnalités liées à GPG ne sont pas activées.

source: <key id> <key server> Add a GPG key to your account.
fr: <id de clé> <serveur de clé> Ajoute une clé GPG à votre compte.

source: This key is already associated with your account.
fr: Cette clé est déjà associée à votre compte.

source: %n imported, %i unchanged, %i not imported.
fr: %n importée(s), %i inchangée(s), %i non importée(s)

source: key
fr: clé

source: You must give a valid key id
fr: Vous devez donner un identifiant de clé valide

source: You must give a valid key server
fr: Vous devez donner un serveur de clé valide

source: <fingerprint> Remove a GPG key from your account.
fr: <empreinte> Supprime une clé GPG de votre compte.

source: GPG key not associated with your account.
fr: La clé GPG n’est pas associée à votre compte.

source: takes no arguments Send you a token that you'll have to sign with your key.
fr: ne prend pas d’argument Vous donne un jeton que vous devez signer avec votre clé.

source: Your token is: %s. Please sign it with your GPG key, paste it somewhere, and call the 'auth' command with the URL to the (raw) file containing the signature.
fr: Votre jeton est : %s. Veuillez le signer avec votre clé GPG, le paster quelque part, et appeler la commande « auth » avec l’URL du fichier (brut) contenant la signature.

source: <url> Check the GPG signature at the <url> and authenticates you if the key used is associated to a user.
fr: <url> Vérifie que la signature GPG à l’<url> et vous authentifie si la clé est associée à un utilisateur.

source: Signature or token not found.
fr: Signature ou jeton non trouvé.

source: Unknown token. It may have expired before you submit it.
fr: Jeton inconnu. Il se peut qu’il ait expiré avant que vous ne l’ayez soumis.

source: Your hostname/nick changed in the process. Authentication aborted.
fr: Votre nom d’hôte/nick a changé durant le processus. Authentification annulée.

source: You are now authenticated as %s.
fr: Vous êtes maintenant identifié(e) en tant que %s.

source: Unknown GPG key.
fr: Clé GPG inconnue.

source: Signature could not be verified. Make sure this is a valid GPG signature and the URL is valid.
fr: La signature n’a pas pu être vérifiée. Assurez vous que c’est une signature GPG valide et que l’URL est valide.

source: [<name>] Returns the capabilities of the user specified by <name>; if <name> isn't specified, returns the capabilities of the user calling the command.
fr: [<nom>] Retourne la liste des capacités de l'utilisateur spécifié par <nom> ; si <nom> n'est pas spécifié, retourne les capacités de l'utilisateur appelant la commande.

source: <name> <password> Identifies the user as <name>. This command (and all other commands that include a password) must be sent to the bot privately, not in a channel.
fr: <nom> <mot de passe> Identifie l'utilisateur en tant que <nom>. Cette commande (et toutes cellent qui requierent un mot de passe) doivent être envoyées en privé au bot, et non sur un canal.

source: Your secure flag is true and your hostmask doesn't match any of your known hostmasks.
fr: Votre flag secure est True, et votre masque d'hôte ne correspond à aucune de vos masques d'hôte connus.

source: takes no arguments Un-identifies you. Note that this may not result in the desired effect of causing the bot not to recognize you anymore, since you may have added hostmasks to your user that can cause the bot to continue to recognize you.
fr: ne prend pas d'argument Vous dé-indentifie. Notez que cela ne marche pas forcément, par exemple si le bot vous reconnait grâce au masque d'hôte ; il continuera alors à vous reconnaître.

source: If you remain recognized after giving this command, you're being recognized by hostmask, rather than by password. You must remove whatever hostmask is causing you to be recognized in order not to be recognized.
fr: Si vous êtes encore reconnu(e) après avoir envoyé cette commande, c'est que vous êtes reconnu(e) par masque d'hôte et non par mot de passe. Vous devez supprimer tout masque d'hôte susceptible de vous reconnaitre, dans le but de ne pas être reconnu(e).

source: takes no arguments Returns the name of the user calling the command.
fr: ne prend pas d'argument Retourne le nom de l'utilisateur appellant la commande.

source: I don't recognize you.
fr: Je ne vous reconnais pas.

source: takes no arguments Returns some statistics on the user database.
fr: ne prend pas d'argument Retourne des statistiques sur la base de données.

source: I have %s registered users with %s registered hostmasks; %n and %n.
fr: J'ai %s utilisateurs enregistrés, avec %s masques d'hôte enregistrés ; %n et %n.
