Repository: progval/Limnoria
Catalog: plugins/Network/locales/*.po
Languages: de

source: [--ssl] <network> [<host[:port]>] [<password>] Connects to another network (which will be represented by the name provided in <network>) at <host:port>. If port is not provided, it defaults to 6667, the default port for IRC. If password is provided, it will be sent to the server in a PASS command. If --ssl is provided, an SSL connection will be attempted.
de: [--ssl] <Netzwerk> [<Host[:Port]>] [<Passwort>] Verbindet zu einem anderen Netzwerk, welches durch den Namen in <Netzwerk> auf <Host:Port> festgelegt wird. Falls Port nicht angegeben wird, wird standardgemäß 6667 verwendet, der Standardport für IRC. Falls Passwort angegeben wird, wird es an den Server per PASS Befehl gesendet. Falls --ssl angegeben wird, wird versucht eine SSL Verbindung aufzubauen.

source: I'm already connected to %s.
de: Ich bin schon verbunden mit %s.

source: A server must be provided if the network is not already registered.
de: Es muss ein Server angegeben werden, falls das netwerk noch net registriert ist.

source: Connection to %s initiated.
de: Verbindung zu %s wurde eingeleitet.

source: [<network>] [<quit message>] Disconnects from the network represented by the network <network>. If <quit message> is given, quits the network with the given quit message. <network> is only necessary if the network is different from the network the command is sent on.
de: [<netzwerk>] [<Beenden Nachricht>]

source: Disconnection to %s initiated.
de: Verbindungstrennung zu %s wurde eingeleitet.

source: [<network>] [<quit message>] Disconnects and then reconnects to <network>. If no network is given, disconnects and then reconnects to the network the command was given on. If no quit message is given, uses the configured one (supybot.plugins.Owner.quitMsg) or the nick of the person giving the command.
de: [<Netzwerk>] [<Beendennachricht>] Trennt die Verbindung von <Netzwerk> und baut diese neu auf, falls kein Netzwerk angegeben wird, wird die Verbindung des Netzwerks getrennt und wieder aufgebaut, auf dem der Befehl gegeben wurde. Falls keine Beendennachricht angegeben wird, wird die konfigurierte (supybot.plugins.Owner.quitMsg) oder der Nick des Nutzer, der den Befehl gegeben hat, benutzt.

source: <network> <command> [<arg> ...] Gives the bot <command> (with its associated <arg>s) on <network>.
de: <Netzwerk> <Befehl> [<Argument> ...] Gibt dem Bot den <Befehl> (mit den zugehörigen <Argument>en) auf dem <Netzwerk>.

source: is an op on %L
de: ist ein Operator in %L

source: is a halfop on %L
de: ist ein Halboperator in %L

source: is voiced on %L
de: hat Sprechrechte in %L

source: is also on %L
de: ist auch in %L

source: is on %L
de: ist in %l

source: isn't on any non-secret channels
de: ist nicht in irgendwelchen Kanälen die nicht als geheim eingestuft sind.

source: <unknown>
de: <unbekannt>

source: identified
de: identifiziert

source: %s (%s) has been%s on server %s since %s (idle for %s) and %s.%s
de: %s (%s) ist%s auf dem Server % seit %s (im Leerlauf für %s) und %s.%s

source: There is no %s on %s.
de: Kein %s auf %s.

source: [<network>] <nick> Returns the WHOIS response <network> gives for <nick>. <network> is only necessary if the network is different than the network the command is sent on.
de: [<Netzwerk>] <Nick> Gibt die WHOIS Antwort aus, die das <Netzwerk> für <Nick> gibt. <Netzwerk> wird nur benötigt wenn der Befehl nicht im Netzwerk gesendet wird auf dem der Befehl ausgeführt werden soll.

source: takes no arguments Returns the networks to which the bot is currently connected.
de: hat keine Argumente Gibt an zu welchen Netzwerken der Bot momentan verbunden ist.

source: %.2f seconds.
de: %.2f Sekunden.

source: [<network>] Returns the current latency to <network>. <network> is only necessary if the message isn't sent on the network to which this command is to apply.
de: [<Netzwerk>] Gibt die momenten Latenz zu <Netzwerk> an. <Netzwerk> wird nur benötigt wenn der Befehl nicht im Netzwerk gesendet wird auf dem der Befehl ausgeführt werden soll.

source: Latency check (from %s).
de: Latenzprüfung (von %s).

source: [<network>] Returns the current network driver for <network>. <network> is only necessary if the message isn't sent on the network to which this command is to apply.
de: [<Netzwerk>] Gibt den momentanen Netzwerktreiber für <Netzwerk> an. <Netzwerk> wird nur benötigt wenn der Befehl nicht im Netzwerk gesendet wird auf dem der Befehl ausgeführt werden soll.
