Repository: progval/Limnoria
Catalog: plugins/Plugin/locale/*.po
Languages: de

source: This plugin exists to help users manage their plugins. Use 'plugin list' to list the loaded plugins; use 'plugin help' to get the description of a plugin; use the 'plugin' command itself to determine what plugin a command exists in.
de: Dieses Plugin gibt es um Nutzern zu helfen ihre Plugins zu verwalten. Benutze 'plugin list' um alle geladenen Plugins aufzulisten; benutze 'plugin help' um eine Beschreibung des Plugins zu bekommen; benutze 'plugin' selbst um herauszufinden in welchem Plugin ein Befehl existiert.

source: <plugin> Returns a useful description of how to use <plugin>, if the plugin has one.
de: <plugin> Gibt eine nützliche Beschreibung aus wie man das <plugin> benutzt, falls das Plugin eine hat

source: That plugin is loaded, but has no plugin help.
de: Das Plugin ist geladen, hat aber keine Hilfe.

source: takes no arguments Returns a list of the currently loaded plugins.
de: hat keine Argumente Gibt eine liste aller geladenen Plugins aus.

source: <command> Returns the name of the plugin that would be used to call <command>. If it is not uniquely determined, returns list of all plugins that contain <command>.
de: <Befehl> Gibt den Namen des Plugins aus das benutzt wird um <Befehl> aufzurufen. Wenn dieser nicht einzigartig ist, wird eine Liste aller Plugins ausgegeben die über den <Befehl> verfügen.

source: The %q command is available in the %L %s.
de: Der %q Befehl ist im %L %s verfügbar.

source: There is no command %q.
de: Es gibt keinen Befehl %q.

source: <command> Returns the names of all plugins that contain <command>.
de: <Befehl> Gibt die Namen aller Plugins aus die <Befehl> beinhalten.

source: <plugin> Returns the author of <plugin>. This is the person you should talk to if you have ideas, suggestions, or other comments about a given plugin.
de: <Plugin> Gibt den Autor von <Plugin> aus. Das ist die Person mit der du kontakt aufnehmen sollte falls du Ideen, Vorschläge oder andere Kommentare für das Plugin hast.

source: That plugin does not seem to be loaded.
de: Das Plugin ist wohl nicht geladen.

source: That plugin doesn't have an author that claims it.
de: Kein Autor hat das Plugin beansprucht.

source: <plugin> [<nick>] Replies with a list of people who made contributions to a given plugin. If <nick> is specified, that person's specific contributions will be listed. Note: The <nick> is the part inside of the parentheses in the people listing.
de: <plugin> [<nick>] Antwortet mit einer Liste von Personen die zum angegeben Plugin beigetragen haben.Falls <Nick> angegeben wird, werden die personenspezifischen Beitröge gelistet. Notiz: Der <Nick> ist der eingeklammerte Bereich in der Personenliste.

source: Take an Authors object, and return only the name and nick values in the format 'First Last (nick)'.
de: Nimmt ein Autoren Objekt und gibt nur die Namens und Nick Werte im format 'Vorname Nachname (Nick)' aus.

source: Take a list of long names and turn it into : shortname[, shortname and shortname].
de: Nimmt eine Liste von langen Namen und macht daraus: Kurzname[, Kurzname und Kurzname].

source: Sort the list of 'long names' based on the number of contributions associated with each.
de: Sortiert die Liste von 'langen Namen' nach der Nummer der Beiträge, mit denen sie in Verbindung gebracht werden.

source: Build the list of author + contributors (if any) for the requested plugin.
de: Erstellt eine Liste der Autoren + Mitwirkenden (falls es welche gibt) des abgefragten Plugins.

source: The %s plugin
de: Das %s Plugin

source: has not been claimed by an author
de: wurde von keinem Autor beansprucht.

source: and
de: und

source: has no contributors listed.
de: hat keine Mitwirkenden gelistet.

source: was written by %s
de: wurde geschrieben von %s

source: %s %h contributed to it.
de: %s %h hat dazu beigesteuert.

source: has no additional contributors listed.
de: hat keine zusätzliche Mitwirkende.

source: but
de: aber

source: Build the list of contributions (if any) for the requested person for the requested plugin
de: Erstelle eine Liste von Beiträgen (falls es welche gibt) die von der erfragten Person für das erfragte Plugin gemacht wurden.

source: The nick specified (%s) is not a registered contributor.
de: Der gegebene Nick (%s) hat keinen registrierten Mitwirkenden.

source: The %s plugin does not have '%s' listed as a contributor.
de: Das Plugin %s hat keinen '%s' als Mitwirkenden aufgeführt.

source: command
de: Befehl

source: the %L %s
de: das %L %s

source: the %L
de: das %L

source: %s wrote the %s plugin and also contributed %L.
de: %s hat das Plugin %s geschrieben und auch %L beigesteuert.

source: %s contributed %L to the %s plugin.
de: %s hat %L zum %s Plugin beigesteuert.

source: %s wrote the %s plugin
de: %s hat das %s Plugin geschrieben

source: %s has no listed contributions for the %s plugin.
de: %s hat keine gelisteten Beiträge für das %s Plugin.
