Repository: progval/Limnoria
Catalog: plugins/Math/locales/*.po
Languages: it

source: <fromBase> [<toBase>] <number> Converts <number> from base <fromBase> to base <toBase>. If <toBase> is left out, it converts to decimal.
it: <daBase> [<aBase>] <numero> Converte un numero da una base a un'altra. Se <aBase> non è specificata, converte in decimale.

source: Invalid <number> for base %s: %s
it: Numero non valido per base %s: %s

source: Convert a decimal number to another base; returns a string.
it: Converte un numero decimale in un'altra base, restituisce una stringa.

source: Convert a number from any base, 2 through 36, to any other base, 2 through 36. Returns a string.
it: Converte un numero da qualsiasi base tra 2 e 36 ad un'altra tra 2 e 36, restituisce una stringa.

source: <math expression> Returns the value of the evaluated <math expression>. The syntax is Python syntax; the type of arithmetic is floating point. Floating point arithmetic is used in order to prevent a user from being able to crash to the bot with something like '10**10**10**10'. One consequence is that large values such as '10**24' might not be exact.
it: <espressione matematica> Restituisce il valore dell'<espressione matematica> valutata. La sintassi è quella di Python; il tipo di aritmetica è in virgola mobile. Quest'ultima è utilizzata per prevenire che un utente sia in grado di mandare in crash il bot con qualcosa di simile a "10**10**10**10". Una delle conseguenze però è che valori di grandi dimensioni come "10**24" potrebbero non essere precisi.

source: The answer exceeded %s or so.
it: La risposta ha superato %s.

source: %s is not a defined function.
it: %s non è una funzione definita.

source: <math expression> This is the same as the calc command except that it allows integer math, and can thus cause the bot to suck up CPU. Hence it requires the 'trusted' capability to use.
it: <espressione matematica> Questo comando è identico a "calc" eccetto che permette numeri interi e può causare l'uso massiccio di CPU da parte del bot. Per questo motivo richiede la capacità "trusted" per poterlo utilizzare.

source: <rpn math expression> Returns the value of an RPN expression.
it: <espressione matematica rpn> Restituisce il valore di un'espressione RPN (Reverse Polish Notation).

source: Not enough arguments for %s
it: Argomenti per %s insufficienti

source: %q is not a defined function.
it: %q non è una funzione definita.

source: [<number>] <unit> to <other unit> Converts from <unit> to <other unit>. If number isn't given, it defaults to 1. For unit information, see 'units' command.
it: [<numero>] <unità> ad <altra unità> Converte da <unità> ad <altra unità>. Se <numero> non è specificato, usa 1 come predefinito. Per informazioni sulle unità, utilizza il comando "units".

source: [<type>] With no arguments, returns a list of measurement types, which can be passed as arguments. When called with a type as an argument, returns the units of that type.
it: [<tipo>] Senza argomenti restituisce un elenco di tipi di misura che possono essere passati come argomento. Quando viene chiamato con un tipo come argomento, riporta le unità di quel tipo.
