Repository: progval/Limnoria
Catalog: plugins/ShrinkUrl/locales/*.po
Languages: fi, fr, it

source: This plugin offers a snarfer that will go retrieve a shorter version of long URLs that are sent to the channel. Would you like this snarfer to be enabled?
fi: Tämä lisäosa tarjoaa kaappaajan,joka palauttaa lyhyemmän version pitkistä URL-osoitteista, jotka lähetetään kanavalle. Haluaisitko tämän kaappaajan olevan käytössä?
fr: Ce plugin offre un snarfer qui récupère de longues URLs envoyées sur un canal pour en envoyer une version plus courte. Voulez-vous activer ce snarfer ?
it: Questo plugin offre un cattura URL che riporterà una versione accorciata di quelli lunghi inviati al canale. Lo si vuole abilitare?

source: Determines whether the snarfer will show the domain of the URL being snarfed along with the shrunken URL.
fi: Määrittää näyttääkö kaappaaja kaapatun URL-osoitteen domainin lyhennetyn URL-osoitteen kanssa.
fr: Détermine si le snarfer affichera le domaine de l'URL snarfée avec l'URL raccourcie.
it: Determina se l'accorcia URL mostrerà il dominio dell'URL originale assieme a quello accorciato.

source: The minimum length a URL must be before the bot will shrink it.
fi: Vähimmäispituus joka URL-osoitteen täytyy olla, ennen kuin botti kutistaa sen.
fr: La taille minimum d'une URL pour que le bot la raccourcice.
it: La lunghezza minima che un URL deve avere affinché il bot decida di accorciarlo.

source: Determines what URLs are to be snarfed; URLs matching the regexp given will not be snarfed. Give the empty string if you have no URLs that you'd like to exclude from being snarfed.
fi: Määrittää mitä URL-osoitteita ei kaapata; URL-osoitteet, jotka täsmäävät annettuun säännölliseen lausekkeeseen jätetään kaappaamatta. Anna tyhjä merkkiketju, jos et halua estää mitään URL-osoitetta tulemasta kaapatuksi.
fr: Détermine quelles URLs seront snarfées ; les URLs correspondant à l'expression régulière ne seront par snarfées. Donnez une chaîne vide si il n'y a pas d'URL que vous voulez exclure.
it: Determina quali URL debbano essere intercettati; quelli che corrispondono alla regexp fornita non verranno coinvolti. Se non si vuole escludere alcun URL, aggiungere una stringa vuota.

source: Determines whether the bot will shrink the URLs of outgoing messages if those URLs are longer than supybot.plugins.ShrinkUrl.minimumLength.
fi: Määrittää lyhentääkö botti ulosmenevien viestien URL-osoitteet, jos ne ovat pidempiä kuin supybot.plugins.ShrinkUrl.minimumLength.
fr: Détermine si le bot raccourcira les URLs des messages sortant si ces URLs sont plus longues que supybot.plugins.ShrinkUrl.minimumLength.
it: Determina se il bot accorcerà gli URL dei messaggi in uscita se questi sono più lunghi del valore di supybot.plugins.ShrinkUrl.minimumLength.

source: Determines what website the bot will use when shrinking a URL.
fi: Määrittää mitä verkkosivua botti käyttää lyhentäessään URL-osoitetta.
fr: Détermine quel site web le bot utilisera pour raccourcir une URL
it: Determina quale sito web il bot userà per accorciare un URL.

source: Determines whether this plugin will bold certain portions of its replies.
fi: Määrittää korostaako botti tietyt osat vastauksissaan.
fr: Détermine si ce plugin mettra en gras certaines portions de ses réponses.
it: Determina se il plugin riporterà in grassetto alcune porzioni delle risposte.

source: If set to a non-empty value, specifies the list of services to rotate through for the shrinkSnarfer and outFilter.
fi: Jos tämä on asetettu muuksi, kuin tyhjäksi arvoksi, määrittää listan palveluista, joita käytetään kutistuskaappaajalle ja ulostulon suodattimelle.
fr: Si définit à une valeur non vide, définit la liste des services à faire tourner pour shrinkSnarfer et outFilter.
it: Se impostato ad un valore non vuoto, specifica l'elenco dei servizi a cui rivolgersi per le variabili shrinkSnarfer e outFilter.

source: This plugin features commands to shorten URLs through different services, like tinyurl.
fi: Tämä plugin sisältää komennot URL-osoitteiden lyhentämiseen eri palveluilla, kuten esimerkiksi tinyurl:illa.

source: <url> Returns a TinyURL.com version of <url>
fi: <URL-osoite> Palauttaa TinyURL.com palvelun lyhentämän version <URL-osoitteesta>.
fr: <url> Retourne une version de TinyURL.com de l'<url>.
it: <url> Restituisce una versione di TinyURL.com di <url>

source: <url> Returns an ur1 version of <url>.
fi: <url> Palauttaa ur1-version <url:stä>.
fr: <url> Retourne une version de ur1 de l'<url>.

source: <url> Returns an x0.no version of <url>.
fi: <url> Palauttaa x0.no palvelun lyhentämän version <URL-osoitteesta>.
fr: <url> Retourne une version de x0.no de l'<url>.
it: <url> Restituisce una versione di x0.no di <url>.
