Repository: progval/Limnoria
Catalog: plugins/BadWords/locale/*.po
Languages: fi

source: Would you like to add some bad words?
fi: Haluaisitko lisätä joitakin pahoja sanoja?

source: What words? (separate individual words by spaces)
fi: Mitkä sanoja? (Eristä erilliset sanat käyttämällä välilyöntiä.

source: Determines what words are considered to be 'bad' so the bot won't say them.
fi: Määrittää mitkä sanat ovat 'pahoja', jottei botti sano niitä.

source: Determines whether the bot will require bad words to be independent words, or whether it will censor them within other words. For instance, if 'darn' is a bad word, then if this is true, 'darn' will be censored, but 'darnit' will not. You probably want this to be false. After changing this setting, the BadWords regexp needs to be regenerated by adding/removing a word to the list, or reloading the plugin.
fi: Määrittää vaatiiko botti pahojen sanojen olevan toisistaan riippumattomia sanoja, vai sensuroiko se ne toisten sanojen sisältä. Esimerkiksi,jos 'pah' on paha sana, ja jos tämä on asetettu true asentoon, 'pah' sensuroidaan, mutta 'pahus' ei sensuroida. Sinä luultavasti tahdot pitää tämän false asennossa. Tämän asetuksen muuttamisen jälkeen, BadWords regexp täytyy luoda uudelleen lisäämällä/poistamalla sana listalta, tai uudelleenlataamalla lisäosa.

source: Determines what characters will replace bad words; a chunk of these characters matching the size of the replaced bad word will be used to replace the bad words you've configured.
fi: Määrittä mitkä merkit korvaavat pahat sanat; osa näistä merkeistä, jotka sopivat pahasanan kokoon käytetään määrittämiesi pahojen sanojen korvaamisessa.

source: Determines the manner in which bad words will be replaced. 'nastyCharacters' (the default) will replace a bad word with the same number of 'nasty characters' (like those used in comic books; configurable by supybot.plugins.BadWords.nastyChars). 'simple' will replace a bad word with a simple strings (regardless of the length of the bad word); this string is configurable via supybot.plugins.BadWords.simpleReplacement.
fi: Määrittää millä tavalla pahat sanat korvataan. 'nastyCharacters' (oletus) korvaa pahan sanan samalla määrällä 'häijyjä merkkejä' (kuten ne jotka ovat sarjakuvissa; muokattavissa supybot.plugins.BadWords.nastyChars asetuksella). 'simple' korvaa pahan sanan yksinkertaisella merkkijonolla (riippumatta pahan sanan koosta); tämä merkkijono on muokattavissa asetuksella supybot.plugins.BadWords.simpleReplacement.

source: Determines what word will replace bad words if the replacement method is 'simple'.
fi: Määrittää mikä sana korvaa pahat sanat jos korvausmenetelmä on 'simple'.

source: Determines whether the bot will strip formatting characters from messages before it checks them for bad words. If this is False, it will be relatively trivial to circumvent this plugin's filtering. If it's True, however, it will interact poorly with other plugins that do coloring or bolding of text.
fi: Määrittää riisuuko botti muotoilun merkeistä ennen kuin se tarkistaa ne pahojen sanojen varalta. Jos tämä on 'False', on hyvin pinnallista kiertää tämän lisäosan suodatusta. Jos se kuitenkin on 'True', se on huonosti vuorovaikutuksessa tekstin värittämistä tai korostamista tekevien lisäosien kanssa.

source: Determines whether the bot will kick people with a warning when they use bad words.
fi: Määrittää potkiiko botti ihmiset varoituksella jos he käyttävät pahoja sanoja.

source: You have been kicked for using a word prohibited in the presence of this bot. Please use more appropriate language in the future.
fi: Sinut on potkittu kielletyn sanan käytöstä tämän botin läsnäollessa. Ole hyvä ja käytä asianmukaisempaa kieltä tulevaisuudessa.

source: Determines the kick message used by the bot when kicking users for saying bad words.
fi: Määrittää potkimisviestin, jota botti käyttää, kun potkii käyttäjiä pahojen sanojen käyttämistä.

source: Maintains a list of words that the bot is not allowed to say. Can also be used to kick people that say these words, if the bot has op.
fi: Säilyttää listaa sanoista, joita botin ei ole sallittua sanoa. Voidaan myös käyttää potkimaan ihmisiä, jotka sanovat näitä sanoja, jos botilla on kanavaoperaattori.

source: takes no arguments Returns the list of words being censored.
fi: ei ota parametrejä Palauttaa listan sanoista, joita sensuroidaan.

source: I'm not currently censoring any bad words.
fi: Tällä hetkellä ei sensuroida yhtään pahoja sanoja.

source: <word> [<word> ...] Adds all <word>s to the list of words being censored.
fi: <sana> [<sana> ...] Lisää kaikki <sana>(t) sensuroidaan.

source: <word> [<word> ...] Removes <word>s from the list of words being censored.
fi: <sana> [<sana> ...] Poistaa <sanat>(t) sensuroitujen sanojen listalta.
