Repository: progval/Limnoria
Catalog: plugins/MessageParser/locale/*.po
Languages: fi

source: Determines whether the message parser is enabled. If enabled, will trigger on regexps added to the regexp db.
fi: Määrittää onko viestikursija käytössä. Jos käytössä aktivoituu säännöllisissä lausekkeissa, jotka on lisätty säännöllinen lauseke tietokantaan.

source: Determines whether we keep updating the usage count for each regexp, for popularity ranking.
fi: Määrottää pidetäänkö käyttö count for each regexp, for popularity ranking.

source: Determines the number of regexps returned by the triggerrank command.
fi: Määrittää palautuneiden säännöllisten lausekkeiden, jotka palautuvat triggerrank komennolla, määrän.

source: Determines the capability required (if any) to vacuum the database.
fi: Määrittää valtuuden (jos mikään), joka on vaadittu tietokannan tyhjentämiseen.

source: Determines the capabilities required (if any) to manage the regexp database, including add, remove, lock, unlock. Use 'channel,capab' for channel-level capabilities. Note that absence of an explicit anticapability means user has capability.
fi: Määrittää valtuudet, jotka (jos mitkään) on vaadittu hallitsemaan säännöllinen lauseke tietokantaa, sisältäen lisää, poista, lukitse, avaa. Käytä 'kanava,valtuus':ksia kanava tason valtuuksille. Huomaa, että jopa antivaltuuden olemassaolo tarkoittaa, että käyttäjällä on valtuus.

source: Determines the separator used between rexeps when shown by the list command.
fi: Määrittää erottajan, jota käytetään list komennon näyttämien säännöllisten lausekkeiden välissä.

source: This plugin can set regexp triggers to activate the bot. Use 'add' command to add regexp trigger, 'remove' to remove.
fi: Tämä lisäosa voi asettaa säännöllisiä lausekeke liipaisimia, jotka aktivoivat botin. Käytä 'add' komentoa lisätäksesi säännöllisen lausekkeen ja 'remove' poistaaksesi säännöllisen lausekkeen.

source: Create the database and connect to it.
fi: Luo tietokanta ja yhdistä siihen.

source: Use this to get a database for a specific channel.
fi: Käytä tätä saadaksesi tietokannan tietylle kanavalle.

source: Run a command from message, as if command was sent over IRC.
fi: Suorittaa komennon viestistä, kuin jos komento olisi lähetetty IRC:een yli.

source: Check if the user has any of the required capabilities to manage the regexp database.
fi: Tarkista onko käyttäjällä vaadittu oikeus säännöllisen lauseke tietokannan muokkaamiseen.

source: [<channel>] <regexp> <action> Associates <regexp> with <action>. <channel> is only necessary if the message isn't sent on the channel itself. Action is echoed upon regexp match, with variables $1, $2, etc. being interpolated from the regexp match groups.
fi: [<kanava>] <säännöllinen lauseke> <toiminta> Liittää <säännöllisen lausekkeen> <toimintaan>. <Kanava> on vain vaadittu, jos viestiä ei lähetetä kanavalla itsellään Toimintoa kaiutetaan säännöllisillä lausekkeilla, muuttujilla $1, $2, esim. ollen interpoloitu säännöllisten lausekkeiden osumis ryhmistä.

source: Invalid python regexp: %s
fi: Viallinen Python säännöllinen lauseke: %s

source: That trigger is locked.
fi: Tuo liipaisin on lukittu.

source: [<channel>] [--id] <regexp>] Removes the trigger for <regexp> from the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. If option --id specified, will retrieve by regexp id, not content.
fi: [<kanava>] [--id] <säännöllinen lauseke>] Poistaa lipaisimen <säännölliselle lausekkeelle> liipaisin tietokannasta. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään jos viestiä ei lähetetä kanavalla itsellään. Jos asetus --id on annettu, hakee säännöllinen lauseke id:llä, ei sisällöllä.

source: There is no such regexp trigger.
fi: Tuollaista säännöllinen lauseke liipaisinta ei ole.

source: This regexp trigger is locked.
fi: Tämä säännöllinen lauseke liipaisin on lukittu.

source: [<channel>] <regexp> Locks the <regexp> so that it cannot be removed or overwritten to. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <säännöllinen lauseke> Lukitsee <säännöllisen lausekkeen>, jotta sitä ei voida poistaa tai ylikirjoittaa. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <regexp> Unlocks the entry associated with <regexp> so that it can be removed or overwritten. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <säännöllinen lauseke> Avaa merkinnän, joka on liitetty <säännölliseen lausekkeeseen> , jotta se voidaan poistaa tai ylikirjoittaa. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] [--id] <regexp> Looks up the value of <regexp> in the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. If option --id specified, will retrieve by regexp id, not content.
fi: [<kanava>] [--id] <säännöllinen lauseke> Etsii <säännöllisen lausekkeen> arvoa liipaisin tietokannassa. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään. Jos asetus --id on määritetty, haetaan säännöllisen lausekkeen id:n, ei sisällön perusteella

source: [<channel>] [--id] <regexp> Display information about <regexp> in the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. If option --id specified, will retrieve by regexp id, not content.
fi: [<kanava>] [--id] <säännöllinen lauseke> Näyttää tiedot <säännöllisestä lausekkeesta> liipaisin tietokannassa. <kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään. Jos asetus --id on annettu, hakee säännöllisen lausekkeen id:een, ei sisällön perusteella.

source: The regexp id is %d, regexp is "%s", and action is "%s". It was added by user %s on %s, has been triggered %d times, and is %s.
fi: Säännöllisen lausekkeen id on %d, säännöllinen lauseke on "%s", ja toiminto on "%s". Sen lisäsi %s %s:llä, on liipaistu %d kertaa, ja on %s.

source: locked
fi: lukittu

source: not locked
fi: ei lukittu

source: [<channel>] Lists regexps present in the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. Regexp ID listed in paretheses.
fi: [<kanava>] Luettelee säännölliset lausekkeet, jotka ovat liipaisin tietokannassa kanavalla. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään. Säännöllinen lauseke ID on luetteloitu suluissa.

source: There are no regexp triggers in the database.
fi: Säännöllinen lauseke tietokannassa ei ole liipaisimia.

source: [<channel>] Returns a list of top-ranked regexps, sorted by usage count (rank). The number of regexps returned is set by the rankListLength registry value. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa top säännölliset lausekkeet, jotka on lajiteltu käyttömäärän (rank). Palautuneiden säännöllisten lausekkeiden lukumäärän määrittää rankListLength rekisteriarvo. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] Vacuums the database for <channel>. See SQLite vacuum doc here: http://www.sqlite.org/lang_vacuum.html <channel> is only necessary if the message isn't sent in the channel itself. First check if user has the required capability specified in plugin config requireVacuumCapability.
fi: [<kanava>] Tyhjentää <kanavan> tietokannan. Katso SQLite tyhjennys documentaatio täältä: http://www.sqlite.org/lang_vacuum.html <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään. Tarkista ensin onko käyttäjällä vaadittu valtuus, joka on määritetty asetuksessa requireVacuumCapability.
