Repository: progval/Limnoria
Catalog: src/locales/*.po
Languages: fi

source: Determines whether the bot will periodically flush data and configuration files to disk. Generally, the only time you'll want to set this to False is when you want to modify those configuration files by hand and don't want the bot to flush its current version over your modifications. Do note that if you change this to False inside the bot, your changes won't be flushed. To make this change permanent, you must edit the registry yourself.
fi: Määrittää kirjoittaako botti säännöllisesti asetustiedostot levylle. Yleensä ainut tapaus, jossa tämä tahdotaan asettaa arvoon False on kun kyseisiä asetustiedostoja tahdotaan muokata käsin, eikä botin tahdota tallentavan nykyistä versiotaan omien muokkaustesi päälle. Huomaa, että mikäli vaihdat tämän arvoon False botin sisällä, muutoksiasi ei tallenneta. Tehdäksesi tämän muutoksen pysyväksi, rekisteriä täytyy muokata itse.

source: Determines whether the bot will allow nested commands, which rule. You definitely should keep this on.
fi: Määrittää salliiko botti sisäkkäisten komentojen käytön, jotka ovat parhaita. Tämä täytyy varmasti pitää käytössä.

source: Determines what the maximum number of nested commands will be; users will receive an error if they attempt commands more nested than this.
fi: Määrittää mikä on enimmäinen sallittu määrä sisäkkäisiä komentoja; käyttäjät vastaanottavat virheilmoituksen yrittäessään käyttää useampia sisäkkäisiä komentoja, kuin tämä arvo sallii.

source: Supybot allows nested commands. Enabling this option will allow nested commands with a syntax similar to UNIX pipes, for example: 'bot: foo | bar'.
fi: Supybot sallii sisäkkäiset komennot. Tämän asetuksen käyttöönottaminen sallii sisäkkäisten komentojen käyttämisen samanlaisella syntaksilla, kuin UNIX putket, esimerkiksi 'botti: foo | bar'.

source: Determines what commands have default plugins set, and which plugins are set to be the default for each of those commands.
fi: Määrittää millä komennoilla on oletuslisäosa määritettynä, ja mitkä lisäosat on määritetty olemann oletuksia kaikille noille komennoille.

source: Determines what plugins automatically get precedence over all other plugins when selecting a default plugin for a command. By default, this includes the standard loaded plugins. You probably shouldn't change this if you don't know what you're doing; if you do know what you're doing, then also know that this set is case-sensitive.
fi: Määrittää mitkä lisäosat saavat automaattisesti suosion yli käikkien muiden lisäosien, kun valitaan oletuslisäosaa komennolle. Oletuksena tämä sisältää kaikki perus lisäosat , jotka ovat käytössä. Tätä ei pitäisi muuttaa, ellei olla täysin varmoja mitä tehdään; jos tiedetään mitä ollaan tekemisessä, tiedetään myös, että tässä asetusarvossa kirjainkoolla on merkitystä.

source: Determines whether the bot will defend itself against command-flooding.
fi: Määrittää puolustaako botti itseään komento tulvimista vastaan.

source: Determines how many seconds the bot will ignore users who flood it with commands.
fi: Määrittää kuinka moneksi sekuntiksi botti jättää käyttäjät, jotka tulvivat sitä komennoilla, botti jättää huomioimatta.

source: Determines whether the bot will defend itself against invalid command-flooding.
fi: Määrittää puolustaako botti itseään viallisten komentojen tulvaa vastaan.

source: Determines how many seconds the bot will ignore users who flood it with invalid commands. Typically, this value is higher than supybot.abuse.flood.command.punishment, since it's far less likely (and far more annoying) for users to flood with invalid commands than for them to flood with valid commands.
fi: Määrittää, kuinka moneksi sekuntiksi botti jättää huomioitta käyttäjät, jotka tulvivat sitä virheellisillä komennoilla. Tyypillisesti tämä arvo on korkeampi, kuin supybot.abuse.flood.punishment, koska on paljon vähemmän todennäköistä (ja paljon ärsyttävämpää) käyttäjille tulvia virheellisillä komennoilla, kuin heille tulvia kelvollisilla komennoilla.

source: Determines whether the bot will notify people that they're being ignored for invalid command flooding.
fi: Määrittää huomauttaako bitti ihmisiä siitä, että heidän olemassa olostaan ei välitetä, jos heidän olemassa olostaan ei välitetä viallisten komentojen tulvan takia.

source: Determines the maximum time the bot will wait before attempting to reconnect to an IRC server. The bot may, of course, reconnect earlier if possible.
fi: Määrittää maksimi ajan, jonka botti odottaa, ennen kuin yrittää yhdistää uudelleen IRC palvelimeen. Botti voi tietysti yhdistää palvelimeen uudelleen aikaisemminkin, mikäli se on mahdollista.

source: Determines what directory configuration data is put into.
fi: Määrittää mihin hakemistoon asetustiedostot laitetaan.

source: Determines what directory data is put into.
fi: Määrittää mihin hakemistoon data laitetaan.

source: Determines what directory backup data is put into. Set it to /dev/null to disable backup (it is a special value, so it also works on Windows and systems without /dev/null).
fi: Määrittää mihin hakemistoon varmuuskopio tiedot laitetaan. Tämä asetetaan arvoon /dev/null, mikäli tahdotaan poistaa varmuuskopioiden ottaminen käytöstä (se on erityisarvo, joten se toimi myös Windowsilla ja käyttöjärjestelmillä, joilla ei ole hakemistoa /dev/null).

source: Determines what directory temporary files are put into.
fi: Määrittää mihin hakemistoon väliaikaistiedostot laitetaan.

source: Determines what directory files of the web server (templates, custom images, ...) are put into.
fi: Määrittää minne verkkopalvelimen hakemistotiedostot (pohjat, mukautetut kuvat jne.) laitetaan.

source: Determines what directories the bot will look for plugins in. Accepts a comma-separated list of strings. This means that to add another directory, you can nest the former value and add a new one. E.g. you can say: bot: 'config supybot.directories.plugins [config supybot.directories.plugins], newPluginDirectory'.
fi: Määrittää mistä hakemistoista botti etsii lisäosia. Hyväksyy pilkuilla eristetyn listan merkkiketjuista. Tämä tarkoittaa, että voit lisätä toisen hakemiston. Voit sisäistää aiemman arvon ja lisätä uuden. Esimerkiksi voit sanoa: botti: 'config supybot.directories.plugins [config supybot.directories.plugins], UusiLisäosaHakemisto.

source: Determines whether the bot will always load important plugins (Admin, Channel, Config, Misc, Owner, and User) regardless of what their configured state is. Generally, if these plugins are configured not to load, you didn't do it on purpose, and you still want them to load. Users who don't want to load these plugins are smart enough to change the value of this variable appropriately :)
fi: Määrittää lataako botti aina tärkeäy lisäosat (Admin, Channel, Config, Misc, Owner ja User) riippumatta, mikä niiden määritetty tila on. Yleensä, mikäli nämä lisäosat on määritetty olemaan latautumatta, sitä ei tahdottu tehdä tarkoituksella ja niiden tahdotaan silti latautuvan. Käyttäjät, jotka eivät tahdo ladata näitä lisäosia ovat tarpeeksi teräviä vaihtaakseen tätä asetusarvoa sopivasti :)

source: Determines what databases are available for use. If this value is not configured (that is, if its value is empty) then sane defaults will be provided.
fi: Määrittää mitkä tietokannat ovat käytettävissä. Mikäli tätä arvoa ei ole määritetty, (se tarkottaa, että sen arvo on tyhjä) niin järkevät oletukset tarjotaan.

source: Determines what filename will be used for the users database. This file will go into the directory specified by the supybot.directories.conf variable.
fi: Määrittää mitä nimeä käytetään tiedostolle, jota käytetään käyttäjätietokantana. Tämä tiedosto menee hakemistoon, jonka määrittää asetusarvo supybot.directories.conf.

source: Determines how long it takes identification to time out. If the value is less than or equal to zero, identification never times out.
fi: Määrittää kuinka pitkän ajan tunnistautuminen on voimassa. Mikäli tänä arvo on vähemmän tai yhtäsuuri kuin nolla, tunnistautuminen ei ikinä vanhene.

source: Determines whether the bot will allow users to unregister their users. This can wreak havoc with already-existing databases, so by default we don't allow it. Enable this at your own risk. (Do also note that this does not prevent the owner of the bot from using the unregister command.)
fi: Määrittää salliiko botti käyttäjien poistaa tunnuksensa botista. Tämä voi aiheuttaa kaaosta tietokannoilla, jotka ovat jo olemassa, joten oletuksena me emme salli sitä. Tämä asetusarvo otetaan käyttöön omalla vastuulla. (Huomaa, ettei tämä asetusarvo estä botin omistajaa käyttänästä "unregister" komentoa.)

source: Determines what filename will be used for the ignores database. This file will go into the directory specified by the supybot.directories.conf variable.
fi: Määrittää nimen tiedostolle, jota käytetään huomioitta jättämisen seurannan tietokantana. Tämä tiedosto laitetaan hakemistoon, jonka määrittää asetusarvo supybot.directories.conf.

source: Determines what filename will be used for the channels database. This file will go into the directory specified by the supybot.directories.conf variable.
fi: Määrittää nimen tiedostolle, jota käytetään kanavatietokantana. Tämä tiedosto laitetaan hakemistoon, joka määritetään asetusarvolla supybot.directories.conf.

source: Determines whether database-based plugins that can be channel-specific will be so. This can be overridden by individual channels. Do note that the bot needs to be restarted immediately after changing this variable or your db plugins may not work for your channel; also note that you may wish to set supybot.databases.plugins.channelSpecific.link appropriately if you wish to share a certain channel's databases globally.
fi: Määrittää ovatko tietokanta-pohjaiset lisäosat, jotka voivat olla kanavakohtaisia, kanavakohtaisia. Yksittäiset kanavat voivat ohittaa tämän. Huomaa, että botti täytyy käynnistää uudelleen välittömästi, kun tätä asetusarvoa on muutettu tai muuten tietokanta-pohjaiset lisäosat eivät välttämättä toimi kanavalla; huomaa myös, että supybot.databases-plugins.channelSpecific.link voidaan myös tahtoa asettaa sopivaksi, mikäli tietyn kanavan tietokannat, tahdotaan jakaa globaalisti.

source: Determines what channel global (non-channel-specific) databases will be considered a part of. This is helpful if you've been running channel-specific for awhile and want to turn the databases for your primary channel into global databases. If supybot.databases.plugins.channelSpecific.link.allow prevents linking, the current channel will be used. Do note that the bot needs to be restarted immediately after changing this variable or your db plugins may not work for your channel.
fi: Määrittää mihin kanavaan kuuluviksi globaalit (eivät kanavakohtaiset) tietokannat määritetään kuuluviksi. Tämä on avuliasta, mikäli kanavakohtaisia tietokantoja on käytetty pitkän aikaa ja ensisijaisen kanavan tietokannat tahdotaan muuttaa globaaleiksi tietokannoiksi. Jos supybot.databases.plugins.channelSpecific.link.allow estää linkittämisen, nykyistä kanavaa käytetään. Huomaa, että botti täytyy käynnistää uudelleen välittömästi tämän asetusarvon muuttamisen jälkeen tai tietokanta lisäosat eivät välttämättä toimi kanavalla.

source: Determines whether another channel's global (non-channel-specific) databases will be allowed to link to this channel's databases. Do note that the bot needs to be restarted immediately after changing this variable or your db plugins may not work for your channel.
fi: Määrittää onko toisen kanavan globaaleiden (ei kanavakohtaisten) tietokantojen sallittua linkittyä tämän kanavan tietokantoihin. Huomaa, että botti täytyy käynnistää uudelleen välittömästi tämän asetusarvon muuttamisen jälkeen tai tietokanta lisäosat eivät välttämättä toimi kanavalla.

source: Determines whether CDB databases will be allowed as a database implementation.
fi: Määrittää sallitaanko CDB tietokantojen käyttö tietokantaimplementaationa.

source: Determines how often CDB databases will have their modifications flushed to disk. When the number of modified records is greater than this fraction of the total number of records, the database will be entirely flushed to disk.
fi: Määrittää, kuinka usein DDB lisäosat tallentavat muutoksensa levylle. Kun muokattujen tallenteiden määrä on suurempi kuin tämä murto-osa tallenteiden yhteismäärästä, tietokanta tallennetaan levylle kokonaan.

source: Determines what will be used as the default banmask style.
fi: Määrittää mitä käytetään oletus porttikiellon anto tyylinä.

source: Determines what certificate file (if any) the bot will use connect with SSL sockets by default.
fi: Määrittää mitä SSL-varmennetta (jos mitään) botti käyttää oletuksena yhdistäessään SSL-solmuilla.

source: Determines what user modes the bot will request from the server when it first connects. Many people might choose +i; some networks allow +x, which indicates to the auth services on those networks that you should be given a fake host.
fi: Määrittää mitä käyttäjätiloja botti pyytää palvelimelta, kun se muodostaa yhteyden. Monet ihmiset saattavat valita tilan +i; jotkut verkot sallivat tilan +x, joka ilmaisee tuon verkon tunnistautumispalveluille, että käyttäjälle pitäisi antaa väärennetty isäntä.

source: Determines whether the bot will send PINGs to the server it's connected to in order to keep the connection alive and discover earlier when it breaks. Really, this option only exists for debugging purposes: you always should make it True unless you're testing some strange server issues.
fi: Määrittää lähettääkö botti PINGejä palvelimelle, johon se on muodostanut yhdeyden pitääkseen yhdeyden elossa ja saadakseen tietää aiemmin, jos se hajoaa. Oikeasti, tämä asetus on olemassa vain debuggaus tarkoituksia varten: tämä pitäisi aina olla "True", mikäli et kokeile omituisia palvelinongelmia.

source: Determines the number of seconds between sending pings to the server, if pings are being sent to the server.
fi: Määrittää määrän sekunteja palvelimelle lähetettävien pingien välissä, jos pingejä lähetetään palvelimelle.

source: Determines whether the bot will refuse duplicated messages to be queued for delivery to the server. This is a safety mechanism put in place to prevent plugins from sending the same message multiple times; most of the time it doesn't matter, unless you're doing certain kinds of plugin hacking.
fi: Määrittää kieltäytyykö botti pistämästä viestien kaksoiskappaleita jonoon palvelimelle toimitettaviksi. Tämä on turvallisuusmekanismi, joka on asetettu estämään lisäosia lähettämästä samaa viestiä palvelimelle monia kertoja; yleensä sillä ei ole merkitystä mikäli et ole tekemässä lisäosien hakkerointia.

source: Determines how many seconds must elapse between JOINs sent to the server.
fi: Määrittää, kuinka monta sekuntia täytyy kulua palvelimelle lähetettyjen JOINien välissä.

source: Determines how many bytes the bot will 'peek' at when looking through a URL for a doctype or title or something similar. It'll give up after it reads this many bytes, even if it hasn't found what it was looking for.
fi: Määrittää kuinka monta bittiä botti "kurkistaa" katsoessaan URL:än läpi etsien doctypeä tai otsikkoa tai jotakin sinnepäin. Se luovuttaa kun on lukenut tämän määrän bittejä, vaikka ei löytäisikään etsimäänsä.

source: Space-separated list of IPv4 hosts the HTTP server will bind.
fi: Välilyönneille eroiteltu lista IPv4-osoitteista, joita HTTP-palvelin kuuntelee.

source: Space-separated list of IPv6 hosts the HTTP server will bind.
fi: Välilyönneilla erotettu lista IPv6-osoitteista, joita HTTP-palvelin kuuntelee.

source: Determines what port the HTTP server will bind.
fi: Määrittää mihin porttiin HTTP palvelin sitoutuu.

source: Determines whether the server will stay alive if no plugin is using it. This also means that the server will start even if it is not used.
fi: Määrittää pysyykö palvelin elossa, vaikka yksikään lisäosa ei käytä sitä. Tämä tarkoittaa, että palvelin käynnistyy myös, mikäli sitä ei käytetä.

source: Determines whether the bot will ignore unidentified users by default. Of course, that'll make it particularly hard for those users to register or identify with the bot without adding their hostmasks, but that's your problem to solve.
fi: Määrittää jättääkö botti tunnistautumattomat käyttäjät huomiotta. Tietysti se tekee heidän rekisteröitymisestään tai tunnistautumisestaan botin kanssa vaikeaksi, ellei heillä ole lisättyjä hostmaskeja, mutta se on sinun ongelmasi.

source: Determines what the default timeout for socket objects will be. This means that *all* sockets will timeout when this many seconds has gone by (unless otherwise modified by the author of the code that uses the sockets).
fi: Määrittää mikä on oletus aikakatkaisuaika solmuobjekteille. Se takoittaa, että *kaikki* solmut tekevät aikakatkaisun, kun nämä sekuntit olevat kuluneet (paitsi jos solmuja käyttävän koodin kirjoittaja on erikseen muokannut tätä).

source: Determines what file the bot should write its PID (Process ID) to, so you can kill it more easily. If it's left unset (as is the default) then no PID file will be written. A restart is required for changes to this variable to take effect.
fi: Määrittää mihin tiedostoon botin pitäisi kirjoittaa PIDinsä (Prosessi ID:n), jotta voit tappaa sen helpommin. Jos jätetty tyhjäksi (kuten se on oletuksena) niin silloin PID tiedostoa ei kirjoiteta. Uudelleen käynnistys on vaadittu tämän asetusarvon muutosten vaikutuksen aikaansaamiseksi.

source: Determines whether the bot will automatically thread all commands.
fi: Määrittää ketjuttaako botti kaikki komennot.

source: Determines whether the bot will automatically flush all flushers *very* often. Useful for debugging when you don't know what's breaking or when, but think that it might be logged.
fi: Määrittää kuinka usein botti tallentaa automaattisesti kaikki puskurit *erittäin* usein. Hyödyllinen bugien korjaamiseen, kun et tiedä mikä hajoaa ja milloin, mutta uskot, että se saattaa tallentua lokiin.

source: Supybot Web server index
fi: Supybot verkkopalvelin indeksi.

source: Here is a list of the plugins that have a Web interface:
fi: Tässä on lista lisäosista, joilla on verkko käyttöliittymä:

source: This is a default response of the Supybot HTTP server. If you see this message, it probably means you are developing a plugin, and you have neither overriden this message or defined an handler for this query.
fi: Tämä on Supybotin HTTP-palvelimen oletusvastaus. Jos näet tämän viestin, se luultavasti tarkoittaa, että lisäosaa kehitetään, eikä tätä viestiä ole ohitettu eikä tälle pyynnölle ole määritetty käsittelijää.

source: I am a pretty clever IRC bot, but I suck at serving Web pages, particulary if I don't know what to serve. What I'm saying is you just triggered a 404 Not Found, and I am not trained to help you in such a case.
fi: Olen aika älykäs IRC botti, mutta olen huono verkkosivujen tarjoamisessa, erityisesti, jos en tiedä mitä minun pitäisi tarjota. Mitä minä olen kertomassa on vain, että laukaisit 404 sivua ei löydy virheen, ja minua ei ole koulutettu auttamaan sinua sellaisessa tapauksessa.

source: Request not handled.
fi: Pyyntöä ei hyväksytty.

source: No plugins available.
fi: Ei lisäosia saatavilla.

source: Request not handled
fi: Pyyntöä ei käsitelty.

source: Sorry, that response was not an option.
fi: Anteeksi, mutta tuo vastaus ei ollut vaihtoehto.

source: Sorry, you must enter a value.
fi: Anteeksi, mutta sinun täytyy antaa arvo.

source: Enter password:
fi: Anna salasana:

source: Re-enter password:
fi: Anna salasana uudelleen:

source: Passwords don't match.
fi: Salasanat eivät täsmää.

source: Value must be either True or False (or On or Off), not %r.
fi: Arvon täytyy olla "True" tai "False (tai "On" tai "Off"), ei %r.

source: Value must be an integer, not %r.
fi: Arvon täytyy olla kokonaisluku, eikä %r.

source: Value must be a non-negative integer, not %r.
fi: Arvon täytyy olla positiivinen kokonaisluku, ei %r.

source: Value must be positive (non-zero) integer, not %r.
fi: Arvon täytyy olla positiivinen (muu kuin nolla) kokonaisluku eikä %r.

source: Value must be a floating-point number, not %r.
fi: Arvon täytyy olla likuluku, ei %r.

source: Value must be a floating-point number greater than zero, not %r.
fi: Arvon täytyy olla nollaa suurempi liukuluku, ei %r.

source: Valid values include %L.
fi: Kelvolliset arvot ovat %L.

source: Valid values include %L, not %%r.
fi: Kelvolliset arvot ovat %L, eikä %%r.

source: Value must be a valid regular expression, not %r.
fi: Arvon täytyy olla kelvollinen säännöllinen lauseke, eikä %r.

source: year
fi: vuosi

source: week
fi: viikko

source: day
fi: päivä

source: hour
fi: tunti

source: minute
fi: minuutti

source: second
fi: sekunti

source: and
fi: ja
