Repository: progval/Limnoria
Catalog: src/locales/*.po
Languages: fi

source: Error:
fi: Virhe:

source: Error: I tried to send you an empty message.
fi: Virhe: Yritin lähettää sinulle tyhjän viestin.

source: Missing "%s". You may want to quote your arguments with double quotes in order to prevent extra brackets from being evaluated as nested commands.
fi: Puttuva "%s". Voit tahtoa laittaa parametrisi kaksiin lainausmerkkeihin estääksesi ylimääräisiä hakasulkuja tulemasta tulkituiksi sisäkkäisiksi komennoiksi.

source: "|" with nothing preceding. I obviously can't do a pipe with nothing before the |.
fi: "|" ennen mitään. En ilmiselvästi voi putkittaa tyhjyyttä ilman mitään ennen |-merkkiä.

source: Spurious "%s". You may want to quote your arguments with double quotes in order to prevent extra brackets from being evaluated as nested commands.
fi: Pettävää "%s". Voit tahtoa laittaa parametrisi kaksiin lainausmerkkeihin estääksesiylimääräisiä hakasulkuja tulemasta tulkituiksi sisäkkäisiksi komennoiksi.

source: "|" with nothing following. I obviously can't do a pipe with nothing after the |.
fi: "|" ilman mitään sen perässä. En ilmeisesti voi putkittaa tyhjyyttä |:n jälkeen.

source: %s is not a valid %s.
fi: %s ei ole kelvollinen %s.

source: That's not a valid %s.
fi: Tuo ei ole kelvollinen %s.

source: (XX more messages)
fi: (XX viestiä jatkoa)

source: more message
fi: viesti jatkoa

source: more messages
fi: viestejä jatkoa

source: You've attempted more nesting than is currently allowed on this bot.
fi: Yritit enempiä sisäkkäisiä komentoja, kuin on tällä hetkellä sallittu tässä botissa.

source: The command %q is available in the %L plugins. Please specify the plugin whose command you wish to call by using its name as a command before %q.
fi: Komento %q on saatavilla %L lisäosissa. Ole hyvä ja määritä minkä lisäosan komentoa tahdot kutsua laittamalla sen nimi komentoon ennen %q:ta.

source: Determines what commands are currently disabled. Such commands will not appear in command lists, etc. They will appear not even to exist.
fi: Määrittää mitkä komennon ovat tällä hetkellä pois käytöstä. Sellaiset komennot eivät ilmesty komento listoissa, jne. Ne eivät näytä edes olevan olemassa.

source: Invalid arguments for %s.
fi: Virheelliset parametrit kohteelle %s.

source: The %q command has no help.
fi: Komennolla %q ei ole ohjetta.

source: integer
fi: kokonaisluku

source: non-integer value
fi: ei-kokonaisluku arvo

source: floating point number
fi: liukuluku numero

source: positive integer
fi: positiivinen kokonaisluku

source: non-negative integer
fi: ei-negatiivinen kokonaisluku

source: index
fi: indeksi

source: number of seconds
fi: määrä sekunteja

source: do that
fi: tee se

source: I'm not even in %s.
fi: En edes ole kanavalla %s.

source: I need to be voiced to %s.
fi: Minulla täytyy olla ääni tehdäkseni %s.

source: I need to be halfopped to %s.
fi: Minulla täytyy olla puolikanavaoperaattorin valtuudet voidakseni tehdä %s.

source: I need to be at least halfopped to %s.
fi: Minulla täytyy olla vähintään puolioperaattorin oikeudet voidakseni tehdä %s

source: I need to be opped to %s.
fi: Minun täytyy olla opattuna, jotta voin %s.

source: channel
fi: kanava

source: nick or hostmask
fi: nimimerkki tai hostmask

source: regular expression
fi: säännöllinen lauseke

source: nick
fi: nimimerkki

source: That nick is too long for this server.
fi: Tuo nimimerkki on liian pitkä tälle palvelimelle.

source: I haven't seen %s.
fi: En ole nähnyt käyttäjää %s.

source: I'm not in %s.
fi: En ole kanavalla %s.

source: This command may only be given in a channel that I am in.
fi: Tämä komento voidaan antaa vain kanavalla, jolla minä olen.

source: You must be in %s.
fi: Sinun täytyy olla kanavalla %s.

source: %s is not in %s.
fi: %s ei ole kanavalla %s.

source: You must not give the empty string as an argument.
fi: Et voi antaa tyhjää merkkiketjua parametriksi.

source: This message must be sent in a channel.
fi: Tämä viesti täytyy lähettää kanavalla.

source: email
fi: sähköposti

source: http url
fi: http URL-osoite

source: command name
fi: komennon nimi

source: letter
fi: kirjain

source: plugin
fi: lisä-osa

source: irc color
fi: irc väri

source: Determines whether this plugin is loaded by default.
fi: Määrittää ladataanko tämä lisäosa oletuksena.

source: Determines whether this plugin is publicly visible.
fi: Määrittää onko tämä lisäosa julkisesti näkyvillä.

source: Determines the bot's default nick.
fi: Määrittää botin oletus nimimerkin.

source: Determines what alternative nicks will be used if the primary nick (supybot.nick) isn't available. A %s in this nick is replaced by the value of supybot.nick when used. If no alternates are given, or if all are used, the supybot.nick will be perturbed appropriately until an unused nick is found.
fi: Määrittää mitä vaihtoehtoisia nimimerkkejä käytetään, jos ensisijainen nimimerkki (supybot.nick) ei ole saatavilla. %s tässä nimimerkissä korvataa asetusarvolla supybot.nick, kun sitä käytetään. Jos vaihtoehtoja ei anneta, tai jos kaikki ovat käytössä, supybot.nick tehdään levottomaksi, kunnes käyttämätön nimimerkki löydetään.

source: Determines the bot's ident string, if the server doesn't provide one by default.
fi: Määrittää botin ident merkkiketjun, mikäli käyttäjä ei tarjoa yhtä oletuksena.

source: Determines the real name which the bot sends to the server. A standard real name using the current version of the bot will be generated if this is left empty.
fi: Määrittää minkä oikean nimen botti lähettää palvelimelle. Perus user-merkkiketju luodaan botin nykyisestä versiosta, mikäli tämä on jätetty tyhjäksi.

source: Determines what networks the bot will connect to.
fi: Määrittää mihin verkkoihin botti muodostaa yhdeyden.

source: Determines what password will be used on %s. Yes, we know that technically passwords are server-specific and not network-specific, but this is the best we can do right now.
fi: Määrittää mitä salasanaa käytetään verkossa %s. Kyllä, me tiedämme, että tietyille palvelimille, eivätkä tietyille verkoille, mutta tämä on paras johon pystymme juuri nyt.

source: Space-separated list of servers the bot will connect to for %s. Each will be tried in order, wrapping back to the first when the cycle is completed.
fi: Välilyönneillä erotettu lista palvelimista, joihin botti muodostaa yhteyden muodostaakseen yhteyden verkkoon %s. Jokaista palvelinta yritetään, palaten takaisin ensimmäiseen, kun kaikkia on yritetty.

source: Space-separated list of channels the bot will join only on %s.
fi: Välilyönneille eroteltu lista kanavista, joille botti liittyy vain verkossa %s.

source: Determines whether the bot will attempt to connect with SSL sockets to %s.
fi: Määrittää yrittääkö botti yhdistää SSL solmuilla verkkoon %s.

source: Determines what certificate file (if any) the bot will use to connect with SSL sockets to %s.
fi: Määrittää mitä SSL-varmennetta (jos mitään) botti käyttää yhdistäessään verkkoon %s käyttäen SSL-solmuja.

source: Determines what key (if any) will be used to join the channel.
fi: Määrittää mitä salasanaa (jos mitään) käytetään kanavalle liittymisessä.

source: Determines what nick the bot will use on this network. If empty, defaults to supybot.nick.
fi: Määrittää mitä nimimerkkiä botti käyttää tässä verkossa. Jos tämä on tyhjä, niin se on oletuksena supybot.nick

source: Determines the bot's ident string, if the server doesn't provide one by default. If empty, defaults to supybot.ident.
fi: Määrittää botin identin, ellei palvelin määritä sitä valmiiksi. Ollessaan tyhjä, tämä on oletuksena supybot.ident.

source: Determines the real name which the bot sends to the server. If empty, defaults to supybot.user
fi: Määrittää oikean nimen, jonka botti lähettää palvelimelle. Ollessaan tyhjä tämä on supybot.user:in asetusarvo.

source: Determines what SASL password will be used on %s.
fi: Määrittää mitä SASL salasanaa käytetään verkossa %s.

source: Determines how urls should be formatted.
fi: Määrittää kuinka URL:t muotoillaan.

source: Determines how timestamps printed for human reading should be formatted. Refer to the Python documentation for the time module to see valid formatting characters for time formats.
fi: Määrittää, kuinka aikaleimat, jotka on tarkoitettu ihmisten luettaviksi pitäisi muotoilla. Katso Pythonin dokumentaatiota aika moduulille nähdäksesi kelvolliset muotoilumerkit ajan muodoille.

source: Determines whether elapsed times will be given as "1 day, 2 hours, 3 minutes, and 15 seconds" or as "1d 2h 3m 15s".
fi: Määrittää näytetäänkö kulunut aika muodossa "1 päivä, 2 tuntia, 3 minuuttia, ja 15 sekuntia" vai "1d 2h 3m 15s".

source: Determines the absolute maximum length of the bot's reply -- no reply will be passed through the bot with a length greater than this.
fi: Määrittää botin vastauksen lopullisen enimmäis pituuden -- yksikään vastaus, joka on suurempi, kuin tämä ei mene botin läpi.

source: Determines whether the bot will break up long messages into chunks and allow users to use the 'more' command to get the remaining chunks.
fi: Määrittää hajottaako botti pitkät viestit paloihin ja sallii käyttäjien käyttää 'more' komentoa saadakseen jäljelläolevat palat.

source: Determines what the maximum number of chunks (for use with the 'more' command) will be.
fi: Määrittää maksimimäärän paloja (käytettäväksi 'more' komennon) kanssa.

source: Determines how long individual chunks will be. If set to 0, uses our super-tweaked, get-the-most-out-of-an-individual-message default.
fi: Määrittää, kuinka pitkiä yksittäiset palat tulevat olemaan. Jos tämä on asetettu arvoon 0, tämä käyttää meidän super-muokattua-saa-suurin-osa-ulos-yksittäisestä-viestistä oletusta.

source: Determines how many mores will be sent instantly (i.e., without the use of the more command, immediately when they are formed). Defaults to 1, which means that a more command will be required for all but the first chunk.
fi: Määrittää, kuinka monta "more"a lähetetään heti (esim., ilman "more" command käyttöä, heti, kun ne ovat muodostettuja. On oletuksena 1, joka tarkoittaa, että "more" komentoa vaaditaan kaikille muille, paitsi ensinmäiselle palalle.

source: Determines whether the bot will send multi-message replies in a single message. This defaults to True in order to prevent the bot from flooding. If this is set to False the bot will send multi-message replies on multiple lines.
fi: Määrittää lähettääkö botti monen viestin vastaukset yhdessä viestissä. Tämä on oletuksena "True", ettei botti floodaa. Jos tämä asetetaan arvoon "False", botti lähettää monen viestin vastaukset usealla rivillä.

source: Determines whether the bot will reply with an error message when it is addressed but not given a valid command. If this value is False, the bot will remain silent, as long as no other plugins override the normal behavior.
fi: Määrittää vastaako botti virheilmoituksella, kun sille puhutaan, mutta annetaan viallinen komento. Jos tämä arvo on False, botti pysyy hiljaisena, mikäli muita lisäosia, jotka ohittavat tämän käytöksen ei ole.

source: Determines whether error messages that result from bugs in the bot will show a detailed error message (the uncaught exception) or a generic error message.
fi: Määrittää näyttävätkö virheilmoitukset bugeista botissa tarkan virheilmoituksen (selittämätön poikkeus ) vai tavallisen virheilmoituksen.

source: Determines whether the bot will send error messages to users in private. You might want to do this in order to keep channel traffic to minimum. This can be used in combination with supybot.reply.error.withNotice.
fi: Määrittää lähettääkö botti virheilmoitukset käyttäjille yksityisesti. Voit haluta tehdä tämän, pitääksesi kanavan ruuhkan mahdollisimman alhaisena. Tämä voidaan yhdistää asetusarvon supybot.reply.error.withNotice kanssa.

source: Determines whether the bot will reply privately when replying in a channel, rather than replying to the whole channel.
fi: Määrittää vastaako botti yksityisesti, kun vastaa kanavalla mielummin, kuin vastaa koko kanavalle.

source: Determines whether the bot will reply with a notice when replying in a channel, rather than replying with a privmsg as normal.
fi: Määrittää vastaako botti huomautuksella, kun se vastaa kanavalla mielummin kuin PRIVMSG:llä, jolla se vastaa tavallisesti.

source: Determines whether the bot should attempt to reply to all messages even if they don't address it (either via its nick or a prefix character). If you set this to True, you almost certainly want to set supybot.reply.whenNotCommand to False.
fi: Määrittää pitäisikö botin yrittää vastata kaikkiin viesteihin, vaikka ne eivät olisi tarkoitettuja sille (joko nimimerkillä tai sen etuliitemerkillä. Jos tämä asetetaan arvoon True, supybot.reply.whenNotCommand tahdotaan asettaa Falseksi.

source: Determines whether the bot will allow you to send channel-related commands outside of that channel. Sometimes people find it confusing if a channel-related command (like Filter.outfilter) changes the behavior of the channel but was sent outside the channel itself.
fi: Määrittää salliiko botti kanavaan liittyvien komentojen lähettämisen kyseisen kanavan ulkopuolella. Joskus ihmisten mielestä on hämmentävää, mikäli kanavaan liittyvä komento (kuten Filter.outfilter), muuttaa botin käyttäytymistä kanavalla, mutta komento lähetettiin kanavan itsensä ulkopuolella.

source: Determines whether the bot will unidentify someone when that person changes their nick. Setting this to True will cause the bot to track such changes. It defaults to False for a little greater security.
fi: Määrittää kirjaako botti ulos käyttäjän, mikäli tuo käyttäjä vaihtaa nimimerkkiään. Tämän asettaminen arvoon True asettaa botin seuraamaan sellaisia mmuutoksia. Se on oletuksena False hiukan paremman turvallisuuden vuoksi.

source: Determines whether the bot will always join a channel when it's invited. If this value is False, the bot will only join a channel if the user inviting it has the 'admin' capability (or if it's explicitly told to join the channel using the Admin.join command).
fi: Määrittää liittyykö botti kanavalle aina kutsuttaessa. Jos tämä on False, botti liittyy kanavalle vain, mikäli kutsuvalla käyttäjällä on 'admin' valtuus (tai sen on käsketty liittyä kanavalle käyttäen komentoa Admin.join).

source: Supybot normally replies with the full help whenever a user misuses a command. If this value is set to True, the bot will only reply with the syntax of the command (the first line of the help) rather than the full help.
fi: Supybot vastaa tavallisesti täydellä ohjeteksillä, kun käyttäjä väärinkäyttää komentoa. Mikäli tämä on asetettu arvoon "True", botti vastaa vain komennon syntaksilla (ensinmäinen rivi ohjetekstiä) ennemmin, kuin täydellä ohjetekstillä.

source: Determines what prefix characters the bot will reply to. A prefix character is a single character that the bot will use to determine what messages are addressed to it; when there are no prefix characters set, it just uses its nick. Each character in this string is interpreted individually; you can have multiple prefix chars simultaneously, and if any one of them is used as a prefix the bot will assume it is being addressed.
fi: Määrittää mihin etuliitemerkkeihin botti vastaa. Etuliitemerkki on yksi merkki, jota botti käyttää määrittääkseen ovatko viestit osoitettuja sille; kun etuliitemerkkiä ei ole asetettu, se käyttää vain nimimerkkiään. Jokainen merkki tässä merkkiketjussa tulkitaan erikseen; etuliitemerkkijä voidaan käyttää monia samanaikaisesti, ja jos yhtäkään niistä käyetään etuliitemerkkinä, botti olettaa, että viesti on osoitettu sille.

source: Determines what strings the bot will reply to when they are at the beginning of the message. Whereas prefix.chars can only be one character (although there can be many of them), this variable is a space-separated list of strings, so you can set something like '@@ ??' and the bot will reply when a message is prefixed by either @@ or ??.
fi: Määrittää mihin merkkiketjuihin botti vastaa, kun ne ovat rivin alussa. Kun prefix.chars voi olla vain yhden merkin pituinen (vaikka niitä voikin olla monia), tämä asetusarvo on välilyönneillä eroiteltu lista, joten voit asettaa sen joksikin, kuten '@@ ??' ja botti vastaa, kun viestissä on etuliiteenä joko @@ tai ??.

source: Determines whether the bot will reply when people address it by its nick, rather than with a prefix character.
fi: Määrittää vastaako botti, kun ihmiset osoittavat sitä nimimerkillä, mielummin kuin aloitusmerkillä.

source: Determines whether the bot will reply when people address it by its nick at the end of the message, rather than at the beginning.
fi: Määrittää vastaako botti, kun ihmiset osoittavat viestinsä sille, kun sen nimimerkki on lopussa, eikä alussa.

source: Determines what extra nicks the bot will always respond to when addressed by, even if its current nick is something else.
fi: Määrittää mille nimimerkeille osoitetuille viesteille botti vastaa aina, jopa jos sen nykyinen nimimerkki on jokin muu.

source: The operation succeeded.
fi: Tehtävä suoritettu onnistuneesti.

source: Determines what message the bot replies with when a command succeeded. If this configuration variable is empty, no success message will be sent.
fi: Määrittää millä viestillä botti vastaa, kun komento on onnistunut. Jos tämä asetusarvo on tyhjä, onnistumisviestejä ei lähetetä.

source: An error has occurred and has been logged. Please contact this bot's administrator for more information.
fi: Virhe on tapahtunut ja tallennettu lokiin. Ole hyvä ja ota yhteyttä tämän botin ylläpitäjään saadaksesi lisätietoja.

source: Determines what error message the bot gives when it wants to be ambiguous.
fi: Määrittää minkä virheilmoituksen botti antaa tahtoessaan olla epäselvä.

source: An error has occurred and has been logged. Check the logs for more information.
fi: Virhe on tapahtunut ja tallennettu lokiin. Lisätietoja saadaan lokeista.

source: Determines what error message the bot gives to the owner when it wants to be ambiguous.
fi: Määrittää millaisen virheilmoituksen botti antaa omistajalle ollessaan epäselvä.

source: Your hostmask doesn't match or your password is wrong.
fi: Hostmask ei täsmää tai salasana on väärä.

source: Determines what message the bot replies with when someone tries to use a command that requires being identified or having a password and neither credential is correct.
fi: Määrittää millä viestillä botti vastaa, kun joku yrittää antaa komennon, joka vaatii tunnistautumista, ja kumpikaan vaatimus ei ole täytetty.

source: I can't find %s in my user database. If you didn't give a user name, then I might not know what your user is, and you'll need to identify before this command might work.
fi: En voi löytää käyttäjää %s käyttäjätietokannastani. Mikäli käyttäjänimeä ei annettu, en ehkä tiedä kuka etsimäsi käyttäjä on, ja sinun täytyy tunnistautua ennen kuin tämä komento saattaa toimia.

source: Determines what error message the bot replies with when someone tries to accessing some information on a user the bot doesn't know about.
fi: Määrittää millä virheilmoituksella botti vastaa, kun joku yrittää päästä tietoihin käyttäjästä, jota ei ole olemassakaan.

source: You must be registered to use this command. If you are already registered, you must either identify (using the identify command) or add a hostmask matching your current hostmask (using the "hostmask add" command).
fi: Tätä komentoa käyttääkseen on oltava rekisteröitynt. Mikäli olet jo rekisteröitynyt, tunnistaudu (käyttämällä identify komentoa) tai lisää hostmask, joka täsmää nykyiseen hostmaskiisi (käyttämällä "hostmask add" komentoa).

source: Determines what error message the bot replies with when someone tries to do something that requires them to be registered but they're not currently recognized.
fi: Määrittää millä virheilmoituksella botti vastaa, kun joku yrittää käyttää komentoa, joka vaatii hänen olevan rekisteröitynyt, mutta häntä ei ole tällä hetkellä tunnistettu.

source: Determines what error message is given when the bot is telling someone they aren't cool enough to use the command they tried to use.
fi: Määrittää mikä virheilmoitus annetaan, kun botti kertoo jollekin, ettei hän ole riittävän kuuli käyttääkseen komentoa, jota hän yritti käyttää.

source: You're missing some capability you need. This could be because you actually possess the anti-capability for the capability that's required of you, or because the channel provides that anti-capability by default, or because the global capabilities include that anti-capability. Or, it could be because the channel or supybot.capabilities.default is set to False, meaning that no commands are allowed unless explicitly in your capabilities. Either way, you can't do what you want to do.
fi: Jokin valtuus, jota tarvitaan puuttuu. Tämä voi johtua siitä, että vaaditulla valtuudella on antivaltuus, tai koska kanava tarjoaa antivaltuuden oletuksena. Tai se voi johtua siitä, että kanava tai supybot.capabilities.default on asetettu arvoon False, tarkoittaen ettei komentoja sallita, ellei niitä ole erikseen sallittu. Miten vain, et voi tehdä sitä, mitä tahdot tehdä.

source: Determines what generic error message is given when the bot is telling someone that they aren't cool enough to use the command they tried to use, and the author of the code calling errorNoCapability didn't provide an explicit capability for whatever reason.
fi: Määrittää mikä geneerinen virheilmoitus annetaan, kun botti kertoo jollekin, ettei hän ole tarpeeksi kuuli käyttääkseen komentoa, jota yritti käyttää ja koodin, joka kutsuu errorNoCapability koodin ei tarjonnut tarkkaa valtuutta ihansama mistä syystä.

source: That operation cannot be done in a channel.
fi: Tätä tehtävää ei voida suorittaa kanavalla.

source: Determines what error messages the bot sends to people who try to do things in a channel that really should be done in private.
fi: Määrittää virheilmoituksen, jonka botti lähettää ihmisille, ketkä yrittävät tehdä asioita, jotka todella pitäisi tehdä yksityisesti, kanavalla.

source: This may be a bug. If you think it is, please file a bug report at <https://github.com/progval/Limnoria/issues>.
fi: Tämä voi olla bugi. Mikäli uskotaan niin, raportoidaan bugi osoitteessa <https://github.com/progval/Limnoria/issues>. Bugiraportit kirjoitetaan englanniksi.

source: Determines what message the bot sends when it thinks you've encountered a bug that the developers don't know about.
fi: Määrittää minkä viestin botti lähettää uskoessaan, että on kohdattu bugi, josta kehittäjät eivät ole tietoisia.

source: A floating point number of seconds to throttle snarfed URLs, in order to prevent loops between two bots snarfing the same URLs and having the snarfed URL in the output of the snarf message.
fi: Liukuluku numero sekunteja, joilla jarrutetaan kaapattuja URL ositteita, jotta estetään toistot kahden botin välillä, jotka sisältävät saman URL-osoitteen ulostulevassa kaappausviestissä.

source: Determines the number of seconds between running the upkeep function that flushes (commits) open databases, collects garbage, and records some useful statistics at the debugging level.
fi: Määrittää sekuntimäärän, joka on ylläpito toiminnon, joka tallentaa avoimet tietokannat , kerää jätteet ja tallentaa hyödyllisiä tilastotietoja debuggaus tasolle, välissä.
