Repository: progval/Limnoria
Catalog: plugins/Owner/locale/*.po
Languages: it

source: <text> Logs <text> to the global Supybot log at critical priority. Useful for marking logfiles for later searching.
it: <testo> Registra <testo> nel log globale di Supybot con priorità critica. Utile per contrassegnare i file di log per ricerche successive.

source: <text> Sends <text> to all channels the bot is currently on and not lobotomized in.
it: <testo> Invia <testo> a tutti i canali in cui il bot è attualmente presente e non è lobotomizzato.

source: [--remove] <command> [<plugin>] Sets the default plugin for <command> to <plugin>. If --remove is given, removes the current default plugin for <command>. If no plugin is given, returns the current default plugin set for <command>. See also, supybot.commands.defaultPlugins.importantPlugins.
it: [--remove] <comando> [<plugin>] Imposta il plugin predefinito per <comando>. Se --remove è specificato, rimuove l'attuale plugin per <comando>. Se non viene fornito alcun plugin, riporta quello impostato per <comando>. Vedi anche supybot.commands.defaultPlugins.importantPlugins.

source: <string to be sent to the server> Sends the raw string given to the server.
it: <stringa da inviare al server> Invia la data stringa direttamente al server.

source: [<text>] Exits the bot with the QUIT message <text>. If <text> is not given, the default quit message (supybot.plugins.Owner.quitMsg) will be used. If there is no default quitMsg set, your nick will be used.
it: [<testo>] Fa uscire il bot con un certo messaggio di QUIT. Se <testo> non è specificato verrà utilizzato quello configurato in supybot.plugins.Owner.quitMsg, altrimenti il tuo nick.

source: takes no arguments Runs all the periodic flushers in world.flushers. This includes flushing all logs and all configuration changes to disk.
it: non necessita argomenti Esegue tutti i periodici "flusher" in world.flushers. Ciò include il salvataggio su disco di tutti i log e tutte le modifiche di configurazione.

source: [<level>] Runs the standard upkeep stuff (flushes and gc.collects()). If given a level, runs that level of upkeep (currently, the only supported level is "high", which causes the bot to flush a lot of caches as well as do normal upkeep stuff).
it: [<livello>] Esegue tutte le operazioni standard di mantenimento (flush e gc.collects()). Se si specifica un livello, esegue quel livello di mantenimento (al momento l'unico gestito è "high", che svuota la cache molto più del normale).

source: [--deprecated] <plugin> Loads the plugin <plugin> from any of the directories in conf.supybot.directories.plugins; usually this includes the main installed directory and 'plugins' in the current directory. --deprecated is necessary if you wish to load deprecated plugins.
it: [--deprecated] <plugin> Carica <plugin> da qualsiasi directory indicata dalla variabile conf.supybot.directories.plugins; solitamente questa include quella principale dell'installazione e "plugins" nella directory attuale. --deprecated è necessario per caricare plugin deprecati.

source: <plugin> Unloads and subsequently reloads the plugin by name; use the 'list' command to see a list of the currently loaded plugins.
it: <plugin> Ricarica <plugin>; utilizzare il comando "list" per ottenere l'elenco di quelli attualmente caricati.

source: <plugin> Unloads the callback by name; use the 'list' command to see a list of the currently loaded plugins. Obviously, the Owner plugin can't be unloaded.
it: <plugin> De-carica <plugin>; utilizzare il comando "list" per ottenere l'elenco di quelli attualmente caricati. . Il plugin Owner non può essere de-caricato.

source: {add|remove} <capability> Adds or removes (according to the first argument) <capability> from the default capabilities given to users (the configuration variable supybot.capabilities stores these).
it: {add|remove} <capacità> Aggiunge o rimuove (in base al primo argomento) <capacità> da quelle predefinite date agli utenti (salvate nella variabile di configurazione supybot.capabilities).

source: [<plugin>] <command> Disables the command <command> for all users (including the owners). If <plugin> is given, only disables the <command> from <plugin>. If you want to disable a command for most users but not for yourself, set a default capability of -plugin.command or -command (if you want to disable the command in all plugins).
it: [<plugin>] <comando> Disabilita <comando> per tutti gli utenti (compreso il proprietario). Se <plugin> è specificato, viene disabilitato solo <comando> da <plugin>. Se si vuole disabilitare un comando per tutti gli utenti tranne se stessi, impostare una capacità predefinita -plugin.command o -command (questa disabilita il comando in tutti i plugin).

source: [<plugin>] <command> Enables the command <command> for all users. If <plugin> if given, only enables the <command> from <plugin>. This command is the inverse of disable.
it: [<plugin>] <comando> Abilita <comando> per tutti gli utenti. Se <plugin> è specificato, viene disabilitato solo <comando> da <plugin>. È il contrario di "disable".

source: <plugin> <command> <new name> Renames <command> in <plugin> to the <new name>.
it: <plugin> <comando> <nuovo nome> Rinomina <comando> in <plugin> con <nuovo nome>.

source: <plugin> Removes all renames in <plugin>. The plugin will be reloaded after this command is run.
it: <plugin> Rimuove tutte le rinominazioni in <plugin>. Dopo questo comando il plugin verrà ricaricato.

source: takes no argument Reloads the locale of the bot.
it: non necessita argomenti Ricarica la localizzazione del bot.
