Repository: progval/Limnoria
Catalog: plugins/Anonymous/locales/*.po
Languages: de, fi, fr, hu

source: Determines whether the bot should require people trying to use this plugin to be in the channel they wish to anonymously send to.
de: Legt fest ob Leute im Kanal sein müssen, an den anonym senden wollen.
fi: Määrittää vaatiiko botti ihmisten, jotka yrittävät käyttää tätä lisäosaa, olemaan kanavalla, jonne he tahtovat lähettää viestin tuntemattomasti.
fr: Détermine si le bot requiérera que les gens soient sur le canal pour y envoyer des messages anonymement.
hu: Meghatározza, hogy a bot megkövetelje-e, hogy a bővítményt használni kívánó emberek abban a csatornában legyenek, ahová névtelenül szeretnének küldeni.

source: Determines whether the bot should require people trying to use this plugin to be registered.
de: Legt fest ob Nutzer registiert sein müssen um dieses Plugin zu benutze.
fi: Määrittää vaatiiko botti ihmisiä, jotka yrittävät käyttää tätä lisäosaa, olemaan rekisteröityneitä.
fr: Détermine si le bot requiérera que les personnes utilisant ce plugin soient enregistrées.
hu: Meghatározza, hogy a bot megkövetelje-e, hogy a bővítményt használni kívánó emberek regisztrálva legyenek.

source: Determines what capability (if any) the bot should require people trying to use this plugin to have.
de: Legt fest welche Fähgikeiten (falls überhaupt) der Bot verlangt von Personen die versuchen dieses Plugin zu benutzen.
fi: Määrittää minkä valtuuden (jos minkään) botti vaatii ihmisiltä, jotka yrittävät käyttää tätä lisäosaa.
fr: Détermine quelle capacité (s'il y en a une) le bot requiéra que les gens utilisant ce plugin aient.
hu: Meghatározza, hogy milyen képesség (ha van ilyen) legyen szükséges a bővítmény használatához.

source: Determines whether the bot will require targets of the "say" command to be public (i.e., channels). If this is True, the bot will allow people to use the "say" command to send private messages to other users.
de: Legt fest ob der Bot verlangt, dass Ziele des Befehls "say" öffentlich sind (z.B. Kanäle). Falls das auf True gesetzt ist, wird ber Bot Nutzern erlauben den Befehl "say" zu nutzen um anderen Nutzern private Nachrichten zu senden.
fr: Détermine si le bot requiérera que les cibles de la commande "say" soient publiques (c'est à dire des canaux). Si c'est True, le bot autorisera les personnes à utiliser la commande "say" pour envoyer des messages à d'autres utilisateurs en privé.
hu: Meghatározza, hogy a bot megkövetelje-e, hogy a "say" parancs célja publikus legyen (pl., csatornák). Ha ez True, a bot megengedi az embereknek, hogy a "say" paranccsal privát üzenetet küldjenek másoknak.

source: This plugin allows users to act through the bot anonymously. The 'do' command has the bot perform an anonymous action in a given channel, and the 'say' command allows other people to speak through the bot. Since this can be fairly well abused, you might want to set supybot.plugins.Anonymous.requireCapability so only users with that capability can use this plugin. For extra security, you can require that the user be *in* the channel they are trying to address anonymously with supybot.plugins.Anonymous.requirePresenceInChannel, or you can require that the user be registered by setting supybot.plugins.Anonymous.requireRegistration.
de: Das Plugin erlaubt Nutzern durch den Bot anonym zu bleiben. Der 'do' Befehl lässt den Bot eine anonyme Aktion in einem Kanal ausführen und der 'say' Befehl lässt Nutzer durch den Bot sprechen. Da das Ganze natürlich leicht missbraucht werden kann, willst du vielleicht supybot.plugins.Anonymous.requireCapability setzen, sodass nur Nutzer mit dieser Fähigkeit das Plugin benutzen können. Für etwas mehr Sicherheit kannst du mit supybot.plugins.Anonymous.requirePresenceInChannel verlangen, dass der Nutzer in dem Kanal sein muss in dem er anonym senden will oder du kannst verlangen, dass der Nutzer registriert sein muss indem du supybot.plugins.Anonymous.requireRegistration setzt.
fi: Tämä lisäosa sallii käyttäjien toimia botin kautta tuntemattomasti. Komento 'do' sallii botin tehdä tuntemattoman toiminnon annetulla kanavalla ja komento 'say' sallii toisten ihmisten puhua botin läpi. Koska tätä voidaan väärinkäyttää helposti voit tahtoa asettaa asetuksen supybot.plugins.Anonymous.requireCapability niin, että vain käyttäjät tuolla valtuudella voivat käyttää tätä lisäosaa. Lisäturvallisuuden vuoksi voit vaatia, että käyttäjien täytyy *olla* kanavilla joita he yrittävät puhutella tuntemattomasti asetuksella supybot.plugins.Anonymous.requirePresenceInChannel, tai sinä voit vaatia, että tuo käyttäjä on rekisteröitynyt asetuksella supybot.plugins.Anonymous.requireRegistration
hu: Ez a bővítmény megengedi a felhasználóknak, hogy névtelenül cselekedjenek a boton keresztül. A 'do' parancs hatására a bot végrehajt egy névtelen tevékenységet egy megadott csatornában, és a 'say' parancs megengedi másoknak, hogy a boton keresztül beszéljenek. Mivel ezzel elég könnyen vissza lehet élni, érdemes beállítani a supybot.plugins.Anonymous.requireCapability-t, hogy csak az adott képességgel rendelkező felhasználók használhassák ezt a bővítményt. Extra biztonságért a supybot.plugins.Anonymous.requirePresenceInChannel-lel megkövetelheted, hogy a felhasználó abban a csatornában legyen, amelyet névtelenül szeretnének megcímezni, vagy a supybot.plugins.Anonymous.requireRegistration-nel megkövetelheted, hogy a felhasználó regisztálva legyen.

source: You must be in %s to %q in there.
de: Du musst in %s sein um %q dort auszuführen.
fi: Sinun täytyy olla kanavalla %s %q sinne.
fr: Vous devez être sur %s pour y utiliser %q.
hu: %s-ban kell lenned, hogy a %q parancsot használd ott.

source: I'm lobotomized in %s.
de: Ich bin hirnamputiert in %s.
fi: Minut on lobotomoitu kanavalla %s.
fr: Je suis lobotomisé sur %s.
hu: Némítva vagyok %s-ban.

source: That channel has set its capabilities so as to disallow the use of this plugin.
de: Für den Kanal sind die Fähigkeiten so gesetzt, dass sie das benutzen dieses Plugins nicht erlauben.
fi: Tuo kanava on asettanut valtuudet kieltämään tämän Pluginin käytön.
fr: Ce canal a définit ses capacités de façon à désactiver l'utilisation de ce plugin.
hu: A megadott csatornában nem használhatod a bővítményt a csatorna képességei miatt.

source: %q cannot be used to send private messages.
de: %q kann nicht verwendet werden um private Nachrichten zu versenden.
fr: %q ne peut pas être utilisé pour envoyer des messages privés.
hu: A %q parancs nem használható privát üzenetek küldésére.

source: <channel|nick> <text> Sends <text> to <channel|nick>. Can only send to <nick> if supybot.plugins.Anonymous.allowPrivateTarget is True.
de: <Kanal|Nick> <text> Sendet <Text> an <Kanal|Nick>. Kann nur an <Nick> senden wenn supybot.plugins.Anonymous.allowPrivateTarget auf True gesetzt ist.
fr: <canal|nick> <text> Envoie le <texte> au <canal|nick>. Vous ne pouvez envoyer à <nick> que si supybot.plugins.Anonymous.allowPrivateTarget vaut True.
hu: <csatorna|név> <szöveg> Elküldi <szöveg>-et <csatorna|név>-nek. Csak akkor küldhet <név>-nek, ha a supybot.plugins.Anonymous.allowPrivateTarget True.

source: <channel> <action> Performs <action> in <channel>.
de: <Kanal> <Aktion> Führt die <Aktion> im <Kanal> aus.
fi: <kanava> <toiminto> Suorittaa <toiminnon> <kanavalla>.
fr: <canal> <action> Effectue l'<action> sur le <canal>.
hu: <csatorna> <tevékenység> Végrehajtja <tevékenység>-et <csatorna>-ban.

source: This command is disabled (supybot.plugins.Anonymous.allowPrivateTarget is False).
fi: Tämä komento on poistettu käytöstä (supybot.plugins.Anonymous.allowPrivateTarget on False).

source: <channel> <text> Sends <text> to <channel>.
fi: <kanava> <teksti> Lähettää <tesktin> <kanavalle>.

source: <nick> <text> Sends <text> to <nick>. Can only be used if supybot.plugins.Anonymous.allowPrivateTarget is True.
fi: <kanava> <teksti> Lähettää <tekstin> <nimimerkille>. <Nimimerkille> voidaan lähettää viestejä vain asetusarvon supybot.plugins.Anonymous.allowPrivateTarget ollessa True.
