Repository: progval/Limnoria
Catalog: plugins/Herald/locales/*.po
Languages: fi, fr, it

source: Determines whether messages will be sent to the channel when a recognized user joins; basically enables or disables the plugin.
fi: Määrittää lähetetäänkö viestejä kanavalle, kun tunnistettu käyttäjä liittyy; perusteellisesti ottaa tai poistaa käytöstä tämän lisäosan.
fr: Détermine si les messages seront envoyés sur le canal lorsqu'un utilisateur reconnu arrive ; active ou désactive basiquement le plugin.
it: Determina se i messaggi verranno inviati nel canale in cui entra un utente riconosciuto; in pratica abilita o disabilita il plugin.

source: Determines what capability (if any) is required to add/change/remove the herald of another user.
fi: Määrittää mikä valtuus (jos mikään) on vaadittu toisen käyttäjän airueen lisäämisessä/muuttamisessa/poistamisessa.
fr: Détermine quelle capacité (s'il en est une) est requise pour ajouter/changer/supprimer le message d'annonce d'un autre utilisateur.
it: Determina quale capacità (eventuale) è richiesta per aggiungere, modificare e rimuovere l'annuncio di un altro utente.

source: Determines the minimum number of seconds between heralds.
fi: Määrittää minimi määrän sekunteja airueiden välillä.
fr: Détermine le nombre minimum de secondes entre deux annonces.
it: Determina il numero minimo di secondi tra un annuncio e l'altro.

source: Determines the minimum number of seconds after parting that the bot will not herald the person when they rejoin.
fi: Määrittää minimi määrän sekunteja, jolloin henkilön poistumisen jälkeen botti ei toimi airueena, kun hän palaa.
fr: Détermine le nombre minimum de secondes après qu'un utilisateur soit parti pour que le bot puisse l'annoncer à nouveau quand il revient.
it: Determina il numero minimo di secondi dall'uscita di un utente in cui il bot non invierà l'annuncio al suo rientro.

source: Determines the minimum number of seconds after a netsplit that the bot will not herald the users that split.
fi: Määritt'' minimi määrän sekunteja netsplitin jälkeen jolloin botti ei toimi airueena käyttäjille, jotka splittaantuivat.
fr: Détermine le nombre minimum de secondes après un netsplit durant lequel le bot n'annoncera pas les utilisateurs qui ont splitté.
it: Determina il numero minimo di secondi dopo un netsplit in cui il bot non invierà l'annuncio agli utenti coinvolti.

source: Sets the default herald to use. If a user has a personal herald specified, that will be used instead. If set to the empty string, the default herald will be disabled.
fi: Asettaa oletusairueen käytettäväksi. Jos käyttäjällä on oma henkilökohtainen airue määritettynä, sitä käytetään sen sijaan. Jos asetettu tyhjäksi merkkiketjuksi, oletus airue poistetaan käytöstä.
fr: Définit le message d'annonce par défaut à utiliser. Si un utilisateur a un message d'annonce personnel spécifié, il peut être utilisé à la place. Si définit à une chaîne vide, le message d'annonce sera désactivé.
it: Imposta l'annuncio predefinito da utilizzare. Se un utente ha un annuncio personalizzato, verrà usato quello. Se impostato ad una stringa vuota, il predefinito sarà disabilitato.

source: Determines whether the default herald will be sent as a NOTICE instead of a PRIVMSG.
fi: Määrittää lähetetäänkö oletus airue NOTICEna PRIVMSG:gen sijaan.
fr: Détermine si le message d'annonce sera envoyé en NOTICE plutôt qu'en PRIVMSG.
it: Determina se l'annuncio predefinito verrà inviato tramite NOTICE anziché PRIVMSG.

source: Determines whether the default herald will be sent publicly.
fi: Määrittää lähetetäänkö oletus airut julkisesti.
fr: Détermine si le message d'annonce sera envoyé publiquement.
it: Determina se l'annuncio predefinito verrà inviato pubblicamente.

source: This plugin allows you to set welcome messages (heralds) to people who are recognized by the bot when they join a channel.
fi: Tämä plugini sallii tervetuloviestien (airueiden) asettamisen käyttäjille, jotka botti tunnistaa heidän liittyessään kanavalle.

source: I do not have a default herald set for %s.
fi: Minulla ei ole oletus airuetta asetettuna %s:lle.
fr: Je n'ai pas de message d'annonce par défaut pour %s.
it: Non ho un annuncio predefinito per %s.

source: [<channel>] [<user|nick>] Returns the current herald message for <user> (or the user <nick|hostmask> is currently identified or recognized as). If <user> is not given, defaults to the user giving the command. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [<käyttäjä|nimimerkki>] Palauttaa nykyisen airue viestin <käyttäjlle> (tai käyttäjälle <nimimerkissä|hostmaskissa> on tunnistetty). Jos <käyttäjää> ei ole annettu, se on oletuksenena komennon antanut henkilö. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <utilisateur|nick>] Retourne le message d'annonce courant pour l'<utilisateur> (ou l'utilisateur désigné par le <nick>). Si l'<utilisateur> n'est pas donné, cela vaut par défaut l'utilisateur donnant la commande. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] [<utente|nick>] Restituisce l'attuale annuncio per <utente> (o <nick|hostmask> con cui è identificato al momento). Se <utente> non è specificato, passa a quello che ha dato il comando. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I have no herald for %s.
fi: Minulla ei ole airuetta %s:lle.
fr: Je n'ai pas de message d'annonce pour %s.
it: Non ho annunci per %s.

source: [<channel>] <user|nick> <msg> Sets the herald message for <user> (or the user <nick|hostmask> is currently identified or recognized as) to <msg>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <käyttäjä|nimimerkki> <viesti> Asettaa <käyttäjän> airueen (tai käyttäjän, johon <nimimerkki|hostmask> tällä hetkellä on tunnistautunut, tai tunnistettu) <viestiksi>. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <utilisateur|nick> <message> Définit le <message> d'annonce de l'<utilisateur> (ou la personne désignée par <nick>). <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] <utente|nick> <messaggio> Imposta l'annuncio per <utente> (o <nick|hostmask> con cui è identificato al momento) a <messaggio>. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] [<user|nick>] Removes the herald message set for <user>, or the user <nick|hostmask> is currently identified or recognized as. If <user> is not given, defaults to the user giving the command. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [<käyttäjä|nimimerkki>] Poistaa airue viestin, joka on asetettu <käyttäjälle>, tai <nimimerkille|hostmaskille> joka on tällä hetkellä tunnistettu tai tunnistautunut. Jos <käyttäjää> ei ole annettu, se on oletuksena komennon antanut käyttäjä. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] [<utilisateur|nick>] Supprime le message d'annonce de l'<utilisateur> (ou de l'utilisateur désigné par le <nick>). <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] [<utente|nick>] Rimuove l'annuncio per <utente> o <nick|hostmask> con cui è identificato al momento. Se <utente> non è specificato, passa a quello che ha dato il comando. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: I have no herald for that user.
fi: Minulla ei ole airuetta tuolle käyttäjälle.
fr: Je n'ai pas de message d'annonce pour cet utilisateur.
it: Non ho annunci per questo utente.

source: [<channel>] [<user|nick>] <regexp> Changes the herald message for <user>, or the user <nick|hostmask> is currently identified or recognized as, according to <regexp>. If <user> is not given, defaults to the calling user. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [<käyttäjä|nimimerkki>] <säännöllinen lauseke> Vaihtaa <käyttäjän> airueen, tai käyttäjän <nick|hostmask> joka on tunnistautunut tai tunnistettu, <säännöllisen lausekkeen mukaan>. Jos <käyttäjää> ei ole annettu, se on oletuksena komennon antanut käyttäjä. <kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] [<utilisateur|nick>] [<expression régulière>] Change le message d'annonce de l'<utilisateur> (ou de l'utilisateur désigné par le <nick>), en fonction de l'<expression régulière>. Si l'<utilisateur> n'est pas donné, cea correspond par défaut de l'utilisateur appelant la commande. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] [<utente|nick>] <regexp> Modifica l'annuncio per <utente>, o <nick|hostmask> con cui è identificato al momento, in base a <regexp>. Se <utente> non è specificato, passa a quello che ha dato il comando. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] [--remove|<msg>] If <msg> is given, sets the default herald to <msg>. A <msg> of "" will remove the default herald. If <msg> is not given, returns the current default herald. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] [--remove|<message>] Si le <message> est donné, définit le message d'annonce par défaut pour être le <message>. Un <message> de la forme "" supprimera le message d'annonce par défaut. Si le <message> n'est pas donné, retourne le message d'annonce par défaut actuel. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] [--remove|<messaggio>] Se <messaggio> è fornito, imposta l'annuncio predefinito a <messaggio>; un <messaggio> nella forma "" rimuoverà il predefinito. Se <messaggio> non è specificato, restituisce l'attuale annuncio. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.
