Repository: progval/Limnoria
Catalog: plugins/Status/locales/*.po
Languages: fi, fr, it

source: Determines whether the cpu command will list the time taken by children as well as the bot's process.
fi: Määrittää luetteleeko cpu komento lasten ottaman ajan botin prosessin lisäksi.
fr: Détermine si la commande cpu listera le temps pris par les enfants aussi bien que celui du processus du bot.
it: Determina se il comando cpu elencherà il tempo impiegato dal processo figlio così come il processo del bot.

source: Determines whether the cpu command will provide the number of threads spawned and active.
fi: Määrittää ilmoittaako cpu komento ilmestyneiden ja aktiiviseten ketjujen lukumäärät.
fr: Détermine si la commande cpu donnera le nombre de threads lancés et actifs.
it: Determina se il comando cpu fornirà il numero di thread avviati e attivi.

source: Determines whether the cpu command will report the amount of memory being used by the bot.
fi: Määrittää ilmoittaako cpu komento botin käyttämän muistin määrän.
fr: Détermine si la commande cpu donnera la quantité de mémoire utilisée par le bot.
it: Determina se il comando cpu riporterà la quantità di memoria usata dal bot.

source: This plugin allows you to view different bot statistics, for example, uptime.
fi: Tämä plugini näyttää erilaisia tilastoja botista, kuten esimerkiksi käynnissäolo-ajan.

source: takes no arguments Returns the status of the bot.
fi: ei ota parametrejä Palauttaa botin tilan.
fr: ne prend pas d'argument Retourne le status du bot.
it: non necessita argomenti Riporta lo stato del bot.

source: %s as %L
fi: %s verkossa %L

source: I am connected to %L.
fi: Olen yhdistänyt verkkoon %L

source: I am currently in code profiling mode.
fi: Olen tällä hetkellä koodin profilointi tilassa.
fr: Je suis actuellement en mode de profiling du code.
it: Sto analizzando i dati.

source: takes no arguments Returns the current threads that are active.
fi: ei ota parametrejä Palauttaa botin tämänhetkiset ketjut, jotka ovat aktiivisia.
fr: ne prend pas d'argument Retourne les threads actifs.
it: non necessita argomenti Riporta gli attuali thread attivi.

source: I have spawned %n; %n %b still currently active: %L.
fi: Minä olen ilmestyttänyt %n; %n %b yhä aktiivinen: %L.
fr: J'ai lancé %n ; %n %b encore actuellement en vie : %L.
it: Ho avviato %n; %n %b attualmente ancora attivi: %L.

source: takes no arguments Returns the number of processes that have been spawned, and list of ones that are still active.
fi: ei ota parametrejä Palauttaa prosessien määrän, jotka on luotu ja listan niistä prosesseista, jotka ovat yhä aktiivisia..
fr: ne prend pas d'argument Retourne le nombre de processus qui ont été lancés, et la liste de ceux qui sont encore actifs.

source: takes no arguments Returns some interesting network-related statistics.
fi: ei ota parametrejä Palauttaa joitakin mielenkiintoisia verkkoon liittyviä tilastotietoja.
fr: ne prend pas d'argument Retourne quelques statistiques intéressantes liées au réseau.
it: non necessita argomenti Riporta alcune statistiche interessanti riguardanti la rete.

source: an indeterminate amount of time
fi: määrittämätön määrä aikaa
fr: une durée indéterminée
it: una quantità di tempo indeterminato

source: I have received %s messages for a total of %S. I have sent %s messages for a total of %S. I have been connected to %s for %s.
fi: Minä olen vastaanottanut %s viestiä yhteensä määrän %S edestä. Olen lähettänyt %s viestiä määrän %S edestä. Olen ollut yhdistettynä palvelimeen %s ajan %s.
fr: J'ai reçu %s message pour un total de %S. J'ai envoyé %s messages pour un total de %S. J'ai été connecté à %s pendant %s.
it: Ho ricevuto %s messaggi per un totale di %S. Ho inviato %s messaggi per un totale di %S. Sono connesso a %s da %s.

source: takes no arguments Returns some interesting CPU-related statistics on the bot.
fi: ei ota parametrejä Palauttaa joitakin mielenkiintoisia suoritinkäyttöön liittyviä tilastotietoja botista.
fr: ne prend pas d'argument Retourne quelques statistiques intéressantes reliées au CPU.
it: non necessita argomenti Riporta alcune statistiche interessanti riguardanti la CPU.

source: My children have taken %.2f seconds of user time and %.2f seconds of system time for a total of %.2f seconds of CPU time.
fi: Minun lapseni ovat vieneet %.2f käyttäjän aikaa ja %.2f sekuntia järjestelmän aikaa. Lapseni ovat ottaneet yhteensä %.2f sekuntia CPU aikaa.
fr: Mes enfants ont pris %.2f secondes du temps utilisateur et %.2f secondes du temps système, pour un total de %.2f secondes de temps CPU.
it: I miei processi figli hanno impiegato %.2f secondi di tempo a livello utente e %.2f secondi a livello di sistema per un totale di %.2f secondi di tempo di CPU.

source: I have taken %.2f seconds of user time and %.2f seconds of system time, for a total of %.2f seconds of CPU time. %s
fi: Olen ottanut %.2f sekuntia käyttäjän aikaa %.2f sekuntia järjestelmän aikaa. Olen ottanut yhteensä %.2f sekuntia CPU ajasta. %s
fr: J'ai pris %.2f secondes du temps utilisateur et %.2f secondes du temps système, pour un total de %.2f secondes de temps CPU. %s
it: Ho impiegato %.2f secondi di tempo a livello utente e %.2f secondi a livello di sistema per un totale di %.2f secondi di tempo di CPU. %s

source: Unable to run ps command.
fi: ps komentoa ei pystytä suorittamaan.
fr: Impossible de lancer la commande ps.
it: Impossibile eseguire il comando ps.

source: I'm taking up %S of memory.
fi: Muistinkäyttöni on yhteensä %S.
fr: Je prend plus de %S de mémoire.
it: Sto impiegando il %S di memoria.

source: takes no arguments Returns some interesting command-related statistics.
fi: ei ota parametrejä Palauttaa joitakin mielenkiintoisia komentoihin liittyviä tilastotietoja.
fr: ne prend pas d'argument Retourne quelques statistiques intéressantes liées aux commandes.
it: non necessita argomenti Riporta alcune statistiche interessanti riguardanti i comandi.

source: I offer a total of %n in %n. I have processed %n.
fi: Tarjoan yhteensä %n määrän %n sisässä. Olen käsitellyt %n.
fr: J'offre un total de %n dans %n plugins. J'ai géré %n.
it: Offro un totale di %n in %n. Ho elaborato %n.

source: takes no arguments Returns a list of the commands offered by the bot.
fi: ei ota parametrejä Palauttaa listan komennoista, jotka botti tarjoaa.
fr: ne prend pas d'argument Retourne une liste des commandes offertes par le bot.
it: non necessita argomenti Restituisce un elenco dei comandi offerti dal bot.

source: takes no arguments Returns the amount of time the bot has been running.
fi: ei ota parametrejä Palauttaa ajan, jonka botti on ollut käynnissä.
fr: ne prend pas d'argument Retourne la durée durant laquelle le bot est lancée.
it: non necessita argomenti Riporta da quanto tempo il bot è in esecuzione.

source: I have been running for %s.
fi: Olen ollut käynnissä ajan %s.
fr: Je suis lancé depuis %s.
it: Sono in funzione da %s.

source: takes no arguments Returns the server the bot is on.
fi: ei ota parametrejä Palauttaa palvelimen, jolla botti on.
fr: ne prend pas d'argument Retourne le(s) serveur(s) sur le(s)quel(s) le bot est.
it: non necessita argomenti Restituisce i server ai quali è connesso il bot.

source: takes no arguments Returns the network the bot is on.
fi: ei ota parametrejä Palauttaa verkon, jossa botti on.
fr: ne prend pas d'argument Retourne le(s) serveur(s) sur le(s)quel(s) le bot est.
it: non necessita argomenti Restituisce la network alla quale è connesso il bot.
