Repository: progval/Limnoria
Catalog: plugins/MessageParser/locales/*.po
Languages: fr

source: Determines whether the message parser is enabled. If enabled, will trigger on regexps added to the regexp db.
fr: Détermine si le parseur de messages est activé. S'il l'est, il réagira aux expressions régulières qui sont dans la base de données d'expressions régulières.

source: Determines whether the message parser is enabled for NOTICE messages too.
fr: Détermine si le parseur de messages est aussi activé pour les NOTICEs.

source: Determines whether we keep updating the usage count for each regexp, for popularity ranking.
fr: Détermine si on met à jour le compteur d'utilisation de chaque expression régulière, pour un classement de popularité

source: Determines the number of regexps returned by the triggerrank command.
fr: Détermine le nombre d'expressions régulières retournées par la commande triggerrank

source: Determines the capability required (if any) to vacuum the database.
fr: Détermine la capacité requise (s'il y en a une) pour faire un vacuum de la base de données.

source: Determines the capabilities required (if any) to manage the regexp database, including add, remove, lock, unlock. Use 'channel,capab' for channel-level capabilities. Note that absence of an explicit anticapability means user has capability.
fr: Détermine les capacités requises (s'il y en a) pour gérer la base de données d'expressions régulières, ce qui inclue l'ajout, la suppression, le verrouillage, et le déverrouillage. Utilisez 'canal,capa' pour des capacités par canal. Notez que l'absence de toute anti-capacité explicite signifit que l'utilisateur peut le faire.

source: Determines the separator used between regexps when shown by the list command.
fr: Détermine le séparateur utilisé entre les expressions régulières affichées par la commande list.

source: This plugin can set regexp triggers to activate the bot. Use 'add' command to add regexp trigger, 'remove' to remove.
fr: Ce plugin peut définir les triggers pour activer le bot. Utilisez la commande 'add' pour ajouter un trigger et 'remove' pour en retirer un.

source: [<channel>|global] <regexp> <action> Associates <regexp> with <action>. <channel> is only necessary if the message isn't sent on the channel itself. Action is echoed upon regexp match, with variables $1, $2, etc. being interpolated from the regexp match groups.
fr: [<canal|global>] <expression régulière> <action> Associe l'<expression régulière> à l'<action>. <action> est affiché après la correspondance avec l'<expression régulière>, avec les variables $1, $2, etc, récupérés à partir des groupes de correspondance de l'<expression régulière>.<canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: Invalid python regexp: %s
fr: Expression régulière Python invalide : %s

source: That trigger is locked.
fr: Ce trigger est bloqué.

source: [<channel>|global] [--id] <regexp>] Removes the trigger for <regexp> from the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. If option --id specified, will retrieve by regexp id, not content.
fr: [<canal|global>] [--id] <expression régulière> Supprime le déclencheur pour l'<expression régulière> de la base de données des déclencheurs. Si l'option --id est spécifiée, l'id de l'<expression régulière> sera récupéré, et non le contenu.

source: There is no such regexp trigger.
fr: Cette expression régulière n'existe pas.

source: This regexp trigger is locked.
fr: Cette expression régulière est verrouillée

source: [<channel>|global] <regexp> Locks the <regexp> so that it cannot be removed or overwritten to. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal|global>] <expression régulière> Verrouille l'<expression régulière>, ce qui fait que l'on ne puisse plus la supprimer ou la modifier. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>|global] <regexp> Unlocks the entry associated with <regexp> so that it can be removed or overwritten. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal|global>] <expression régulière> Déverrouille l'<expression régulière>, ce qui fait que l'on peut à nouveau la supprimer ou la modifier. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>|global] [--id] <regexp> Looks up the value of <regexp> in the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. If option --id specified, will retrieve by regexp id, not content.
fr: [<canal|global>] [--id] <expression régulière> Recherche la valeur de l'<expression régulière> de la base de données des déclencheurs. Si l'option --id est spécifiée, l'id de l'<expression régulière> sera récupéré, et non le contenu.

source: [<channel>|global] [--id] <regexp> Display information about <regexp> in the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. If option --id specified, will retrieve by regexp id, not content.
fr: [<canal|global>] [--id] <expression régulière> Affiche des informations à propos de l'<expression régulière> de la base de données des déclencheurs. Si l'option --id est spécifiée, l'id de l'<expression régulière> sera récupéré, et non le contenu.

source: The regexp id is %d, regexp is "%s", and action is "%s". It was added by user %s on %s, has been triggered %d times, and is %s.
fr: L'id de l'expression régulière est %d, l'expression régulière est "%s", et l'action est "%s". Elle a été ajoutée par l'utilisateur %s le %s, et a été utilisée %d fois, et est %s

source: locked
fr: verouillée

source: not locked
fr: non verrouillée

source: [<channel>|global] Lists regexps present in the triggers database. <channel> is only necessary if the message isn't sent in the channel itself. Regexp ID listed in parentheses.
fr: [<canal|global>] Liste les expressions régulières présentes dans la base de données. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: There are no regexp triggers in the database.
fr: Il n'y a pas d'expression régulière dans ma base de données.

source: [<channel>|global] Returns a list of top-ranked regexps, sorted by usage count (rank). The number of regexps returned is set by the rankListLength registry value. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal|global>] Retourne une liste des expressions régulières les plus utilisées. Le nombre d'expressions régulières est définie par la variable de registre supybot.plugins.MessageParser.rankListLength. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>|global] Vacuums the database for <channel>. See SQLite vacuum doc here: http://www.sqlite.org/lang_vacuum.html <channel> is only necessary if the message isn't sent in the channel itself. First check if user has the required capability specified in plugin config requireVacuumCapability.
fr: [<canal|global>] Fait un vacuum de la base de données pour le <canal>.Lisez la documentation de SQLite sur cette fonctionnalité : http://www.sqlite.org/lang_vacuum.htmlVérifie d'abord si l'utilisateur a bien la capacité spécifiée dans la variable de configuration supybot.plugins.requireVacuumCapability<canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
