Repository: progval/Limnoria
Catalog: plugins/Web/locales/*.po
Languages: de, fi, fr, it

source: Determines whether the bot will output the HTML title of URLs it sees in the channel.
de: Legt fest ob der Bot den HTML Titel, von URLs die er im Channel sieht, ausgibt.
fi: Määrittää tulostaako botti kanavalle näkimiensä URL-osoitteiden HTML otsikot.
fr: Détermine si le bot affichera le titre HTML des URLs qu'il voit sur le canal.
it: Determina se il bot mostrerà il titolo HTML degli URL che vede in canale.

source: Determines whether the bot will notfiy the user about network exceptions like hostnotfound, timeout ....
fi: Määrittää ilmoitetaanko käyttäjää verkkovirheistä, kuten isäntää ei löydy, aikakatkaisu ....
fr: Détermine si le bot notifiera les utilisateurs à propos d’exceptions liées au réseau, comme hostnotfound, timeout, …

source: Determines whether the domain name displayed by the snarfer will be the original one (posted on IRC) or the target one (got after following redirects, if any).
fi: Määrittää onko kaappaajan näyttämä domain nimi se, joka lähetettiin alunperin IRC:ssä vai kohde domainin nimi (seuraten uudelleenohjauksia siinä tapauksessa, että niitä on).
fr: Détermine si le nom de domaine affiché par le snarfer est l’original (posté sur IRC) ou celui de la cible (après avoir suivi les redirections, s’il y en a).

source: Determines what URLs matching the given regexp will not be snarfed. Give the empty string if you have no URLs that you'd like to exclude from being snarfed.
fi: Määrittää mitä säännöllistä lauseketta täsmäävät URL-osoitteet eivät tule kaapatuiksi. Anna tyhjä merkkiketju, mikäli sinulla ei ole URL-osoitteita, joiden et haluaisi tulevan kaapatuiksi.
fr: Détermine quelles URLs ne seront pas écoutées. Donnez une chaîne vide si vous ne voulez ignorer aucune URL.
it: Determina quali URL corrispondenti alla regexp fornita non verranno intercettati. Se non si vuole escludere alcun URL, fornire una stringa vuota.

source: Determines the maximum number of bytes the bot will download via the 'fetch' command in this plugin.
de: Legt die maximal Anzahl an Bytes fest die der Bot über den 'fetch' Befehl herunterläd.
fi: Määrittää enimmäismäärän bittejä, jotka botti lataa käyttämällä 'fetch' komentoa tässä lisäosassa.
fr: Détermine le nombre maximum d'octet que le bot téléchargera via la commande 'fetch' de ce plugin.
it: Determina il numero massimo di byte che il bot scaricherà tramite il comando "fetch" di questo plugin.

source: Runs a command in a forked process with limited memory resources to prevent memory bomb caused by specially crafted http responses.
fi: Suorittaa komennon forkatussa prosessissa rajoitetuilla muistiresursseilla estääkseen muistipommin, jonka aiheuttavat vartavasten luodut http-vastaukset.

source: Page is too big or the server took too much time to answer the request.
fi: Sivu on liian suuri tai palvelin vastasi pyyntöön liian hitaasti.

source: Display a nice error instead of "An error has occurred".
fi: Näytä kiva virheilmoitus ilmoitukset "Virhe on tapahtunut" sijaan.

source: Add the help for "@help Web" here.
fi: Lisää ohje komennolle "@help Web" tähän.

source: Title: %s (at %s)
de: Titel: %s (auf %s)
fi: Otsikko: %s (sivustolla %s)
fr: Titre : %s (de %s)
it: Titolo: %s (su %s)

source: <url> Returns the HTTP headers of <url>. Only HTTP urls are valid, of course.
de: <url> Gibt den HTTP Kopf von <url> aus. Natürlich sind nur HTTP URLS zulässig.
fi: <URL> Palauttaa <URL>-osoitteen HTTP otsikot. Tietysti, vain HTTP URL-osoitteet ovat kelvollisia.
fr: <url> Retourne les en-têtes HTTP de l'<url>. Seules les URLs HTTP sont valides, bien sûr.
it: <url> Restituisce gli header HTTP di <url>. Naturalmente sono validi solo ULR HTTP.

source: <url> Returns the DOCTYPE string of <url>. Only HTTP urls are valid, of course.
de: <url> Gibt die DOCTYPE Zeichenkette von <url> aus. Natürlich sind nur HTTP URLS zulässig
fi: <URL> Palauttaa <URL>-osoitteen DOCTYPE merkkiketjun. Tietysti, vain HTTP URL-osoitteet ovat kelvollisia.
fr: <url> Retourne le DOCTYPE de l'<url>. Seules les URLs HTTP sont valides, bien sûr.
it: <url> Restituisce la stringa DOCTYPE di <url>. Naturalmente sono validi solo URL HTTP.

source: That URL has no specified doctype.
de: Diese URL hat doctype nicht spezifiziert.
fi: Tuo URL-osoite ei ole määrittänyt doctypeä.
fr: Cette URL n'a pas de doctype spécifié.
it: Questo URL non ha un doctype specificato.

source: <url> Returns the Content-Length header of <url>. Only HTTP urls are valid, of course.
de: <url> Gibt Content-Length Kopf der <url> aus. Natürlich sind nur HTTP URLs zulässig
fi: <URL> Palauttaa <URL>-osoitteen sisällön pituus otsikon. Tietysti, vain HTTP URL-osoitteet ovat kelvollisia.
fr: <url> Retourne le'en-têtes HTTP Content-Length de l'<url>. Seules les URLs HTTP sont valides, bien sûr.
it: <url> Restituisce l'header Content-Length di <url>. Naturalmente sono validi solo ULR HTTP.

source: %u is %S long.
de: %u ist %S lang.
fi: %u on %S pitkä.
fr: %u est long de %S.
it: %u è lungo %S.

source: The server didn't tell me how long %u is but it's longer than %S.
fi: Palvelin ei kertonut minulle, kuinka pitkä %u on, mutta se on pidempi kuin %S.
fr: Le serveur ne m'a pas dit quelle est la longueur de %u, mais c'est sûr que c'est plus que %S.
it: Il server non mi ha detto quanto sia lungo %u ma è più di %S.

source: [--no-filter] <url> Returns the HTML <title>...</title> of a URL. If --no-filter is given, the bot won't strip special chars (action, DCC, ...).
fi: [--no-filter] <url> Palauttaa <title>...</title> URL-osoitteen titletageista. Jos--no-filter annetaan, erikoismerkkejä (action, DCC, ...) ei riisuta.
fr: [--no-filter] <url>Retourne le titre HTML <title>...</title> d'une adresse. Si --no-filter est donné, le bot ne supprimera pas les caractères spéciaux (action, DCC, ...)

source: That URL appears to have no HTML title.
de: Es scheint so als habe die URL keinen HTML Titel.
fi: Tuolla URL-osoitteella ei vaikuta olevan HTTP otsikkoa.
fr: Cette URL semble ne pas avoir de titre HTML.
it: Questo URL sembra non avere un titolo HTML.

source: That URL appears to have no HTML title within the first %S.
de: Es scheint so als habe die URL keinen HTML Titel innerhalb der ersten %S.
fi: Tuolla URL-osoitteella ei vaikuta olevan HTML otsikkoa ensinmäisissä %S.
fr: Ce URL semble ne pas avoir de titre HTML dans les %S au début du fichier.
it: Sembra che questo URL non abbia un titolo HTML entro i primi %S.

source: <text> Returns the URL quoted form of the text.
de: <text> Gibt die URL zitierte Form vom gegeben Text aus.
fi: <teksti> Palauttaa URL lainatun muodon tekstistä.
fr: <texte> Retourne la forme formattée pour URLs du texte.
it: <text> Codifica il testo in base alla codifica URL.

source: <text> Returns the text un-URL quoted.
de: <text> Gibt den Text nicht URL zitiert aus.
fi: <teksti> Palauttaa tekstin URL lainaamattomassa muodossa.
fr: <texte> Retourne la forme dé-formattée pour URLs du texte.
it: <text> Decodifica il testo codificato secondo la codifica URL.

source: <url> Returns the contents of <url>, or as much as is configured in supybot.plugins.Web.fetch.maximum. If that configuration variable is set to 0, this command will be effectively disabled.
de: <url> Gibt den Inhalt von <url> aus. oder soviel wie in supybot.plugins.Web.fetch.maximum konfiguriert wurde. Falls diese Konfigurationsvariable auf 0 gesetzt ist, wird der Befehl praktisch deaktiviert.
fi: <URL-osoite> Palauttaa <URL-osoitteen> sisällön, tai niin paljon kuin on määritetty asetuksessa supybot.plugins.Web.fetch.maximum. Jos tuo asetusarvo on asetettu arvoon 0, tämä komento poistetaan käytöstä.
fr: <url> Retourne le contenu de l'<url>, ou les supybot.plugins.Web.fetch.maximum premiers octets. Si la variable de configution est définie à 0, elle sera effectivement désactivée.
it: <url> Riporta il contenuto di <url>, o tanti byte quanti sono definiti in supybot.plugins.Web.fetch.maximum. Se questa variabile è impostata a 0, il comando sarà disabilitato.

source: This command is disabled (supybot.plugins.Web.fetch.maximum is set to 0).
de: Dieser Befehl ist abgeschaltet (supybot.plugins.Web.fetch.maximum ist auf 0 gesetzt).
fi: Tämä komento on poistettu käytöstä (supybot.plugins.Web.fetch.maximum on asetettu arvoon 0).
fr: Cette commande est désactivée (supybot.plugins.Web.fetch.maximum vaut 0).
it: Questo comando è disabilitato (supybot.plugins.Web.fetch.maximum è impostata a 0).

source: Page is too big.
fr: La page est trop grosse.

source: <url> Returns the HTML <title>...</title> of a URL.
de: <url> Gibt den HTML <title>...</title> einer URL aus.
it: <url> Restituisce il tag HTML <title>...</title> di un URL.

source: <hostname|ip> Returns Netcraft.com's determination of what operating system and webserver is running on the host given.
de: <Hostname|IP> Gibt die Vermutung von Netcraft.com, über das Betriebssystem und Webserver des gegeben Hosts, aus.
it: <hostname|ip> Riporta la stima di Netcraft.com riguardo a quale sistema operativo e server web girano sull'host richiesto.

source: No results found for %s.
de: Keine Ergebnisse für %s gefunden.
it: Nessun risultato trovato per %s.

source: The format of page the was odd.
de: Das Format der Seite ist komisch.
it: Il formato della pagina è strano.

source: Add the help for "help Web" here.
de: Füge die Hilfe für "help Web" hier hinzu.
