Repository: progval/Limnoria
Catalog: plugins/Owner/locales/*.po
Languages: de, fr, hu

source: <text> Logs <text> to the global Supybot log at critical priority. Useful for marking logfiles for later searching.
de: <Text> Schreibt <Text> in die globale Supybot Logdatei mit kritischer Priorität. Nützlich um Logdateien zu markieren um sie später zu durchsuchen.
fr: <texte> Log le <texte> aux logs globaux de Supybot avec une priorité critique. Utile pour marquer les fichiers de logs pour des recherches ultérieures.
hu: <szöveg> Naplózza <szöveg>-et a globális Supybot naplóba kritikus prioritással. Hasznos a naplófájlok megjelölésére későbbi kereséshez.

source: <text> Sends <text> to all channels the bot is currently on and not lobotomized in.
de: <Text> Sendet <Text> an alle Kanäle in denen der Bot momentan ist und nicht hirnamputiert ist.
fr: <texte> Envoie le <texte> à tous les canaux sur lesquels le bot est sans être lobotomisé.
hu: <text> Elküldi <szöveg>-et minden csatornára, ahol a bot van és nincs némítva.

source: [--remove] <command> [<plugin>] Sets the default plugin for <command> to <plugin>. If --remove is given, removes the current default plugin for <command>. If no plugin is given, returns the current default plugin set for <command>. See also, supybot.commands.defaultPlugins.importantPlugins.
de: [--remove] <Befehl> [<Plugin>] Setzt das Standardplugin für <Befehl> auf <Plugin>. Falls --remove angegeben wird, wird das momentane Standardplugin für <Befehl> entfernt. Falls kein Plugin angegeben wird, wird das momentane Standardplugin für <Befehl> ausgegeben. Schau auch nach supybot.commands.defaultPlugins.importantPlugins.
fr: [--remove] <commande> [<plugin>] Défini le <plugin> par défaut de la <commande>. Si --remove est donné, le commande par défaut actuelle est supprimée. Si aucun plugin n'est donné, retourne le plugin par défaut actuel. Voyez supybot.commands.defaultPlugins.importantPlugins pour plus d'informations.
hu: [--remove] <parancs> [<bővítmény>] <parancs> alapértelmezett bővítményét <bővítmény>-re állítja. Ha --remove meg van adva, eltávolítja <parancs> jelenlegi alapértelmezett bővítményét. Ha nincs bővítmény megadva, kiírja <parancs> jelenlegi alapértelmezett bővítményét. Lásd még, supybot.commands.defaultPlugins.importantPlugins.

source: <string to be sent to the server> Sends the raw string given to the server.
de: <Zeichenkette die zum Server gesendet wird> Sendet die Zeichenketten zum angegeben Server.
fr: <chaîne à envoyer au serveur> Envoie la chaîne directement au serveur.
hu: <a szervernek elküldendő karakterlánc> Elküldi a megadott nyers karakterláncot a szervernek.

source: [<text>] Exits the bot with the QUIT message <text>. If <text> is not given, the default quit message (supybot.plugins.Owner.quitMsg) will be used. If there is no default quitMsg set, your nick will be used.
de: [<Text>] Beendet den Bot mit der Nachricht <Text>. Falls <Text> nicht angegeben wird, wird die Standard Endnachricht (supybot.plugins.Owner.quitMsg) benutzt. Wenn es keine standard quitMsg gesetzt ist, wird dein Nickname benutzt.
hu: [<szöveg>] Kilép a botból <szöveg> kilépési üzenettel. Ha <szöveg> nincs meg adva, az alapértelmezett kilépési üzenet (supybot.plugins.Owner.quitMsg) lesz használva. Ha nincs alapértelmezett kilépési üzenet beállítva, a neved lesz használva.

source: takes no arguments Runs all the periodic flushers in world.flushers. This includes flushing all logs and all configuration changes to disk.
de: hat keine Argumente Führt alle periodischen Flusher in world.flushers aus. Das beinhaltet alle Log und Konfigurationsänderung auf die Festplatte zu schreiben.
fr: ne prend pas d'argument. Lance tous les 'flushers' périodiques dans world.flushers. Ceci inclue l'écriture des logs et de la configuration sur le disque.
hu: paraméter nélküli Futtatja az összes időszakos öblítőket world.flushers-ban. Ez magában foglalja az összes naplófájl és konfigurációs fájl mentését a lemezre.

source: [<level>] Runs the standard upkeep stuff (flushes and gc.collects()). If given a level, runs that level of upkeep (currently, the only supported level is "high", which causes the bot to flush a lot of caches as well as do normal upkeep stuff).
de: [<Stufe>] Führt standard Instandhaltungen durch (flushes und gc.collects()). Falls eine Stufe angegeben wird, wird diese Stufe der Instandhaltungausgeführt (momentan ist die einzig unsterstütze Stufe "high", welche den Bot dazu veranlässt viele Caches aufzuräumen und normale Instandhaltung zu bestreiben).
fr: [<niveau>] Lance le 'upkeep' standard (flushes et gc.collect()). Si un niveau est donné, lance le niveau d'upkeep (actuellement, le seul niveau supporté est "high", ce qui fait que le bot vide beaucoup plus de cache que ce qu'il fait normalement).
hu: [<szint>] Futtatja a szabványos karbantartási dolgokat (öblítés és gc.collects()). Ha meg van adva egy szint, a megadott szintű karbantartást futtatja (jelenleg, az egyetlen témogatott szint a "high", amellyel a bot öblít nagyon sok gyorsítótárat és megcsinálja a normális karbantartási dolgokat.

source: [--deprecated] <plugin> Loads the plugin <plugin> from any of the directories in conf.supybot.directories.plugins; usually this includes the main installed directory and 'plugins' in the current directory. --deprecated is necessary if you wish to load deprecated plugins.
de: [--deprecated] <Plugin> Läd das Plugin <Plugin> von irgendeinem Verzeichnis das in conf.supybot.directories.plugins ist; normalerweise enthält diese das Hauptinstallationsverzeichnis und 'plugins' im momentanen Verzeichnis. --deprecated ist nötig falls du veraltete Plugins laden möchtest.
fr: [--deprecated] <plugin> Charge le <plugin> de n'importe lequel des répertoires dans conf.supybot.directories.plugins, ce qui inclue généralement le répertoire principal de l'installation, et 'plugins' dans le répertoire courrant. Utilisez --deprected si nécessaire pour charger des plugins dépréciés.
hu: [--deprecated] <bővítmény> Betölti a <bővítmény> bővítményt a supybot.directories.plugins könyvtárai közül bármelyikből; általában ebbe beletarzozik a fő telepítési könyvtár és egy 'plugins' a jelenlegi könyvtárban. --deprecated akkor szükséges, ha elavult bővítményeket szeretnél betölteni.

source: <plugin> Unloads and subsequently reloads the plugin by name; use the 'list' command to see a list of the currently loaded plugins.
de: <Plugin> Entläd und läd das das Plugin neu; benutze den Befehl 'list' um dir die momentan geladenen Plugins anzuzeigen zu lassen.
fr: <plugin> Décharger et recharge immédiatement le <plugin> ; utilisez la commande 'list' pour lister les plugins actuellement chargés.
hu: <bővítmény> Kirakja és aztán újratölti a megadott bővítményt név szerint; használd a 'list' parancsot, hogy lásd a jelenleg betöltött bővítményeket.

source: {add|remove} <capability> Adds or removes (according to the first argument) <capability> from the default capabilities given to users (the configuration variable supybot.capabilities stores these).
de: {add|remove} <Fähigkeit> Hinzufügen oder entfernen (abhängig vom ersten Argument) der <Fähigkeit> von den Standardfähigkeiten die den Benutzern gegeben werden (die Konfigurationsvariable supybot.capabilities speichert diese).
fr: {add|remove} <capacité> Ajoute ou supprime (en fonction du premier argument) la <capacité> à la liste des capacités par défaut données aux utilisateurs (stockée dans la variable de configuration supybot.capabilities).
hu: {add|remove} <képesség> Hozzáadja vagy eltávolítja (az első paraméter szerint) <képesség>-et a felhasználóknak adott alapértelmezett képességekhez/-ből (a supybot.capabilities konfigurációs változó tárolja ezeket).

source: [<plugin>] <command> Disables the command <command> for all users (including the owners). If <plugin> is given, only disables the <command> from <plugin>. If you want to disable a command for most users but not for yourself, set a default capability of -plugin.command or -command (if you want to disable the command in all plugins).
de: [<Plugin>] <Befehl> Deaktiviert den Befehl <Befehl> für alle Nutzer (auch den Besitzer). Falls <Plugin angegen wird nur der <Befehl> von <Plugin> deaktiviert. Dieser Befehl ist das gegenteil von disable.Falls du den Befehl nur für die meisten Nutzer deaktiveren willst setze eine standard Fähigkeit -plugin.befehl oder -befehl (falls du den Befehl von allen Plugins deaktivieren willst).
fr: [<plugin>] <commande> Désactive la <commande> pour tous les utilisateurs (y compris le propriétaire. Si le <plugin> est donné, ne désactive la <commande> que pour le <plugin>. Si vous voulez désactiver la commande pour tous les utilisateurs sauf vous-même, définissez la capacité par défaut -plugin.command ou -command.
hu: [<bővítmény>] <parancs> Letiltja <parancs> parancsot minden felhasználónak (a tulajdonosokat is beleértve). Ha <bővítmény> meg van adva, csak <bővítmény>-ben tiltja le <parancs>-ot. Ha le szeretnél tiltani egy parancsot a legtöbb felhasználónak de nem magadnak, állíts be egy -bővítmény.parancs vagy -parancs alapértelmezett képességet (ha minden bővítményben le szeretnéd tiltani a parancsot).

source: [<plugin>] <command> Enables the command <command> for all users. If <plugin> if given, only enables the <command> from <plugin>. This command is the inverse of disable.
de: [<Plugin>] <Befehl> Aktiviert den Befehl <Befehl> für alle Nutzer. Falls <Plugin angegen wird nur der <Befehl> von <Plugin> aktiviert. Dieser Befehl ist das gegenteil von disable.
fr: [<plugin>] <commande> Active la <commande> pour tous les utilisateurs. Si le <plugin> est donné, ne réactive la <commande> que pour le <plugin>. Cette commande est l'inverse de disable.
hu: [<bővítmény>] <parancs> Engedélyezi <parancs> parancsot minden felhasználónak. Ha <bővítmény> meg van adva, csak <bővítmény>-ben engedélyezi <parancs>-ot. Ez a parancs a fordítottja a disable-nek.

source: <plugin> <command> <new name> Renames <command> in <plugin> to the <new name>.
de: <Plugin> <Befehl> <Neuer Name> Benennt <Befehl> von <Plugin> in <Neuer Name> um.
fr: <plugin> <commande> <nouveau nom> Renomme la <commande> du <plugin> par un <nouveau nom>.
hu: <bővítmény> <parancs> <új név> Átnevezi <parancs>-ot <bővítmény>-ben az <új név>-re.

source: <plugin> Removes all renames in <plugin>. The plugin will be reloaded after this command is run.
de: <Plugin> Entfernt alle Namensänderungen in <Plugin>. Das Plugin wird neu geladen nach diesem Befehl.
fr: <plugin> Supprime tous les renommages du <plugin>. Ce plugin sera rechargé après que cette commande ait été lancée.
hu: <bővítmény> Eltávolítja az összes átnevezést <bővítmény>-ben. A bővítmény újra lesz töltve miután ez a parancs lefutott.

source: takes no argument Reloads the locale of the bot.
de: hat kein Argument Läd die Lokalisations des Bots neu.
fr: ne prend pas d'argument Recharge la locale du bot.
hu: paraméter nélküli Újratölti a bot nyelvét.

source: <plugin> Unloads the callback by name; use the 'list' command to see a list of the currently loaded plugins. Obviously, the Owner plugin can't be unloaded.
fr: <plugin> Décharge le <plugin> ; utilisez la commande 'list' pour lister les plugins actuellement chargés. Évidemment, le plugin Owner ne peut être déchargé.
