Repository: progval/Limnoria
Catalog: plugins/Format/locales/*.po
Languages: fi, fr

source: Provides some commands for formatting text, such as making text bold or capitalized.
fi: Tarjoaa komentoja tekstin muotoiluun, vaikkapa tekstin korostamiseen tai kirjainkoon muuttamiseen.

source: <text> Returns <text> bolded.
fi: <teksti> Palautttaa <tekstin> korostettuna.
fr: <texte> Retourne le texte, en gras

source: <text> Returns <text> in reverse-video.
fi: <teksti> Palauttaa <tekstin> käänteis-videona..
fr: <texte> Retourne le texte, inversé

source: <text> Returns <text> underlined.
fi: <teksti> Palauttaa <tekstin> alleviivattuna.
fr: <texte> Retourne le texte, souligné

source: <foreground> [<background>] <text> Returns <text> with foreground color <foreground> and background color <background> (if given)
fi: <etuala> [<tausta>] <tesksti> Palauttaa <tekstin> etuala värillä <etuala> ja tausta värillä <tausta> (jos annettu)
fr: <premier plan> [<arrière plan>] <texte> Retourne le <texte> avec les couleurs de <premier plan> et de l'<arrière plan> (si donné).

source: <separator> <string 1> [<string> ...] Joins all the arguments together with <separator>.
fi: <erottaja> <ketju 1> [<ketju> ...] Yhdistää kaikki parametrit yhteen <erottajalla>.
fr: <séparateur> <chaîne 1> [<chaîne 2> ...] Joint tous les arguments en utilisant le <séparateur>.

source: <chars to translate> <chars to replace those with> <text> Replaces <chars to translate> with <chars to replace those with> in <text>. The first and second arguments must necessarily be the same length.
fi: <merkit käännettäväksi> <merkit jotka korvaavat ne> <teksti> Korvaa <käännettävät merkit> <merkit, jotka korvaavat ne> <tekstissä>. Ensinmäisen ja viimeisen parametrin täytyy olla täsmälleen saman pituisia.
fr: <caractères à remplacer> <caractères de remplacement> <texte> Remplacer des caractères par d'autres. Le premier et le second argument doivent obligatoirement être de la même taille.

source: <chars to translate> must be the same length as <chars to replace those with>.
fi: <Käännettävien merkkejen> täytyy olla saman pituisia, kuin <merkit, joilla ne korjataan>.
fr: <caractères à remplacer> doit être de la même taille que <caractères de remplacement>

source: <substring to translate> <substring to replace it with> <text> Replaces all non-overlapping occurrences of <substring to translate> with <substring to replace it with> in <text>.
fi: <alimerkkijono käännettäväksi> <alimerkkijono, joka korvaa sen> <teksti> Korvaa kaikki ei-ylilyövät sattumat <käännettävässä merkkijonossa> <alimerkkijonolla, joka korvaa sen> <tekstissä>.
fr: <sous-chaîne à remplacer> <sous-chaîne de remplacement> <texte> Replace toutes les occurences de <sous-chaîne à remplacer> (à condition qu'elles n'entrent pas en conflit) par les <sous-chaîne de remplacement> dans le <texte>.

source: <text> Returns <text> uppercased.
fi: <teksti> Palauttaa <tekstin> isoilla kirjaimilla.
fr: <texte> Retourne le texte, en majuscules

source: <text> Returns <text> lowercased.
fi: <teksti> Palauttaa <tekstin> pienillä kirjaimilla.
fr: <texte> Retourne le texte, en minuscules

source: <text> Returns <text> capitalized.
fi: <teksti> Palauttaa <tekstin> aktivoituna.
fr: <texte> Retourne le texte, capitalisé

source: <text> Returns <text> titlecased.
fi: <teksti> Palauttaa <tekstin> otsikoituna.
fr: <texte> Retourne le texte, mis en majuscules de titre.

source: <text> Returns <text> surrounded by double quotes.
fi: <teksti> Palauttaa tekstin kahden lainausmerkin sisällä.
fr: <texte> Retourne le texte, entouré de guillemets doubles.

source: <string 1> <string 2> Concatenates two strings. Do keep in mind that this is *not* the same thing as join "", since if <string 2> contains spaces, they won't be removed by concat.
fi: <merkkiketju 1> <merkkiketju 2> Liittää merkkiketjut yhteen. Pidä mielessä että tämä *ei* ole sama asia kuin liitä "", koska jos <merkkiketju 2> sisältää välilyöntejä, ne eivät tule liitoksen poistamiksi.
fr: <chaîne 1> <chaîne 2> Concatène les deux chaînes. Notez que ce n'est pas la même chose que de les joindre avec "", car, si <chaîne 2> contient des espaces, ils ne seront pas supprimés par la concaténation.

source: <size> <text> Cuts <text> down to <size> by chopping off the rightmost characters in excess of <size>. If <size> is a negative number, it chops that many characters off the end of <text>.
fi: <koko> <teksti> Leikkaa <teksti> <kokoon> katkaisemalla oikeimmat <koon> pääsyt. Jos <koko> on negatiivinen numero, se leikkaa niin monta merkkiä <tekstin> lopusta.
fr: <taille> <texte> Coup le <texte> en morceaux de <taille>, en découpant les caractères dépassant la <taille>. Si la <taille> est un nombre négatif, il coupe en comptant à partir de la fin du texte.

source: <number> <text> Returns the <number>th space-separated field of <text>. I.e., if text is "foo bar baz" and <number> is 2, "bar" is returned.
fi: <numero> <teksti> Palauttaa <number>:nen välilyönnillä erotetut osan <tekstiät>. Esim. jos teksti on "foo bar baz" ja <numero> on 2, palauttaa "bar" :in.".
fr: <nombre> <texte> Retourne le <nombre>-ième élément (séparé par des espaces) du <texte>. C'est à dire que si le texte est "foo bar baz" et que <nombre> est 2, "bar" sera retourné.

source: <format string> [<arg> ...] Expands a Python-style format string using the remaining args. Just be sure always to use %s, not %d or %f or whatever, because all the args are strings.
fi: <formaatti merkkijono> [<parametrit> ...] Laajentaa Python-tyylistä merkkiketjua käyttämällä jäljellä olevia parametrejä. Ole varma, että käytät aina vain %s:ää, etkä %d:tä tai %f:ää tai mitä tahansa, koska kaikki parametrit ovat merkkiketjuja.
fr: <chaîne de formattage> [<arg> ...] Étant une chaine de formattage dans le style de Python avec les arguments restants.Assurez-vous seulement de toujours utiliser %s, et pas %d, %f, ou quoi que ce soit d’autre, puisque tous les arguments sont des chaines de caractères.

source: Not enough arguments for the format string.
fi: Ei tarpeeksi parametrejä formaatti merkkiketjulle.
fr: Pas assez d'arguments pour formatter la chaîne.
