Repository: progval/Limnoria
Catalog: plugins/Config/locales/*.po
Languages: fr

source: configuration variable
fr: variable de configuration

source: settable configuration variable
fr: variable de configuration modifiable

source: <group> Returns the configuration variables available under the given configuration <group>. If a variable has values under it, it is preceded by an '@' sign. If a variable is a 'ChannelValue', that is, it can be separately configured for each channel using the 'channel' command in this plugin, it is preceded by an '#' sign.
fr: <groupe> Retourne les variables de configuration qui sont dans le <groupe> de configuration. Si la variable a des sous-variables, elle sera précédée par le signe '@'. Si une variable est une 'ChannelValue', elle sera précédée par le signe '#'. Plus d'informations : http://supybot.fr.cr/Configuration

source: There don't seem to be any values in %s.
fr: Il semble n'y avoir aucune valeur dans %s.

source: <word> Searches for <word> in the current configuration variables.
fr: <mot> Recherche le <mot> dans les variables de configuration.

source: There were no matching configuration variables.
fr: Il n'y a aucune variable de configuration correspondante.

source: Global: %s; %s: %s
fr: Globale : %s ; %s : %s

source: That registry variable has no value. Use the list command in this plugin to see what variables are available in this group.
fr: Cette variable de registre n'a aucune valeur. Utilisez la commande 'list' sur ce plugin pour voir quelles variables sont disponibles pour ce groupe.

source: [<channel>] <name> [<value>] If <value> is given, sets the channel configuration variable for <name> to <value> for <channel>. Otherwise, returns the current channel configuration value of <name>. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <nom> [<valeur>] Si la <valeur> est donnée, défini la variable de configuration <nom> à <valeur> sur le <canal>. Sinon, retourne la configuration actuelle du <canal> pour <nom>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: That configuration variable is not a channel-specific configuration variable.
fr: Cette variable de configuration n'est pas une variable spécifique à un canal.

source: <name> [<value>] If <value> is given, sets the value of <name> to <value>. Otherwise, returns the current value of <name>. You may omit the leading "supybot." in the name if you so choose.
fr: <nom> [<valeur>] Si la <valeur> est donnée, défini la variable de configuration <nom> à <valeur>. Sinon, retourne la configuration actuelle de <nom>. Vous pouvez omettre le 'supybot.' au début du <nom>.

source: <name> Returns the description of the configuration variable <name>.
fr: <nom> Retourne la description de la variable de configuration <nom>.

source: (Current value: %s)
fr: (Valeur courante : %s)

source: That configuration group exists, but seems to have no help. Try "config list %s" to see if it has any children values.
fr: Ce groupe de configuration existe mais semble ne pas avoir d'aide. Essayez "config list %s" pour voir si il a des valeurs filles.

source: %s has no help.
fr: %s n'a pas d'aide.

source: <name> Returns the default value of the configuration variable <name>.
fr: <nom> Retourne la valeur par défaut de la variable de configuration <nom>.

source: takes no arguments Reloads the various configuration files (user database, channel database, registry, etc.).
fr: ne prend pas d'argument Recharge les différents fichiers de configuration (base d'utilisateurs, base de canaux, registre, etc.).

source: <filename> Exports the public variables of your configuration to <filename>. If you want to show someone your configuration file, but you don't want that person to be able to see things like passwords, etc., this command will export a "sanitized" configuration file suitable for showing publicly.
fr: <nom de fichier> Exporte les variables de configuration publiques dans le fichier<nom de fichier. Si vous voulez donner à quelqu'un votre fichier de configuration, mais que vous ne voulez pas que cette personne puisse voir des choses comme les mots de passe, ... cette commande débarrasse le fichier de configuration exporté des données qui ne doivent pas être publiques.

source: <name> Resets the configuration variable <name> to its default value.
fr: <nom> Réinitialise la variable <nom> à sa valeur par défaut.
