Repository: progval/Limnoria
Catalog: locales/*.po
Languages: fr, it, ru

source: Error:
fr: Erreur :
it: Errore:
ru: Ошибка:

source: Error: I tried to send you an empty message.
fr: Erreur : J'ai essayé de vous envoyer un message vide.
it: Errore: ho cercato di inviarti un messaggio vuoto.
ru: Ошибка: я пытался отправить вам пустое сообщение.

source: Missing "%s". You may want to quote your arguments with double quotes in order to prevent extra brackets from being evaluated as nested commands.
fr: "%s" manquant. Vous devriez encadrer vos arguments par des guillements pour éviter que les crochets ne soient évalués comme étant des commandes imbriquées.
it: "%s" mancante. Dovresti racchiudere gli argomenti tra virgolette per evitare che le parentesi vengano interpretate come comandi nidificati.
ru: Отсутствует "%s". Возможно вы захотите заключить аргументы в двойные кавычки, чтобы предотвратить считывание дополнительных скобок как вложенных команд.

source: "|" with nothing preceding. I obviously can't do a pipe with nothing before the |.
fr: "|" avec rien ne le précédant. Je ne peux évidtemment pas faire un pipe avec rien avant le |.
it: "|" con niente che la precede. Ovviamente non posso usare una pipe senza nulla prima di |.
ru: "I", перед которым ничего не стоит. Я не могу создать конвейер, если перед этим символом ничего не написано.

source: Spurious "%s". You may want to quote your arguments with double quotes in order to prevent extra brackets from being evaluated as nested commands.
fr: "%s" en trop. Vous devriez encadrer vos arguments par des guillements pour éviter que les crochets ne soient évalués comme étant des commandes imbriquées.
it: "%s" eccedente. Dovresti racchiudere gli argomenti tra virgolette per evitare che le parentesi vengano interpretate come comandi nidificati.
ru: Ложный "%s". Возможно вы захотите заключить аргументы в двойные кавычки, чтобы предотвратить считывание дополнительных скобок как вложенных команд.

source: "|" with nothing following. I obviously can't do a pipe with nothing after the |.
fr: "|" avec rien ne le suivant. Je ne peux évidtemment pas faire un pipe avec rien après le |.
it: "|" con niente che la segue. Ovviamente non posso usare una pipe senza nulla dopo di |.
ru: "I", за которым ничего не стоит. Я не могу создать конвейер, если после этого символом ничего не написано.

source: %s is not a valid %s.
fr: %s n'est pas un(e) %s valide.
it: %s non è un %s valido.
ru: %s не является допустимым %s.

source: That's not a valid %s.
fr: Ce n'est pas un(e) %s valide.
it: Questo non è un %s valido.
ru: Это не является допустимым %s.

source: (XX more messages)
fr: (XX messages supplémentaires)
it: (XX altri messaggi)
ru: (XX сообщений осталось)

source: more message
fr: message supplémentaire
it: altro messaggio
ru: сообщение осталось

source: more messages
fr: messages supplémentaires
it: altri messaggi
ru: сообщений осталось

source: You've attempted more nesting than is currently allowed on this bot.
fr: Vous avez essayé de faire plus d'imbrication que ce qui est actuellement autorisé sur ce bot.
it: Hai tentato di nidificare più di quanto sia attualmente consentito.
ru: Вы попробовали вложить больше команд, чем это дозволено в боте сейчас.

source: The command %q is available in the %L plugins. Please specify the plugin whose command you wish to call by using its name as a command before %q.
fr: La commande %q est disponible dans les plugins %L. Veuillez spécifier dans quel plugin se trouve la commande que vous souhaitez appeler, en ajoutant le nom du plugin avant %q.
it: Il comando %q è disponibile nei plugin %L. Specifica in quale plugin si trova quello che desideri usare aggiungendo il suo nome prima di %q.
ru: Команда %q доступна в плагинах %L. Уточните из какого плагина вы пытаетесь вызвать команду, указав его название как команду перед %q.

source: Determines what commands are currently disabled. Such commands will not appear in command lists, etc. They will appear not even to exist.
fr: Détermine quelles commandes sont actuellement désactivées. De telles commandes n'apparaitront pas dans la liste des commandes, etc. Ça sera comme si elles n'existaient pas.
it: Determina quali comandi sono attualmente disabilitati. Questi non appariranno nell'elenco dei comandi, ecc.; sarà come se non esistessero.
ru: Определяет, какие команды сейчас отключены. Эти команды не будут появляться в списках команд. Будет казаться, что их даже не существует.

source: Invalid arguments for %s.
fr: Argument invalide pour %s
it: Argomenti non validi per %s.
ru: Недопустимые аргументы для %s.

source: The %q command has no help.
fr: La commande %q n'a pas d'aide.
it: Il comando %q non ha un help.
ru: Команда %q не имеет справки.

source: integer
fr: entier
it: intero
ru: целое число

source: non-integer value
fr: valeur non entière
it: valore non intero
ru: нецелое значение

source: floating point number
fr: nombre à virgule flottante
it: numero in virgola mobile
ru: дробное число

source: positive integer
fr: entier positif
it: intero positivo
ru: положительное целое число

source: non-negative integer
fr: entier non négatif
it: intero non negativo
ru: неотрицательное целое число

source: index
it: indice
ru: индекс

source: number of seconds
fr: nombre de secondes
it: numero di secondi
ru: число секунд

source: boolean
fr: booléen
it: booleano
ru: логический тип

source: do that
fr: faire ça
it: fare ciò
ru: сделайте это

source: I'm not even in %s.
fr: Je ne suis pas sur %s.
it: Non sono in %s.
ru: Я даже не присутствую в %s.

source: I need to be voiced to %s.
fr: Je doit être voicé pour %s
it: Devo avere il voice per %s.
ru: Мне требуется голос (voice) в %s.

source: I need to be at least voiced to %s.
fr: Je doit être au moins voice pour %s
ru: Мне требуется хотя бы голос (voice) в %s.

source: I need to be halfopped to %s.
fr: Je doit être halfop pour %s
it: Devo essere halfop per %s.
ru: Мне требуется быть полуоператором в %s.

source: I need to be at least halfopped to %s.
fr: Je doit être au moins halfop pour %s
it: Devo almeno essere halfop per %s.
ru: Мне требуется хотя бы быть полуоператором в %s.

source: I need to be opped to %s.
fr: Je doit être opé pour %s
it: Devo essere op per %s.
ru: Мне требуется быть оператором в %s.

source: channel
fr: canal
it: canale
ru: канал

source: nick or hostmask
fr: nick ou masque d'hôte
it: nick o hostmask
ru: ник или маска хоста

source: regular expression
fr: expression régulière
it: espressione regolare
ru: регулярное выражение

source: nick
ru: ник

source: That nick is too long for this server.
fr: Ce nick est trop long pour ce serveur.
it: Il nick è troppo lungo per questo server.
ru: Данный ник слишком длинный для этого сервера.

source: I haven't seen %s.
fr: Je n'ai pas vu %s.
ru: Я ещё не видел %s.

source: I'm not in %s.
fr: Je ne suis pas sur %s
it: Non sono in %s.
ru: Меня нет в %s.

source: This command may only be given in a channel that I am in.
fr: Cette commande ne peut être donnée que sur un canal sur lequel je suis.
it: Questo comando può essere dato solo in un canale in cui sono presente.
ru: Данная команда может быть отправлена только в канал, в котором присутствую я.

source: You must be in %s.
fr: Vous devez être sur %s
it: Devo essere in %s.
ru: Вы должны быть в %s.

source: %s is not in %s.
fr: %s n'est pas sur %s
it: %s non è in %s.
ru: %s отсутствует в %s.

source: You must not give the empty string as an argument.
fr: Vous ne pouvez me donner une chaine vide comme argument.
it: Non puoi darmi una stringa vuota come argomento.
ru: Вы не можете передавать пустую строку как аргумент.

source: You must not give a string containing spaces as an argument.
fr: Vous ne pouvez me donner une chaine contenant des espaces comme argument.
ru: Вы не можете передавать строку с пробелами как аргумент.

source: This message must be sent in a channel.
fr: Ce message doit être envoyé sur un canal.
it: Questo messaggio va inviato in canale.
ru: Это сообщение должно быть отправлено в канале.

source: email
fr: courriel
ru: э. почта

source: command name
fr: nom de commande
it: nome comando
ru: название команды

source: letter
fr: lettre
it: lettera
ru: буква

source: plugin
ru: плагин

source: irc color
fr: couleur IRC
it: colore IRC
ru: irc-цвет

source: Determines whether this plugin is loaded by default.
fr: Détermine si ce plugin est chargé par défaut.
it: Determina se questo plugin sia caricato in modo predefinito.
ru: Определяет, будет ли этот плагин загружаться по умолчанию.

source: Determines whether this plugin is publicly visible.
fr: Détermine si ce plugin est visible publiquement
it: Determina se questo plugin sia visibile pubblicamente.
ru: Определяет, будет ли этот плагин виден всем.

source: Determines the bot's default nick.
fr: Détermine le nick par défaut du bot.
it: Determina il nick predefinito del bot.
ru: Определяет ник бота по умолчанию.

source: Determines what alternative nicks will be used if the primary nick (supybot.nick) isn't available. A %s in this nick is replaced by the value of supybot.nick when used. If no alternates are given, or if all are used, the supybot.nick will be perturbed appropriately until an unused nick is found.
fr: Détermine quels nicks alternatifs peuvent être utilisés si le nick principal (supybot.nick) n'est pas disponible. Un %s dans ce nick est remplacé par la valeur de supybot.nick. Si aucune alternative n'est donnée, ou si elles sont toutes déjà utilisées, supybot.nick sera modifié jusqu'à ce qu'un nick non utilisé soit trouvé.
it: Determina quali nick alternativi utilizzare se il principale (supybot.nick) non è disponibile; un %s in questo nick è sostituito dal valore di supybot.nick. Se non è fornita alcuna alternativa, o sono tutti in uso, supybot.nick sarà modificato in modo appropriato finché ne trova uno non utilizzato.
ru: Определяет альтернативные ники, которые будут использованы, если основной ник (supybot.nick) недоступен. %s в этих никах заменяется на значение supybot.nick. Если альтернатив не дано, или все они заняты, то будет использоваться изменённый supybot.nick, пока не освободится хотя бы один альтернативный или основной ник.

source: Determines the bot's ident string, if the server doesn't provide one by default.
fr: Détermine l'ident du bot (ce qui précède le @ dans le masque d'hôte), si le serveur n'en fourni par une par défaut.
it: Determina l'ident (ciò che precede @ nella hostmask) nel caso in cui il server non ne fornisca una.
ru: Определяет ident-строку, если сервер не предоставляет её по умолчанию.

source: Determines the real name which the bot sends to the server. A standard real name using the current version of the bot will be generated if this is left empty.
ru: Определяет настоящее имя (real name), которое бот отсылает серверу. Если не указано, то бот использует номер своей версии.

source: Determines what networks the bot will connect to.
fr: Détermine à quels réseaux le bot se connecte.
it: Determina su quali reti si connetterà il bot.
ru: Определяет, к каким сетям подключится бот.

source: Determines what password will be used on %s. Yes, we know that technically passwords are server-specific and not network-specific, but this is the best we can do right now.
fr: Détermine quel mot de passe sera utilisé sur %s. Oui, nous savons que les mots de passe sont en fait spécifiques aux serveurs et non et réseaux, mais nous pensons que c'est mieux comme ça.
it: Determina quale password utilizzare su %s. Sì, sappiamo che tecnicamente le password sono specifiche per il server e non per la rete, ma per ora è il meglio che possiamo fare.
ru: Определяет, какой пароль будет использован в %s. Да, мы понимаем, что технически пароли задаются для серверов, а не сетей, но это лучшее, что мы можем сейчас сделать.

source: Space-separated list of servers the bot will connect to for %s. Each will be tried in order, wrapping back to the first when the cycle is completed.
fr: Liste des serveurs (éléments séparés par des espaces) auxquels le bot se connectera pour %s. Chacun sera essayé dans l’ordre, retournant au début lorsque le cycle est terminé.
ru: Список серверов %s, разделённых пробелами, к которым бот будет подключаться. Каждый из них будет опробован по порядку, возвращаясь к первому, когда цикл будет завершен.

source: Space-separated list of channels the bot will join only on %s.
fr: Liste (éléments séparés par des espaces) des salons que le bot rejoindra sur ce réseau %s.
ru: Список каналов, разделённых пробелами, к которым бот присоединится в %s.

source: Determines whether the bot will attempt to connect with SSL sockets to %s.
fr: Détermine si le bot tentera de se connecter avec des sockets SSL à %s.
it: Determina se il bot tenterà di connettersi a %s tramite un socket SSL.
ru: Определяет, будет ли бот подключаться с помощью SSL к %s.

source: Space-separated list of fingerprints of trusted certificates for this network. Supported hash algorithms are: %L. If non-empty, Certification Authority signatures will not be used to verify certificates.
ru: Список отпечатков доверенных сертификатов через пробел. Поддерживаемые алгоритмы хэширования: %L. Если эта настройка указана, то подписи центра сертификации не будут учитываться для проверки сертификатов.

source: A certificate that is trusted to verify certificates of this network (aka. Certificate Authority).
ru: Доверенный сертификат, который используют для проверки сертификатов данной сети (как центр сертификации).

source: Deprecated config value, keep it to False.
ru: Устаревшая настройка, оставьте её False.

source: Determines what certificate file (if any) the bot will use to connect with SSL sockets to %s.
fr: Détermine quel fichier de certificat (s’il y en a un) le bot utilisera pour se connecter par SSL à %s.
ru: Определяет файл сертификата (если такой есть), который бот будет использовать для подключения к %s по SSL.

source: Determines what key (if any) will be used to join the channel.
fr: Détermine quelle clef (s'il y en a) sera utilisée pour rejoindre le canal.
it: Determina quale password (eventuale) verrà usata per entrare in canale.
ru: Определяет какой ключ (если есть) будет использован для присоединения к каналу.

source: Determines what nick the bot will use on this network. If empty, defaults to supybot.nick.
fr: Détermine quel nick le bot utilisera sur ce réseau. Si cette variable de configuration est vide, le nick par défaut sera pris dans supybot.nick.
it: Determina che nick userà il bot su questa rete. Se lasciato vuoto assegna il valore di supybot.nick.
ru: Определяет, какой ник будет использовать бот в этой сети. Если не указано, то используется supybot.nick.

source: Determines the bot's ident string, if the server doesn't provide one by default. If empty, defaults to supybot.ident.
ru: Определяет ident-строку для бота, если сервер не предоставляет её по умолчанию. Если не указано, то используется supybot.ident.

source: Determines the real name which the bot sends to the server. If empty, defaults to supybot.user
ru: Определяет настоящее имя (real name), которое бот отсылает серверу. Если не указано, то используется supybot.user.

source: Determines what user modes the bot will request from the server when it first connects. If empty, defaults to supybot.protocols.irc.umodes
fr: Détermine quels modes utilisateur le bot demandera au serveur lorsqu'il s'y connectera. Si cette variable de configuration est vide, le nick par défaut sera pris dans supybot.protocols.irc.umodes.
ru: Определяет, какие режимы пользователя бот будет запрашивать у сервера, когда впервые присоединится. Если не указано, то используется supybot.protocols.irc.umodes.

source: Determines what SASL username will be used on %s. This should be the bot's account name.
ru: Определяет имя пользователя для SASL, которое будет использоваться в %s. Это должно быть именем аккаунта бота.

source: Determines what SASL password will be used on %s.
fr: Détermine quel mot de passe SASL sera utilisé sur %s.
it: Determina quale password per SASL sarà usata su %s.
ru: Определяет пароль SASL, который будет использован в %s.

source: Determines what SASL ECDSA key (if any) will be used on %s. The public key must be registered with NickServ for SASL ECDSA-NIST256P-CHALLENGE to work.
ru: Определяет, какой SASL ECDSA ключ (если существует) будет использован в %s. Публичный ключ должен быть зарегистрирован с помощью NickServ для SASL ECDSA-NIST256P-CHALLENGE, чтобы это работало.

source: Determines what SASL mechanisms will be tried and in which order.
ru: Определяет, в каком порядке и какие механизмы SASL должны быть опробованы.

source: Determines whether the bot will abort the connection if the none of the enabled SASL mechanism succeeded.
ru: Определяет, будет ли бот разрывать соединение, если ни один из включённых механизмов SASL не сработал успешно.

source: If not empty, determines the hostname:port of the socks proxy that will be used to connect to this network.
ru: Если указано, то определяет хост:порт socks-прокси, которое будет использовать для подключения к этой сети.

source: Determines how urls should be formatted.
fr: Détermine comment les URLs seront formatées.
ru: Определяет форматирование url-адресов.

source: Determines how timestamps printed for human reading should be formatted. Refer to the Python documentation for the time module to see valid formatting characters for time formats.
fr: Détermine quels timestamps sont affichés pour être lus par des humaines. Référez-vous à la documentation Python sur le module time pour plus d'information sur les formats valides.
it: Determina come formattare i timestamp affinché possano essere comprensibli. Per sapere quali sono i formati validi fai riferimento alla documentazione di Python per il modulo time.
ru: Определяет формат временных меток, чтобы быть понятными людям. Обратитесь к модулю time в документации Python, чтобы увидеть допустимые символы для форматирования.

source: Determines whether elapsed times will be given as "1 day, 2 hours, 3 minutes, and 15 seconds" or as "1d 2h 3m 15s".
fr: Détermine si un utilise des temps plus courts, c'est à dire par exemple "1d 2h 3m 15s" au lieu de "1 day, 2 hours, 3 minutes, and 15 seconds".
it: Determina se il tempo trascorso sarà espresso nella forma "1 giorno, 2 ore, 3 minuti e 15 secondi" o "1d 2h 3m 15s".
ru: Определяет, как будет указано прошедшее время: "1 день, 2 часа, 3 минуты, и 15 секунд" или "1д 2ч 3м 15с".

source: Maximum number of items in a list before the end is replaced with 'and others'. Set to 0 to always show the entire list.
ru: Максимальное число позиций в списке, которые показываются до надписи 'и другие'. При установке значения в 0 всегда будет показываться весь список.

source: Determines the absolute maximum length of the bot's reply -- no reply will be passed through the bot with a length greater than this.
fr: Détermine la longueur maximum absolue des réponses du bot ; le bot n'enverra aucune réponse qui dépassera ce nombre.
it: Determina la lunghezza massima delle risposte; il bot non invierà alcuna risposta che supera questo valore.
ru: Определяет абсолютный максимум длины ответа бота -- ботом не будут отправлены ответы длиннее указанного значения.

source: Determines whether the bot will break up long messages into chunks and allow users to use the 'more' command to get the remaining chunks.
fr: Détermine si le bot séparera les longs messages en morceaux et permettra aux utilisateurs et utilisatrices d'utiliser la commande 'more' pour récupérer les morceaux restants.
it: Determina se il bot separerà i messaggi lunghi in più parti permettendo agli utenti di utilizzare il comando "more" per ottenere il resto.
ru: Определяет, будет ли бот разбивать длинные сообщения на части и позволять пользователям использовать команду 'more', чтобы получить оставшиеся части сообщения.

source: Determines what the maximum number of chunks (for use with the 'more' command) will be.
fr: Détermine quel est le nombre maximum de morceaux (que l'on récupère avec la commande 'more').
it: Determina il numero massimo di parti (da utilizzare con il comando "more").
ru: Определяет максимальное число частей сообщения (для использования команды 'more').

source: Determines how long individual chunks will be. If set to 0, uses our super-tweaked, get-the-most-out-of-an-individual-message default.
fr: Détermine quelle est la longueur maximale des morceaux. Définir cette variable à 0 permet d'utiliser notre super algorithme pour optimiser cette longueur en fonction des paramètres du serveur.
it: Determina la lunghezza di ogni singolo pezzo. Se impostata a 0 permette di usare il nostro super algoritmo per ottenere il più possibile da ogni messaggio.
ru: Определяет длину отдельных частей сообщения. Если установлено в 0, то используется наше значение по умолчанию.

source: Determines how many mores will be sent instantly (i.e., without the use of the more command, immediately when they are formed). Defaults to 1, which means that a more command will be required for all but the first chunk.
fr: Détermine combien de 'more's sont envoyés immédiatement (c'est à dire, avant l'utilisation de la commande 'more', juste après que l'utilisateur/trice ait envoyé la commande. Par défaut, cela vaut 1, ce qui signifie que seul le premier morceau est envoyé. Avant l'appel de 'more'.
it: Determina quanti pezzi saranno inviati immediatamente (ovvero senza utilizzare il comando "more"). Impostato a 1 in modo predefinito, per cui viene ne viene visualizzato uno solo.
ru: Определяет сколько ещё частей сообщения будет отправлено сразу, т.е. без использования команды 'more', сразу после того, как команда выполнилась. По умолчанию задано 1, что означает, что для получения каждой части сообщения нужен будет вызов команды 'more'.

source: Determines whether the bot will send multi-message replies in a single message. This defaults to True in order to prevent the bot from flooding. If this is set to False the bot will send multi-message replies on multiple lines.
ru: Определяет, будет ли бот отправлять ответы сразу на несколько сообщений в одном сообщении. По умолчанию установлено в True для предотвращения переполнения бота. Если установлено в False, то бот будет отправлять ответы в отдельных сообщениях.

source: Determines whether the bot will reply with an error message when it is addressed but not given a valid command. If this value is False, the bot will remain silent, as long as no other plugins override the normal behavior.
fr: Détermine si le bot répondra avec un message d'erreur lorsqu'un message lui est adressé, mais qu'il ne s'agit pas d'une commande valide. Si cette valeur est à False, le bot restera silencieux, du moment qu'aucun plugin ne modifie le comportement normal.
it: Determines se il bot risponderà con un messaggio di errore quando è chiamato ma non si fornisce un comando valido. Se impostato a False rimarrà silenzioso, a meno che altri plugin modifichino questo comportamento.
ru: Определяет, будет ли бот отвечать сообщением об ошибке, если ему дали неправильную команду. Если указано False, то в этих случаях бот будет молчать, если другие плагины не изменят это поведение.

source: Determines whether error messages that result from bugs in the bot will show a detailed error message (the uncaught exception) or a generic error message.
fr: Détermine si les messages d'erreur résultant de bugs seront affichés dans un message d'erreur (l'exception non interceptée) ou si un message d'erreur générique est utilisé.
it: Determina se i messaggi di errore causati da bug del bot saranno mostrati in modo dettagliato (eccezione non gestita) o con un messaggio di errore generico.
ru: Определяет, будут ли сообщения об ошибках в результате багов содержать подробное сообщение об ошибке (не перехваченное исключение).
