Repository: progval/Limnoria
Catalog: locales/*.po
Languages: fr, it, ru

source: This is a default response of the Supybot HTTP server. If you see this message, it probably means you are developing a plugin, and you have neither overriden this message or defined an handler for this query.
fr: Ceci est la réponse par défaut du serveur HTTP de Supybot. Si vous voyez ce message, cela signifie probablement que vous êtes en train de développer un plugin, et que vous n'avez ni outrepassé ce message ni défini un gestionnaire pour cette requête.
it: Questa è la risposta predefinita del server HTTP di Supybot. Se stai leggendo questo messaggio significa probabilmente che stai sviluppando un plugin e non hai sovrascritto questo messaggio o definito un gestore per questa query.
ru: Это стандартный ответ HTTP-сервера Supybot. Если вы видите это сообщение, возможно вы занимаетесь разработкой плагина и не задали это сообщение или не задали обработчик для этого запроса.

source: I am a pretty clever IRC bot, but I suck at serving Web pages, particulary if I don't know what to serve. What I'm saying is you just triggered a 404 Not Found, and I am not trained to help you in such a case.
fr: Je suis un robot IRC très intelligent, mais je suis nul dès qu'il s'agit de servir des pages Web, en particulier lorsque je ne sais pas quoi servir. Ce que j'essaye de dire, c'est que vous venez tout juste de déclencher une erreur 404 Not Found, and je ne suis pas entraîné à vous aider dans un tel cas.
it: Sono un bot IRC piuttosto intelligente ma terribile quando è ora di servire pagine web, in particolare se non cosa servire. Quel che sto cercando di dirti è che hai appena causato un "404 Not Found" e non sono addestrato per aiutarti in questa circostanza.
ru: Я довольно умный IRC-бот, но у меня плохо получается работать с веб-страницами, особенно, если я не знаю, что именно нужно пользователю. То есть вы только что спровоцировали ошибку 404 (Not Found), а я не способен помочь вам в этом случае.

source: Request not handled.
fr: Requête non gérée.
it: Richiesta non gestita.
ru: Запрос не обработан.

source: No plugins available.
fr: Aucun plugin disponible.
it: Nessun plugin disponibile.
ru: Нет доступных плагинов.

source: Request not handled
fr: Requête non gérée.
it: Richiesta non gestita
ru: Запрос не обработан

source: No favicon set.
fr: Pas de favicon définie.
ru: Нет установленного favicon.

source: is an op on %L
ru: является оператором в %L

source: is a halfop on %L
ru: является полуоператором в %L

source: is voiced on %L
ru: имеет voice в %L

source: is also on %L
ru: также есть в %L

source: is on %L
ru: находится в %L

source: isn't on any publicly visible channels
ru: нет ни в одном общедоступном канале

source: <unknown>
ru: <неизвестный>

source: %s is away: %s.
ru: %s отсутствует: %s.

source: identified
ru: идентифицированный

source: Sorry, you must enter a value.
fr: Désolé, vous devez entrer une valeur.
it: Spiacente, devi inserire un valore.
ru: Извините, но вы должны ввести значение.

source: Enter password:
fr: Entrez un mot de passe :
it: Inserire la password:
ru: Введите пароль:

source: Re-enter password:
fr: Entrez à nouveau le mot de passe :
it: Inserire nuovamente la password:
ru: Повторите пароль:

source: Passwords don't match.
fr: Les mots de passe ne correspondent pas.
it: Le password non corrispondono.
ru: Пароли не совпадают.

source: Value must be either True or False (or On or Off), not %r.
fr: La valeur doit être True ou False (ou On ou Off), pas %r.
ru: Значение должно быть либо True, либо False (или On, или Off), а не %r.

source: Value must be an integer, not %r.
fr: La valeur doit être un entrier, pas %r.
ru: Значение должно быть целым числом, а не %r.

source: Value must be a non-negative integer, not %r.
fr: La valeur doit être un entier non négatif, pas %r.
ru: Значение должно быть целым неотрицательным числом, а не %r.

source: Value must be positive (non-zero) integer, not %r.
fr: La valeur doit être un entier positif (non nul), pas %r.
ru: Значение должно быть положительным (ненулевым) целым числом, а не %r.

source: Value must be a floating-point number, not %r.
fr: La valeur doit être un nombre à virgule flottante, pas %r.
ru: Значение должно быть числом с плавающей точкой, а не %r.

source: Value must be a floating-point number greater than zero, not %r.
fr: La valeur doit être un nombre à virgule flottante plus grand que zéro, pas %r.
ru: Значение должно быть числом с плавающей точкой больше нуля, а не %r.

source: Value must be a floating point number in the range [0, 1], not %r.
fr: La valeur doit être un nombre à virgule flottante compris entre 0 et 1, pas %r.
ru: Значение должно быть числом с плавающей точкой в диапазоне [0, 1], а не %r.

source: Value should be a valid Python string, not %r.
ru: Значение должно быть допустимой Python-строкой, а не %r.

source: Valid values include %L.
fr: Les valeurs valides sont %L.
ru: Допустимые значения включают %L.

source: Valid values include %L, not %%r.
fr: Les valeurs valides sont %L, pas %%r.
ru: Допустимые значения включают в себя %L, а не %%r.

source: Value must be a valid regular expression, not %r.
fr: La valeur doit être une expression rationnelle valide, pas %r.
ru: Значение должно быть допустимым регулярным выражением, а не %r.

source: year
fr: année
ru: год

source: week
fr: semaine
ru: неделя

source: day
fr: jour
ru: день

source: hour
fr: heure
ru: час

source: minute
ru: минута

source: second
fr: seconde
ru: секунда

source: %s ago
fr: il y a %s
ru: %s назад

source: and
fr: et
ru: и

source: http url
fr: URL HTTP
it: URL HTTP

source: Determines the user the bot sends to the server. A standard user using the current version of the bot will be generated if this is left empty.
fr: Détermine le nom réel que le bot envoie au serveur (aussi appelé nom d'utilisateur ; il peut contenir des caractères spéciaux et n'est pas obligatoirement unique). Un nom standard contenant la version actuelle du bot sera généré si vous laisser cette variable vide.
it: Determina il nome utente inviato al server dal bot. Se lasciato vuoto, ne verrà generato uno standard utilizzando la versione del bot.

source: Determines what SASL username will be used on %s. This should be the bot's account name. Due to the way SASL works, you can't use any grouped nick.
fr: Détermine quel nom d'utilisateur SASL sera utilisé sur %s. Ce doit être le nom du compte du bot. À cause de la façon dont SASL fonctionne, vous ne pouvez pas utiliser un nick groupé.
it: Determina quale nome utente SASL utilizzare su %s; dovrebbe essere il nome usato per l'account del bot. A causa del funzionamento di SASL, non è possibile usare un nick raggruppato.

source: If not empty, determines the hostname of the socks proxy that will be used to connect to this network.
fr: Si non vide, détermine l'hôte du proxy socks qui sera utilisé pour se connecter à ce réseau.

source: Determines whether the bot will send multi-message replies in a single message or in multiple messages. For safety purposes (so the bot is less likely to flood) it will normally send everything in a single message, using mores if necessary.
fr: Détermine si le bot enverra des réponses multi-messages dans un seul message ou dans plusieurs. Pour des raisons de sécurité (le bot est moins susceptible de flooder), il envoie tout dans un seul message, et les utilisateurs/trices peuvent utiliser 'more' si nécessaire.
it: Determina se il bot invierà le risposte multiple in uno o più messaggi. Per ragioni di sicurezza (il bot è meno suscettibile a flood) mostrerà tutto in un singolo messaggio e utilizzando "more" se necessario.

source: Determines whether the bot will send error messages to users via NOTICE instead of PRIVMSG. You might want to do this so users can ignore NOTICEs from the bot and not have to see error messages; or you might want to use it in combination with supybot.reply.errorInPrivate so private errors don't open a query window in most IRC clients.
fr: Détermine si le bot enverra les erreurs par NOTICE plutôt que par PRIVMSG. Vous pouvez faire cela pour que les personnes qui ne veulent pas recevoir de message d'erreur ignorent les NOTICEs du bot. Vous pouvez utiliser cette fonctionnalité en combinaison avec supybot.reply.errorInPrivate, pour que les erreurs en privé n'ouvrent pas une nouvelle fenêtre de requête, sur la plupart des clients.
it: Determina se il bot invierà i messaggi di errore tramite NOTICE anziché PRIVMSG. Si può volerlo impostare in modo che gli utenti possano ignorare i NOTICE provenienti dal bot oppure usarlo in combinazione con supybot.reply.errorInPrivate affinché gli errori non causino l'apertura di una finestra privata nel client IRC.

source: Determines whether the bot will send an error message to users who attempt to call a command for which they do not have the necessary capability. You may wish to make this True if you don't want users to understand the underlying security system preventing them from running certain commands.
fr: Détermine si le bot enverra un message d'erreur aux personnes qui tentent d'appeler une commande pour laquelle elles n'ont pas de capacité suffisante. Vous pouvez le mettre à True si vous ne voulez pas que les utilisateurs/trices comprennent le système sous-jacent de capacités pour lancer certaines commandes.
it: Determina se il bot invierà un messaggio di errore agli utenti che cercano di usare un comando per cui non hanno le capacità necessarie. Si può volerlo impostare a True per evitare che vengano a conoscenza del sistema di sicurezza sottostante che impedisce loro di eseguire certi comandi.

source: Determines whether the bot will reply with a notice when it is sending a private message, in order not to open a /query window in clients. This can be overridden by individual users via the user configuration variable reply.withNoticeWhenPrivate.
fr: Détermine si le bot répondra avec une notice lorsque l'on s'adresse à lui en privé, pour éviter de devoir ouvrir une fenêtre /query. Ceci peut être modifié individuellement via la varible de configuration reply.withNoticeWhenPrivate.
it: Determina se il bot risponderà con un notice quando gli si invia un messaggio privato per evitare di aprire una finestra nel client (una /query). Può essere modificato per singolo utente tramite la variabile di configurazione reply.withNoticeWhenPrivate.

source: An error has occurred and has been logged. Check the logs for more informations.
fr: Une erreur est survenue et a été logguée. Vérifiez les logs pour plus d'informations.
it: Si è verificato un errore ed è stato registrato. Per ulteriori informazioni controllare i log.

source: Determines what message the bot replies with when someone tries to use a command that requires being identified or having a password and neither credential is correct.
fr: Détermine quel message le bot répondra lorsque quelqu'un utiliser une commande qui nécessite d'être identifié.
it: Determina con quale messagggio risponderà il bot quando si prova a utilizzare un comando per cui bisogna essere identificati, o ha una password, e le credenziali non sono corrette.

source: Determines what error message is given when the bot is telling someone they aren't cool enough to use the command they tried to use.
fr: Détermine quel message d'erreur est donné lorsqu'une personne tente d'utiliser une commande à laquelle il n'y pas accès.
it: Determina quale messaggio di errore fornire quando il bot dice a qualcuno di non avere accesso ad un certo comando.

source: This may be a bug. If you think it is, please file a bug report at <https://github.com/ProgVal/Limnoria/issues>.
fr: Ceci semble être un bug. Si vous pensez que c'en est un, veillez à envoyer un rapport de bug sur <http://github.com/ProgVal/Limnoria/issues>.
it: Questo sembra essere un bug. Se pensi lo sia, invia una segnalazione all'indirizzo <https://github.com/ProgVal/Limnoria/issues>.

source: A floating point number of seconds to throttle snarfed URLs, in order to prevent loops between two bots snarfing the same URLs and having the snarfed URL in the output of the snarf message.
fr: Un nombre à virgule flottante correspondant au temps (en secondes) à attendre avant de 'snarfer' la même URL, dans le but d'éviter que deux bots entrent ainsi en boucle infinie.
it: Un numero in virgola mobile corrispondente ai secondi di attesa prima di intercettare lo stesso URL, in modo da evitare che due bot entrino in un loop infinito intercettandosi a vicenda.

source: Supybot allows you to specify what brackets are used for your nested commands. Valid sets of brackets include [], <>, and {} (). [] has strong historical motivation, as well as being the brackets that don't require shift. <> or () might be slightly superior because they cannot occur in a nick. If this string is empty, nested commands will not be allowed in this channel.
fr: Supybot vous permet de spécifier quels crochets sont utilisés pour vos commandes imbriquées. Sont disponibles : [], <>, {}, et (). [] est très largement le plus utilisé, car leur utilisation est la plus simple pour des claviers qwerty. <> et () tirent leur avantage du fait qu'ils ne peuvent apparaître dans un nick. Si cette chaîne est vide, les commandes imbriquées ne seront pas autorisées sur ce canal.
it: Supybot permette di specificare quale tipo di parentesi utilizzare per i comandi nidificati; sono disponibili: [], <>, {} e (). [] hanno forti motivazioni storiche in quanto non necessitano l'uso di shift. <> o () sono leggermente migliori perché non utilizzabili in un nick. Se questa stringa è vuota i comandi nidificati non saranno permessi.

source: Determines what driver module the bot will use. Socket, a simple driver based on timeout sockets, is used by default because it's simple and stable. Twisted is very stable and simple, and if you've got Twisted installed, is probably your best bet.
fr: Détermine quel moteur réseau le bot utilisera. Socket, est un simple moteur basé sur des sockets bloquantes à timeout ; c'est celui utilisé par défaut. Twisted est très stable et simple, et, si vous avez Twisted installé, c'est probablement le meilleur choix.
it: Determina quale modulo per il driver di rete utilizzerà il bot. Socket, un driver semplice basato su timeout del socket e usato in modo predefinito per la sua stabilità. Twisted è molto stabile e semplice, se lo hai installato è probabilmente la scelta migliore.

source: Determines what plugins will be loaded.
fr: Détermine quels plugins seront chargés.
it: Determina quali plugin saranno caricati.

source: Determines what channel global (non-channel-specific) databases will be considered a part of. This is helpful if you've been running channel-specific for awhile and want to turn the databases for your primary channel into global databases. If supybot.databases.plugins.channelSpecific.link.allow prevents linking, the current channel will be used. Do note that the bot needs to be restarted immediately after changing this variable or your db plugins may not work for your channel.
fr: Détermine quelles bases de données de canaux seront considérées comme faisant partie de la base de données globale. Ceci est utile si vous utilisez une base de données spécifique à un canal depuis longtemps, et que vous voulez faire passer les bases de données de votre canal principal en bases de données globales. Si supybot.databases.plugins.channelSpecific.link.allow empêche la liaison, le canal courant sera utilisé. Notez que le bot doit être redémarré immédiatement après avoir changé cette variable ou vos plugins basés sur une base de données pourraient ne pas fonctionner.
it: Determina quali database specifici per un certo canale saranno considerati parte di uno globale. Utile se ne sono stati utilizzati di specifici per un certo periodo e li si vuole convertire. Se la variabile supybot.databases.plugins.channelSpecific.link.allow impedisce il collegamento verrà utilizzato il canale attuale. Nota che il bot va riavviato subito dopo la modifica di questa variabile altrimenti tali plugin potrebbero non funzionare.

source: Determines what will be used as the default banmask style.
fr: Détermine le style de masque de bannissement utilisé par défaut.
it: Determina il tipo di banmask utilizzata in modo predefinito.

source: Determines whether the bot will strictly follow the RFC; currently this only affects what strings are considered to be nicks. If you're using a server or a network that requires you to message a nick such as services@this.network.server then you you should set this to False.
fr: Détermine si le bot suivra strictement la RFC ; actuellement, cela n'affecte que les chaînes considérées comme des nicks. Si vous utilisez un serveur ou un réseau qui requiert que vous envoyiez un message à un nick tel queservices@this.network.server, vous devriez défini ceci à False.
it: Determina se il bot seguirà rigorosamente la RFC; attualmente riguarda solo quali stringhe siano considerate dei nick. Se utilizzi un server o una rete che richiede di inviare un messaggio a un nick nella forma "services@this.network.server", è necessario impostare questo valore a False.

source: Determines what vhost the bot will bind to before connecting to the IRC server.
fr: Détermine quelle vhost le bot bindera avant de se connecter au serveur IRC.
it: Determina quale vhost associare al bot prima di connettersi al server IRC.

source: Determines how many old messages the bot will keep around in its history. Changing this variable will not take effect until the bot is restarted.
fr: Détermine combien de vieux messages le bot gardera dans son historique. Changer cette variable ne prend effet qu'après avoir redémarré le bot.
it: Determina quanti messaggi vecchi terrà il bot nella cronologia. La modifica di questa variabile non avrà effetto finché non si riavvia il bot.

source: Determines what proxy all HTTP requests should go through. The value should be of the form 'host:port'.
fr: Détermine par quel proxy toutes les requêtes HTTP devraient passer. Cette valeur doit être de la forme 'host:port', ou être vide s'il n'y a pas de proxy.
it: Determina tramite quale proxy debbano passare le richieste HTTP. Il valore deve essere nella forma "host:porta".

source: Determines whether the bot will ignore unregistered users by default. Of course, that'll make it particularly hard for those users to register or identify with the bot, but that's your problem to solve.
fr: Détermine si le bot ignorera par défaut les personness qui ne sont pas enregistrés. Bien sûr, cela rendra très difficile pour les utilisateurs de s'enregistrer ou de s'identifier, mais c'est votre problème.
it: Determina se il bot ignorerà gli utenti non registrati in modo predefinito. Naturalmente renderà difficoltoso registrarsi o identificarsi, ma questo è un tuo problema.

source: A string that is the external IP of the bot. If this is the empty string, the bot will attempt to find out its IP dynamically (though sometimes that doesn't work, hence this variable).
fr: Une chaîne qui est une IP externe du bot. Si elle est vide, le bot recherchera cette IP dynamiquement (ce qui, parfois, ne marche pas ; dans ce cas, utilisez cette variable).
it: Una stringa equivalente all'IP esterno del bot. Se lasciata vuota, il bot tenterà di risolvere il suo IP dinamicamente (sebbene a volte non funzioni, ecco quindi lo scopo di questa variabile).

source: Supybot Web server index
fr: Index du serveur Web de Supybot
it: Indice del server web di Supybot

source: Sorry, that response was not an option.
fr: Désolé, cette réponse n'est pas l'une des options.
it: Spiacente, questa risposta non è un'opzione.

source: Value is not a valid Python string, not %r.
fr: La valeur doit être une chaîne Python valide, pas %r.

source: Determines what servers the bot will connect to for %s. Each will be tried in order, wrapping back to the first when the cycle is completed.
it: Determina a quali server si connetterà il bot per %s. Verranno provati in ordine tornando al primo quando il ciclo è stato completato.

source: Determines what channels the bot will join only on %s.
it: Determina in quali canali di %s entrerà il bot.

source: Determines whether the bot will always prefix theuser's nick to its reply to that user's command.
it: Determina se il bot userà sempre il nick dell'utente come prefisso della risposta al comando richiesto.

source: Determines what host the HTTP server will bind.
it: Determina a quale host si collegherà il server HTTP.

source: Determines the content of the robots.txt file, served on the server to search engine.
it: Determina il contenuto del file robots.txt, fornito dal server al motore di ricerca.
