Repository: progval/Limnoria
Catalog: locales/*.po
Languages: fr, it, ru

source: Determines whether the bot will allow users to unregister their users. This can wreak havoc with already-existing databases, so by default we don't allow it. Enable this at your own risk. (Do also note that this does not prevent the owner of the bot from using the unregister command.)
fr: Détermine si le bot autorisera les utilisateurs à se désenregistrer. Ceci peut provoquer des dégâts avec des bases de données déjà existantes, donc, nous ne l'autorisons pas par défaut. Activez ceci à vos risques et périls. (Notez également que ceci n'empêche pas le propriétaire du bot de se désenregistrer.)
it: Determina se il bot permetterà agli utenti di de-registrarsi. Ciò può causare danni ai database esistenti per cui non è permesso in modo predefinito; abilitalo a tuo rischio. Nota che questo non impedisce al proprietario del bot (owner) di utilizzare il comando "unregister".
ru: Определяет, будет ли бот позволять пользователям отменять свою регистрацию. Это может сломать уже существующие базы данных, поэтому по умолчанию мы не разрешаем это делать. Включите эту опцию на свой страх и риск. (Также обратите внимание, что это не мешает владельцу бота использовать команду unregister).

source: Determines what filename will be used for the ignores database. This file will go into the directory specified by the supybot.directories.conf variable.
fr: Détermine quel nom de fichier sera utilisé pour stocker la base de données d'ignorance. Ce fichiers ira dans le répertoire spécifié par la variable supybot.directories.conf.
it: Determina il nome del file utilizzato per il database degli ignore che finirà nella directory specificata dalla variabile supybot.directories.conf.
ru: Определяет, какое имя файла будет использоваться для базы данных игноров. Этот файл будет находиться в каталоге, указанном в supybot.directories.conf.

source: Determines what filename will be used for the channels database. This file will go into the directory specified by the supybot.directories.conf variable.
fr: Détermine quel nom de fichier sera utilisé pour stocker la base de données de canaux. Ce fichiers ira dans le répertoire spécifié par la variable supybot.directories.conf.
it: Determina il nome del file utilizzato per il database dei canali che finirà nella directory specificata dalla variabile supybot.directories.conf.
ru: Определяет, какое имя файла будет использоваться для базы данных каналов. Этот файл будет находиться в каталоге, указанном в supybot.directories.conf.

source: Determines what filename will be used for the networks database. This file will go into the directory specified by the supybot.directories.conf variable.
ru: Определяет, какое имя файла будет использоваться для базы данных сетей. Этот файл будет находиться в каталоге, указанном в supybot.directories.conf.

source: Determines whether the bot will require user registration to use 'add' commands in database-based Supybot plugins.
ru: Определяет, будет ли бот требовать регистрации пользователя для использования команд 'add' в плагинах Supybot, основанных на базах данных.

source: Determines whether database-based plugins that can be channel-specific will be so. This can be overridden by individual channels. Do note that the bot needs to be restarted immediately after changing this variable or your db plugins may not work for your channel; also note that you may wish to set supybot.databases.plugins.channelSpecific.link appropriately if you wish to share a certain channel's databases globally.
fr: Détermine si des plugins basés sur une base de données peuvent être spécifiques à un canal. Ceci peut être surchargé pour chaque canal. Notez que le bot doit être redémarré immédiatement après avoir changé cette variable, ou vos plugins basés sur une base de données pourraient ne pas marcher pour votre canal ; notez également qui vous pouvez vouloir définir supybot.databases.plugins.channelSpecific.link de manière appropriée si vous voulez partager les bases de données de certains canaux.
it: Determina se i plugin che utilizzano un database possano essere specifici per un certo canale; ciò è sostituibile per ogni canale. Nota che il bot va riavviato subito dopo la modifica di questa variabile altrimenti tali plugin potrebbero non funzionare; se desideri condividere il database di un certo canale a livello globale è inoltre possibile impostare la variabile supybot.databases.plugins.channelSpecific.link in modo appropriato.
ru: Определяет, будут ли плагины на основе баз данных могут быть привязаны к конкретному каналу. Это может быть переопределено отдельными каналами. Обратите внимание, что бота необходимо перезапустить сразу после изменения этой переменной, иначе плагины с базами данных могут не работать на вашем канале; также обратите внимание, что вы можете установить supybot.databases.plugins.channelSpecific.link соответствующим образом, если вы хотите использовать базы данных определенного канала глобально.

source: Determines whether another channel's global (non-channel-specific) databases will be allowed to link to this channel's databases. Do note that the bot needs to be restarted immediately after changing this variable or your db plugins may not work for your channel.
fr: Détermine si les bases de données globales d'un autre canal peuvent êtres liées à celles de ce canal. Notez que le bot doit être redémarré immédiatement après avoir changé cette variable ou vos plugins basés sur une base de données pourraient ne pas marcher pour votre canal.
it: Determina se i database globali di un altro canale possano essere collegati a quelli di questo canale. Nota che il bot va riavviato subito dopo la modifica di questa variabile altrimenti tali plugin potrebbero non funzionare.
ru: Определяет, будут ли глобальные (не специфичные для канала) базы данных другого канала разрешены для связи с базами данных этого канала. Обратите внимание, что бот должен быть перезапущен сразу после изменения этой переменной, иначе ваши БД-плагины могут не работать на вашем канале.

source: Determines whether CDB databases will be allowed as a database implementation.
fr: Détermine si les bases de données CDB seront autorisées comme implémentation de base de données.
it: Determina se i database CDB sono permessi come implementazione di un database.
ru: Определяет, будут ли разрешены базы данных CDB в качестве реализации баз данных.

source: Determines how often CDB databases will have their modifications flushed to disk. When the number of modified records is greater than this fraction of the total number of records, the database will be entirely flushed to disk.
fr: Détermine la fréquence de sauvegarde des bases de données CDB sur le disque. Lorsque le nombre d'enregistrements modifiés est plus grand que le nombre d'enregistrements non modifiés, la base de données sera entièrement enregistrée sur le disque.
it: Determina la frequenza di salvataggio su disco delle modifiche dei databases CDB. Quando il numero di dati modificati è più grande di quelli non modificati il database verrà interamente scritto sul disco.
ru: Определяет, как часто изменения баз данных CDB будут сбрасываться на диск. Когда число измененных записей превышает эту долю от общего числа записей, база данных будет полностью сброшена на диск.

source: Determines whether the bot will strictly follow the RFC; currently this only affects what strings are considered to be nicks. If you're using a server or a network that requires you to message a nick such as services@this.network.server then you you should set this to False.
ru: Определяет, будет ли бот строго следовать RFC; в настоящее время это влияет только на то, какие строки считаются никами. Если вы используете сервер или сеть, которая требует от вас сообщения с таким ником, как services@this.network.server, то вам следует установить значение False.

source: Determines whether the bot will enable draft/experimental extensions of the IRC protocol. Setting this to True may break your bot at any time without warning and/or break your configuration irreversibly. So keep it False unless you know what you are doing.
ru: Определяет, будет ли бот включать черновые/экспериментальные расширения протокола IRC. Установка этого значения в True может привести к поломке вашего бота в любое время без предупреждения и/или необратимо нарушить ваши настройки. Поэтому держите значение в False, если вы не знаете, что делаете.

source: Determines what certificate file (if any) the bot will use connect with SSL sockets by default.
ru: Определяет, какой файл сертификата (если таковой есть) бот будет использовать для соединения с SSL-сокетами по умолчанию.

source: Determines what user modes the bot will request from the server when it first connects. Many people might choose +i; some networks allow +x, which indicates to the auth services on those networks that you should be given a fake host.
fr: Détermine quels modes d'utilisateur le bot demandera au serveur lorsqu'il s'y connecte. Certaines personnes voudront le +i ; certains réseaux autorisent +x, ce qui indique aux services du réseau que l'on veut 'cloaker' (masquer) notre masque d'hôte.
it: Determina quali modalità utente (mode) il bot chiederà al server quando si connette. Molti utenti vorranno +i mentre per altre reti è +x, indica ai servizi che si desidera avere l'hostmask camuffata (vhost) o parzialmente crittata.
ru: Определяет, какие режимы пользователя бот будет запрашивать у сервера при первом подключении. Многие люди могут выбрать +i; некоторые сети разрешают +x, указывающий службам аутентификации в этих сетях, что вам должен быть предоставлен фальшивый хост.

source: Determines what vhost the bot will bind to before connecting a server (IRC, HTTP, ...) via IPv4.
ru: Определяет, к какому виртуальному хосту будет привязан бот перед подключением к серверу (IRC, HTTP, ...) через IPv4.

source: Determines what vhost the bot will bind to before connecting a server (IRC, HTTP, ...) via IPv6.
ru: Определяет, к какому виртуальному хосту будет привязан бот перед подключением к серверу (IRC, HTTP, ...) через IPv6.

source: Determines how many old messages the bot will keep around in its history. Changing this variable will not take effect on a network until it is reconnected.
ru: Определяет, сколько старых сообщений бот будет сохранять в своей истории. Изменение этой переменной не будет действовать в сети до тех пор, пока к ней не будет выполнено переподключение.

source: A floating point number of seconds to throttle queued messages -- that is, messages will not be sent faster than once per throttleTime seconds.
fr: Un nombre à virgule flottante, correspondant à la mise en attente des messages à envoyé ; c'est à dire que les messages ne seront pas envoyé plus vite que 1 par throttleTime secondes.
it: Un numero in virgola mobile corrispondente ai secondi di attesa prima di inviare i messaggi in coda; vale a dire che verranno inviati una volta ogni numero di secondi specificati.
ru: Дробное число секунд для регулирования сообщений в очереди, то есть сообщения не будут отправляться быстрее, чем один раз за throttleTime секунд.

source: Determines whether the bot will send PINGs to the server it's connected to in order to keep the connection alive and discover earlier when it breaks. Really, this option only exists for debugging purposes: you always should make it True unless you're testing some strange server issues.
fr: Détermine si le bot enverra des PINGs au serveurs auxquels il est connecté dans le but de garder la connexion active et détecter plus tôt lorsqu'elle est rompue. En fait, cette option existe surtout pour le débogage : vous devriez toujours laisser cette option à True excepté si il vous arrive des trucs bizarres avec le serveur.
it: Determina se il bot invierà PING al server sul quale è connesso per mantenere attiva la connessione e diagnosticare in tempo se c'è un'interruzione. In realtà questa opzione esiste solo per scopi di debug, a meno che non si incontrino problemi strani con il server, andrebbe sempre tenuta a True.
ru: Определяет, будет ли бот посылать PING'и на сервер, к которому он подключен, чтобы сохранить соединение и обнаружить его разрыв раньше, чем оно потеряется. На самом деле, эта опция существует только в целях отладки: вы всегда должны ставить его в True, если только вы не исследуете (тестируете) загадочные проблемы с сервером.

source: Determines the number of seconds between sending pings to the server, if pings are being sent to the server.
fr: Détermine le nombre de secondes entre deux envois de PING au serveur, si les pings sont envoyés au serveur.
it: Determina il numero di secondi tra ogni invio di PING al server, se questo avviene.
ru: Определяет количество секунд между отправкой пингов на сервер, если таковые отправляются на сервер.

source: Determines whether the bot will refuse duplicated messages to be queued for delivery to the server. This is a safety mechanism put in place to prevent plugins from sending the same message multiple times; most of the time it doesn't matter, unless you're doing certain kinds of plugin hacking.
fr: Détermine si le bot refusera de dupliquer les messages à mettre dans la queue d'envoi un serveur. C'est un mécanisme de sécurité mis en place pour éviter que les plugins envoient le même message plusieurs fois ; la plupart du temps, vous n'avez pas à vous en préoccuper, à moins que vous ne bidouilliez des plugins.
it: Determina se il bot rifiuterà di accodare messaggi doppi da spedire al server. Questo è un meccanismo di sicurezza per evitare che i plugin inviino più volte lo stesso messaggio; il più delle volte non ha importanza, tranne che non si facciano delle modifiche ai plugin.
ru: Определяет, будет ли бот отклонять дублирующиеся сообщения в очереди на отправку на сервер. Это механизм безопасности, созданный для того, чтобы плагины не отправляли одно и то же сообщение несколько раз; в большинстве случаев это не имеет значения, если только вы не занимаетесь экспериментальной разработкой плагинов.

source: Determines how many seconds must elapse between JOINs sent to the server.
fr: Détermine combien de secondes doivent s'écouler entre deux envois de JOIN au serveur.
it: Determina quanti secondi debbano trascorrere tra un invio di JOIN e l'altro.
ru: Определяет, сколько секунд должно пройти между JOIN, отправленными на сервер.

source: Determines how many bytes the bot will 'peek' at when looking through a URL for a doctype or title or something similar. It'll give up after it reads this many bytes, even if it hasn't found what it was looking for.
fr: Détermine combien d'octets le bot 'regarder' lorsqu'il cherchera le doctype, le title, ou autre chose dans une URL. Après avoir lu ces octets, le bot abandonnera sa recherche.
it: Determina il numero di byte entro i quali il bot "sbircierà" cercando il doctype, il title o altri tag HTML simili in un URL. Abbandonerà la ricerca dopo aver letto questa quantità di byte, anche se non trova quel che stava cercando.
ru: Определяет, сколько байт будет просматривать бот при открытии URL-адреса в поисках типа документа, заголовка или чего-то подобного. Он сдастся после того, как прочитает указанное количество байт, даже если не нашел того, что искал.

source: Determines what HTTP proxy all HTTP requests should go through. The value should be of the form 'host:port'.
ru: Определяет, через какой HTTP-прокси должны проходить все HTTP-запросы. Значение должно иметь вид 'host:port'.

source: If set, the Accept-Language HTTP header will be set to this value for requests. Useful for overriding the auto-detected language based on the server's location.
ru: Если задано, то в HTTP-заголовке Accept-Language для запросов будет использоваться это значение. Полезно для переопределения автоматически определяемого языка на основе местоположения сервера.

source: If set, the User-Agent HTTP header will be set to a randomly selected value from this comma-separated list of strings for requests.
ru: Если определено, то в HTTP-заголовке User-Agent для запросов будет установлено случайно выбранное значение из этого списка строк, разделенных запятыми.

source: Determines whether server certificates will be verified, which checks whether the server certificate is signed by a known certificate authority, and aborts the connection if it is not. This is assumed to be True of serverFingerprints or authorityCertificate is set.
ru: Определяет, будут ли проверяться сертификаты сервера. При этом выявляется, подписан ли сертификат сервера известным удостоверяющим центром, и соединение будет прервано, если это не так. Предполагается, что если эта настройка установлена в true, то также определены serverFingerprints или authorityCertificate.

source: If true, uses IPV6_V6ONLY to disable forwaring of IPv4 traffic to IPv6 sockets. On *nix, has the same effect as setting kernel variable net.ipv6.bindv6only to 1.
ru: Если true, то будет использоваться IPV6_V6ONLY для отключения пересылки IPv4-трафика на IPv6-сокеты. На *nix имеет тот же эффект, что и установка переменной ядра net.ipv6.bindv6only в 1.

source: Space-separated list of IPv4 hosts the HTTP server will bind.
fr: Liste d'adresses IPv4 séparées par des espaces que le serveur HTTP va « binder ».
ru: Список IPv4-хостов, разделенных пробелами, к которым будет привязан HTTP-сервер.

source: Space-separated list of IPv6 hosts the HTTP server will bind.
fr: Liste d'adresses IPv6 séparées par des espaces que le serveur HTTP va « binder ».
ru: Список IPv6-хостов, разделенных пробелами, к которым будет привязан HTTP-сервер.

source: Determines what port the HTTP server will bind.
fr: Détermine à quel port le serveur HTTP va s'attacher.
it: Determina a quale porta si collegherà il server HTTP.
ru: Определяет, к какому порту будет привязан HTTP-сервер.

source: Determines whether the server will stay alive if no plugin is using it. This also means that the server will start even if it is not used.
fr: Détermine si le serveur restera lancé si aucun plugin ne l'utilise. Cela signifie également que le serveur va démarrer même si il n'est pas utilisé.
it: Definisce se il server rimarrà in esecuzione se nessun plugin lo utilizza. Ciò significa che verrà avviato anche se non utilizzato.
ru: Определяет, будет ли сервер оставаться запущенным, если ни один плагин его не использует. Это также означает, что сервер будет запущен, даже если он не используется.

source: Determines the path of the file served as favicon to browsers.
fr: Détermine le chemin du fichier servi comme favicon aux navigateurs.
ru: Определяет путь к файлу, передаваемому браузерам в качестве favicon.

source: Determines the public URL of the server. By default it is http://<hostname>:<port>/, but you will want to change this if there is a reverse proxy (nginx, apache, ...) in front of the bot.
ru: Определяет публичный URL-адрес сервера. По умолчанию это http://<hostname>:<port>/, но вы захотите изменить, если перед ботом стоит обратный прокси (nginx, apache, ...).

source: Determines whether the bot will ignore unidentified users by default. Of course, that'll make it particularly hard for those users to register or identify with the bot without adding their hostmasks, but that's your problem to solve.
ru: Определяет, будет ли бот по умолчанию игнорировать неидентифицированных пользователей. Конечно, это сделает особенно сложным регистрацию или идентификацию этих пользователей в боте без добавления их масок хоста, но это уже ваша проблема.

source: A string that is the external IP of the bot. If this is the empty string, the bot will attempt to find out its IP dynamically (though sometimes that doesn't work, hence this variable). This variable is not used by Limnoria and its built-in plugins: see supybot.protocols.irc.vhost / supybot.protocols.irc.vhost6 to set the IRC bind host, and supybot.servers.http.hosts4 / supybot.servers.http.hosts6 to set the HTTP server bind host.
ru: Строка, которая является внешним IP-адресом бота. Если это пустая строка, бот попытается узнать свой IP динамически (хотя иногда это не работает, отсюда и эта переменная). Эта переменная не используется Limnoria и ее встроенными плагинами: см. supybot.protocols.irc.vhost / supybot.protocols.irc.vhost6 для установки хоста IRC, и supybot.servers.http.hosts4 / supybot.servers.http.hosts6 для установки хоста HTTP-сервера.

source: Determines what the default timeout for socket objects will be. This means that *all* sockets will timeout when this many seconds has gone by (unless otherwise modified by the author of the code that uses the sockets).
fr: Détermine quel timeout est utilisé par défaut pour les sockets. Ceci signifie que *toutes* les sockets expireront au bout de cette durée (à moins que l'auteur du code n'ait changé cette valeur).
it: Determina il timeout predefinito per i socket. Ciò significa che *tutti* i socket scadranno dopo questo periodo (a meno che l'utore del codice ne abbia modificato il valore).
ru: Определяет время ожидания по умолчанию для сокетов. Это означает, что *все* сокеты будут отключаться по истечении указанного количества секунд (если это поведение не изменено автором кода, использующего сокеты).

source: Determines what file the bot should write its PID (Process ID) to, so you can kill it more easily. If it's left unset (as is the default) then no PID file will be written. A restart is required for changes to this variable to take effect.
fr: Détermine dans quel fichier le bot écrit son PID (Process ID), ce qui vous permet de le killer plus facilement. Si cette valeur est laissée vide, le PID ne sera écrit dans aucun fichier. Un redémarrage est requis pour que cette variable prenne effet.
it: Determina in quale file il bot salverà il suo PID (Process ID) in modo che si possa terminare più facilmente. Se non impostata, il PID non verrà scritto in nessun file. Perché le modifiche a questa variabile abbiano effetto è necessario un riavvio.
ru: Определяет, в какой файл бот должен записывать свой PID (Process ID), чтобы завершить его было проще. Если переменная не установлена (как и происходит по умолчанию), то PID-файл записываться не будет. Чтобы изменения в этой переменной вступили в силу, потребуется перезагрузка.

source: Determines whether the bot will automatically thread all commands.
fr: Détermine si le bot threadera automatiquement toutes les commandes.
it: Determina se il bot userà i thread per tutti i comandi.
ru: Определяет, будет ли бот автоматически выполнять все команды в отдельных потоках.

source: Determines whether the bot will automatically flush all flushers *very* often. Useful for debugging when you don't know what's breaking or when, but think that it might be logged.
fr: Détermine si le bot videra automatiquement le cache *très* souvent. Utile pour déboguer lorsque vous ne savez pas ce qui ne marche pas, mais que vous pensez que ça peut être loggué.
it: Determina se il bot eseguirà tutte le operazioni di mantenimento (flush) *molto* spesso. Utile per fare il debug quando non si sa cosa non funziona o quando si ritiene necessario tenerlo sotto controllo.
ru: Определяет, будет ли бот автоматически очищать память *очень* часто. Полезно для отладки, когда вы не знаете, что и когда ломается, но думаете, что это может быть занесено в журнал.

source: Here is a list of the plugins that have a Web interface:
fr: Voici une liste des plugins qui ont une interface Web :
it: Ecco un elenco dei plugin che hanno un'interfaccia web:
ru: Вот список плагинов, имеющих веб-интерфейс:
