Repository: progval/Limnoria
Catalog: locales/*.po
Languages: fr, it, ru

source: Format used by generic database plugins (Lart, Dunno, Prase, Success, Quote, ...) to show an entry. You can use the following variables: $type/$types/$Type/$Types (plugin name and variants), $id, $text, $at (creation time), $userid/$username/$nick (author).
ru: Формат, используемый плагинами с генерируемыми базами данных, (Lart, Dunno, Prase, Success, Quote) для показа записей. Вы можете использовать следующие поля: $type/$types/$Type/$Types (название плагина и его варианты), $id, $text, $at (время создания), $userid/$username/$nick (автор).

source: Determines the number of seconds between running the upkeep function that flushes (commits) open databases, collects garbage, and records some useful statistics at the debugging level.
fr: Détermine le nombre de secondes entre deux exécutions de la fonction upkeep, qui rafraichit les bases de données ouvertes, vide le cache, et enregistre des statistiques utiles pour le débogage.
it: Determina il numero di secondi tra ogni operazione di mantenimento (flush) che aggiorna i database, svuota la cache e registra le statistiche utili per il debug.
ru: Определяет количество секунд между запусками функции поддержки, которая записывает открытые базы данных, собирает мусор и журналирует некоторую полезную статистику на отладочном уровне.

source: Determines whether the bot will periodically flush data and configuration files to disk. Generally, the only time you'll want to set this to False is when you want to modify those configuration files by hand and don't want the bot to flush its current version over your modifications. Do note that if you change this to False inside the bot, your changes won't be flushed. To make this change permanent, you must edit the registry yourself.
fr: Détermine si le bot rafraichira périodiquement les fichiers de données et de configuration sur le disque. Générallement, on ne défini ceci à False que lorsque l'on veut modifier ces fichiers de configuration à la main, et que l'on ne veut pas que le bot supprime les modifications en écrivant par-dessus. Notez que si vous définissez ceci à False, les changements apportés aux fichiers n'auront pas pour autant une influence sur le bot. Si vous voulez rendre ce changement définitif, vous devez éditer le registre vous-même.
it: Determina se il bot salverà periodicamente su disco i dati e le configurazioni. In genere l'unica occasione per impostarlo a False è quando si vuole modificare i file manualmente ed evitare che il bot salvi invece i dati che ha in memoria; se imposti il valore a False tramite il bot i cambiamenti non verranno salvati. Se vuoi che questa modifica sia permanente devi modificare il registro a mano.
ru: Определяет, будет ли бот периодически записывать данные и файлы настроек на диск. Как правило, вы захотите установить это значение в False, если вам нужно изменять настройки вручную без помех со стороны бота, записывающего свои настройки поверх ваших изменений. Однако, если вы вы измените это значение в False в самом боте, то вам придётся изменить конфиг самостоятельно, чтобы сделать это изменения постоянным.

source: Determines what characters are valid for quoting arguments to commands in order to prevent them from being tokenized.
fr: Détermine quels caractères sont valides pour citer des arguments à des commandes, pour leur éviter d'être tokénisés.
it: Determina quali caratteri siano validi per citare gli argomenti dei comandi , ed evitare che vengano tokenizzati.
ru: Определяет, какие символы допустимы для изолирования аргументов команд, чтобы предотвратить их токенизацию.

source: Determines whether the bot will allow nested commands, which rule. You definitely should keep this on.
fr: Détermine si le bot autorisera les commandes commandes imbriquées sur ce bot, ce qui est une fonctionnalité génial. Vous devriez vraiment garder ceci actif.
it: Determina se il bot permetterà comandi nidificati. È un'ottima funzionalità, devi assolutamente tenerla attiva.
ru: Определяет, будет ли бот разрешать использование вложенных команд. Это определённо стоит оставить включённым.

source: Determines what the maximum number of nested commands will be; users will receive an error if they attempt commands more nested than this.
fr: Détermine le nombre maximum de commandes imbriquées ; les utilisateurs recevront une erreur si ils ou elles tentent d'en mettre plus.
it: Determina il numero massimo di comandi nidificati. Se gli utenti tentano di utilizzarne di più, riceveranno un errore.
ru: Определяет максимальное количество вложенных команд. Пользователи получат сообщение об ошибке, если попытаются выполнить больше вложенных команд, чем в этой настройке.

source: Supybot allows you to specify what brackets are used for your nested commands. Valid sets of brackets include [], <>, {}, and (). [] has strong historical motivation, but <> or () might be slightly superior because they cannot occur in a nick. If this string is empty, nested commands will not be allowed in this channel.
ru: Supybot позволяет вам указать, какие именно скобки будут использоваться для указания вложенных команд. Допустимые наборы скобок включают [], <>, {} и (). [] имеет историческое значение, но <> или () могут быть лучше, так как они не могут использоваться в никах. Если эта строка пуста, то в этом канале вложенные команды будут запрещены.

source: Supybot allows nested commands. Enabling this option will allow nested commands with a syntax similar to UNIX pipes, for example: 'bot: foo | bar'.
fr: Supybot permet les commandes imbriquées. Activer cette option permettra aux commandes imbriquées d'utiliser une syntaxe similaire aux 'pipes' UNIX, par exemple : 'bot: foo | bar'.
it: Supybot permette i comandi nidificati. Abilitare questa opzione ne permetterà l'uso con una sintassi simile alle pipe UNIX, ad esempio: 'bot: foo | bar'.
ru: Supybot поддерживает вложенные команды. Включение этой настройки позволит вам использовать команды с синтаксисом, похожим на конвейеры UNIX, например: 'bot: foo | bar'.

source: Determines what commands have default plugins set, and which plugins are set to be the default for each of those commands.
fr: Détermine, lorsque l'on appelle une commande appartenant à plusieurs plugins, lequel sera choisi par défaut pour chacune de ces commandes.
it: Determina, quando un comando è presente in più di un plugin, quale sarà utilizzato in modo predefinito per ciascuno di questi comandi.
ru: Определяет, для каких команд установлены плагины по умолчанию, и какие плагины будут установлены по умолчанию для каждой из этих команд.

source: Determines what plugins automatically get precedence over all other plugins when selecting a default plugin for a command. By default, this includes the standard loaded plugins. You probably shouldn't change this if you don't know what you're doing; if you do know what you're doing, then also know that this set is case-sensitive.
fr: Détermine quels plugins sont prioritaires sur tous les autres lorsque l'on recherche le plugin par défaut d'une commande. Par défaut, cela inclu les plugins standards chargés. Vous ne devriez probablement pas changer ceci, à moins de savoir ce que vous faites ; si vous savez ce que vous faites, sachez que les noms de plugins sont sensibles à la classe.
it: Determina quali plugin abbiano la precedenza su tutti gli altri quando se ne seleziona uno predefinito per un certo comando; di default questo include i plugin standard caricati. A meno che tu non sappia cosa fare, è probabile tu non voglia modificare questo comportamento; in caso contrario sappi anche che i nomi sono case sensitive.
ru: Определяет приоритет плагинов над другими при выборе плагина по умолчанию для команды. По умолчанию включает в себя стандартные загружаемые плагины. Не стоит менять это, если вы не знаете, что пытаетесь сделать. Иначе учитывайте, что эта настройка чувствительна к регистру.

source: Allows this bot's owner user to use commands that grants them shell access. This config variable exists in case you want to prevent MITM from the IRC network itself (vulnerable IRCd or IRCops) from gaining shell access to the bot's server by impersonating the owner. Setting this to False also disables plugins and commands that can be used to indirectly gain shell access.
ru: Позволяет владельцу бота использовать команды, предоставляющие доступ к командной строке. Эта настройка существует на случай, если вы хотите предотвратить MITM-атаку из самой IRC-сети (уязвимость IRCd или IRCops) для получения доступа к командной строке сервера бота, выдавая себя за владельца. Установка значения в False также отключит плагины и команды, которые могут быть использованы для получения доступа к командной строке.

source: Determines the interval used for the history storage.
fr: Détermine l’intervalle utilisé pour le stockage de l’historique.
ru: Определяет интервал для хранения истории.

source: Determines whether the bot will defend itself against command-flooding.
fr: Détermine si le bot se défendra contre les attaques par flood de commandes.
it: Determina se il bot si difenderà dall'uso di troppi comandi alla volta (flood).
ru: Определяет, будет ли бот защищать себя от массовой отправки команд.

source: Determines how many commands users are allowed per minute. If a user sends more than this many commands in any 60 second period, they will be ignored for supybot.abuse.flood.command.punishment seconds.
fr: Détermine le nombre maximum de commandes qu'une personne peut envoyer en une minute. Si une personne dépasse cette limite, elle sera ignoré supybot.abuse.flood.command.punishment secondes.
it: Determina quanti comandi al minuto permettere agli utenti. Se qualcuno supera questo valore verrà ignorato per il numero di secondi definito nella variabile supybot.abuse.flood.command.punishment.
ru: Определяет, сколько команд в минуту разрешено отправлять пользователям. Если пользователь отправит больше указанного количества команд за 60 секунд, то их будут игнорировать в течение некоторого количества секунд, указанного в supybot.abuse.flood.command.punishment.

source: Determines how many seconds the bot will ignore users who flood it with commands.
fr: Détermine combien de secondes le bot ignorera les personnes qui le floodent de commandes.
it: Determina per quanti secondi il bot ignorerà un utente che abusa dei comandi (flood).
ru: Определяет количество секунд, в течение которых бот будет игнорировать пользователей, засыпающих его командами.

source: Determines whether the bot will notify people that they're being ignored for command flooding.
ru: Определяет, будет ли бот уведомлять пользователей о том, что их игнорируют из-за слишком большого количества отправленных ими команд.

source: Determines whether the bot will defend itself against invalid command-flooding.
fr: Détermine si le bot se défendra contre le flood de commandes invalides.
it: Determina se il bot si difenderà dall'uso di troppi comandi non validi alla volta (flood).
ru: Определяет, будет ли бот защищать себя от массовой отправки ему недопустимых команд.

source: Determines how many invalid commands users are allowed per minute. If a user sends more than this many invalid commands in any 60 second period, they will be ignored for supybot.abuse.flood.command.invalid.punishment seconds. Typically, this value is lower than supybot.abuse.flood.command.maximum, since it's far less likely (and far more annoying) for users to flood with invalid commands than for them to flood with valid commands.
fr: Détermine le nombre maximum de commandes invalies qu'une personne peut envoyer en une minute. Si une personne dépasse cette limite, elle sera ignoré supybot.abuse.flood.command.invalid.punishment secondes. Typiquement, cette valeur est plus petite que value is lower than supybot.abuse.flood.command.maximum, car il est plus probable que les personnes floodent avec des commandes invalides qu'avec des commandes valides.
it: Determina quanti comandi non validi al minuto permettere agli utenti. Se qualcuno supera questo valore verrà ignorato per il numero di secondi definito nella variabile supybot.abuse.flood.command.invalid.punishment. Solitamente questo valore è inferiore a quello di supybot.abuse.flood.command.maximum, in quanto è meno probabile che un utente abusi di comandi non validi piuttosto che di quelli validi.
ru: Определяет, сколько пользователи могут отправить недопустимых команд в минуту. Если пользователь отправляет больше этого количества недопустимых команд в любой 60-секундный период, они будут игнорироваться на протяжении supybot.abuse.flood.command.invalid.punishment секунд. Обычно это значение ниже, чем supybot.abuse.flood.command.maximum, поскольку гораздо менее вероятно (но гораздо более раздражающе), что пользователи будут засорять каналы недопустимыми командами, чем правильными командами.

source: Determines how many seconds the bot will ignore users who flood it with invalid commands. Typically, this value is higher than supybot.abuse.flood.command.punishment, since it's far less likely (and far more annoying) for users to flood with invalid commands than for them to flood with valid commands.
fr: Détermine combien de secondes le bot ignorera les personnes qui le floodent de commandes invalides. Typiquement,cette valeur est plus grande que value is lower than supybot.abuse.flood.command.punishment, car il est plus probable que les personnes floodent avec des commandes invalides qu'avec des commandes valides.
it: Determina per quanti secondi il bot ignorerà un utente che abusa di comandi non validi (flood). Solitamente questo valore è superiore a quello di supybot.abuse.flood.command.punishment, in quanto è meno probabile che un utente abusi di comandi non validi piuttosto che di quelli validi.
ru: Определяет, сколько пользователи могут отправить недопустимых команд в минуту. Обычно это значение ниже, чем supybot.abuse.flood.command.maximum, поскольку гораздо менее вероятно (но гораздо более раздражающе), что пользователи будут засорять каналы недопустимыми командами, чем правильными командами.

source: Determines whether the bot will notify people that they're being ignored for invalid command flooding.
fr: Détermine si le bot notifiera les personnes lorsqu'elles se font ignorer pour flood de commande.
it: Determina se il bot avvertirà l'utente che è stato ignorato per abuso di comandi non validi (flood).
ru: Определяет, будет ли бот уведомлять пользователей о том, что их игнорируют из-за слишком большого количества отправленных ими команд.

source: Determines the default length of time a driver should block waiting for input.
fr: Détermine la durée par défaut durant laquelle un moteur réseau peut être bloquant, en attente de données entrantes.
it: Determina la quantità di tempo predefinita durante il quale un driver di rete debba bloccarsi in attesa dei dati in entrata.
ru: Определяет продолжительность времени по умолчанию, в течение которой драйвер должен блокироваться в ожидании ввода.

source: Determines what driver module the bot will use. Current, the only (and default) driver is Socket.
ru: Определяет, какой модуль драйвера будет использовать бот. Текущим и единственным (и по умолчанию) драйвером является Socket.

source: Determines the maximum time the bot will wait before attempting to reconnect to an IRC server. The bot may, of course, reconnect earlier if possible.
fr: Détermine le temps maximum durant lequel le bot attendra avant de se reconnecter à un serveur IRC. Le bot peut, bien sûr, se reconnecter plus tôt, si c'est possible.
it: Determina il tempo massimo che il bot attenderà prima di riconnettersi al server IRC. Se ne avrà la possibilità potrà comunque connettersi prima.
ru: Определяет максимальное время, которое бот будет ждать перед попыткой переподключения к IRC-серверу. Конечно, бот может переподключиться раньше, если это возможно.

source: Determines what directory configuration data is put into.
fr: Détermine dans quel répertoire les données de configuration sont.
it: Determina in quale directory collocare i dati di configurazione.
ru: Определяет, в какой каталог помещаются данные настроек.

source: Determines what directory data is put into.
fr: Détermine dans quel répertoire les données sont.
it: Determina in quale directory collocare i dati.
ru: Определяет, в какой каталог помещаются данные.

source: Determines what directory backup data is put into. Set it to /dev/null to disable backup (it is a special value, so it also works on Windows and systems without /dev/null).
fr: Détermine dans quel dossier les sauvegardes seront effectuées. Définissez cette variable à /dev/null pour désactiver la sauvegarde (c'est une valeur spéciale, donc elle marchera également sur Windows et les systèmes qui n'ont pas de /dev/null).
it: Determina in quale directory collocare i dati di backup. Impostare il valore a /dev/null per disabilitarlo (è un valore speciale che funziona anche su Windows e sistemi privi di questo device).
ru: Определяет, в какой каталог помещаются данные резервной копии. Установите его в /dev/null, чтобы отключить резервное копирование (это специальное значение, поэтому оно также работает на Windows и системах без /dev/null).

source: Determines what directory temporary files are put into.
fr: Détermine dans quel répertoire les fichiers temporaires sont.
it: Determina in quale directory collocare i file temporanei.
ru: Определяет, в какой каталог будут помещены временные файлы.

source: Determines what directory files of the web server (templates, custom images, ...) are put into.
fr: Détermine dans quel répertoire seront les fichiers du serveur web (templates, images personnalisées, ...).
ru: Определяет, в какую директорию будут помещены файлы веб-сервера (шаблоны, пользовательские изображения, ...).

source: Determines what directories the bot will look for plugins in. Accepts a comma-separated list of strings. This means that to add another directory, you can nest the former value and add a new one. E.g. you can say: bot: 'config supybot.directories.plugins [config supybot.directories.plugins], newPluginDirectory'.
fr: Détermine dans quel répertoire le bot recherchera les plugins. Accepte une liste de chaînes séparées par des virgules. Ce qui signifie que si vous voulez ajouter un autre répertoire, vous pouvez imbriquer la forme actuelle la nouvelle. Par exemple, vous pouvez dire : 'config supybot.directories.plugins [config supybot.directories.plugins], nouveauRepertoireDePlugins'.
it: Determina in quali directory il bot cercherà i plugin. Accetta un elenco di valori separati da virgola; ciò significa che se si vuole aggiungere un'altra directory è possibile nidificare il valore precedente e inserirne uno nuovo. Esempio: "config supybot.directories.plugins [config supybot.directories.plugins], nuovaDirectory".
ru: Определяет, в каких каталогах бот будет искать плагины. Принимает список строк, разделенных запятыми. Это означает, что для добавления другой директории вы можете вложить предыдущее значение и добавить новое. Например, вы можете сделать так: bot: 'config supybot.directories.plugins [config supybot.directories.plugins], newPluginDirectory'.

source: List of all plugins that were ever loaded. Currently has no effect whatsoever. You probably want to use the 'load' or 'unload' commands, or edit supybot.plugins.<pluginname> instead of this.
ru: Список всех плагинов, которые были когда-либо загружены. В настоящее время не имеет никакого эффекта. Вы, вероятно, захотите использовать команды 'load' или 'unload', или изменить supybot.plugins.<pluginname> вместо этого.

source: Determines whether the bot will always load important plugins (Admin, Channel, Config, Misc, Owner, and User) regardless of what their configured state is. Generally, if these plugins are configured not to load, you didn't do it on purpose, and you still want them to load. Users who don't want to load these plugins are smart enough to change the value of this variable appropriately :)
fr: Détermine si le bot chargera toujours les plugins importants (Admin, Channel, Config, Misc, Owner, et User), peu importe l'état de la configuration. Généralement, si ces plugins sont configurés pour ne pas être chargés, vous ne pourrez plus les charger, et finalement, vous voudrez le faire. Les personnes qui ne souhaitent pas charger ces plugins sont suffisement intelligents pour changer la valeur de cette variable de façon appropriée :)
it: Determina se il bot caricherà sempre i plugin importanti (Admin, Channel, Config, Misc, Owner e User) a prescindere da come siano configurati. In genere se questi sono impostati per non essere caricati non è stato fatto di proposito e vorrai comunque caricarli. Chi non vuole che questo avvenga sarà sufficientemente abile nel modificare il valore di questa variabile in modo appropriato :)
ru: Определяет, будет ли бот всегда загружать важные плагины (Admin, Channel, Config, Misc, Owner и User) независимо от их настроенного состояния. Как правило, если эти плагины настроены не загружаться, вы сделали это не специально, и вы все равно хотите, чтобы они загружались. Пользователи, которые не хотят загружать эти плагины, достаточно умны, чтобы изменить значение этой переменной соответствующим образом :)

source: Determines what databases are available for use. If this value is not configured (that is, if its value is empty) then sane defaults will be provided.
fr: Détermine quelles bases de données sont disponibles. si cette valeur n'est pas configurée (c'est à dire si sa valeur est vide), alors une manière par défaut saine sera utilisée.
it: Determina quali database rendere disponibili. Se non configurato (ovvero il valore è vuoto) verrà utilizzato uno predefinito.
ru: Определяет, какие базы данных доступны для использования. Если это значение не задано (т.е. если его значение пустое), то будут предоставлены значения по умолчанию.

source: Determines what filename will be used for the users database. This file will go into the directory specified by the supybot.directories.conf variable.
fr: Détermine quel nom de fichier sera utilisé pour la base de données des utilisateurs. Ce fichiers ira dans le répertoire spécifié par la variable supybot.directories.conf.
it: Determina il nome del file utilizzato per il database degli utenti che finirà nella directory specificata dalla variabile supybot.directories.conf.
ru: Определяет, какое имя файла будет использоваться для базы данных пользователей. Этот файл будет находиться в каталоге, указанном в supybot.directories.conf.

source: Determines how long it takes identification to time out. If the value is less than or equal to zero, identification never times out.
fr: Détermine combien de temps au maximum une personne peut rester identifié. Si cette valeur est inférieure ou égale à zéro, l'identification n'expirera jamais.
it: Determina per quanto tempo rimarrà identificato un utente. Se il valore è inferiore o uguale a zero l'identificazione non scadrà mai.
ru: Определяет, через какое время идентификация истекает. Если значение меньше или равно нулю, идентификация никогда не истечёт.
