Repository: progval/Limnoria
Catalog: locales/*.po
Languages: fr, it, ru

source: Determines whether the bot will send error messages to users in private. You might want to do this in order to keep channel traffic to minimum. This can be used in combination with supybot.reply.error.withNotice.
fr: Détermine si le bot enverra les messages d'erreur en privé. Vous pouvez vouloir ceci dans le but de limiter le traffic de données sur le canal. Vous pouvez utiliser ceci en combinaison avec supybot.reply.error.withNotice.
it: Determina se il bot invierà i messaggi di errore in privato; utile per ridurre il traffico del canale. Può essere usato in combinazione con supybot.reply.error.withNotice.
ru: Определяет, будет ли бот отправлять сообщения об ошибках в личные сообщения пользователям. Возможно вы захотите использовать эту настройку, чтобы свести сообщения в канале к минимуму. Это может быть использовано в сочетании с supybot.reply.error.withNotice.

source: Determines whether the bot will send error messages to users via NOTICE instead of PRIVMSG. You might want to do this so users can ignore NOTICEs from the bot and not have to see error messages; or you might want to use it in combination with supybot.reply.error.inPrivate so private errors don't open a query window in most IRC clients.
ru: Определяет, будет ли бот отправлять сообщение об ошибке пользователям через NOTICE вместо PRIVMSG. Эта настройка полезна, чтобы пользователи просто могли игнорировать NOTICE от бота и не видеть сообщение об ошибке; а также полезно при использовании в комбинации supybot.reply.error.inPrivate, тогда ошибки в личных сообщениях не будут создавать новое окно переписки в большинстве IRC-клиентов.

source: Determines whether the bot will *not* provide details in the error message to users who attempt to call a command for which they do not have the necessary capability. You may wish to make this True if you don't want users to understand the underlying security system preventing them from running certain commands.
ru: Определяет, будет ли бот *НЕ* предоставлять подробную информацию об ошибке пользователям, попытавшимся вызвать команду, для которой у них отсутствуют нужные привилегии. Возможно вы захотите указать True, чтобы пользователи не смогли понять устройство системы безопасности, не позволяющую им выполнять привилегированные команды.

source: Determines whether the bot will reply privately when replying in a channel, rather than replying to the whole channel.
fr: Détermine si le bot répondra en privé, plutôt que de répondre sur le canal.
it: Determina se il bot risponderà in privato piuttosto che in canale.
ru: Определяет, будет ли бот отвечать в личный диалог на сообщение, а не в самом канале.

source: Determines whether the bot will reply with a notice when replying in a channel, rather than replying with a privmsg as normal.
fr: Détermine si le bot répondra par notice sur un canal plutôt que par privmsg comme d'habitude
it: Determina se il bot risponderà con un notice piuttosto che in privato.
ru: Определяет, будет ли бот отвечать на сообщение в канале через NOTICE, нежели через PRIVMSG как обычно.

source: Determines whether the bot will reply with a notice when it is sending a private message, in order not to open a /query window in clients.
ru: Определяет, будет ли бот отвечать на личное сообщение через NOTICE, чтобы не открывать /query окно на клиентах.

source: Determines whether the bot will always prefix the user's nick to its reply to that user's command.
fr: Détermine si le bot préfixera toujours ses réponses par le nick de l’utilisateur ayant invoqué la commande.
ru: Определяет, будет ли бот использовать ник пользователя в качестве префикса к своему ответу на команду пользователя.

source: Determines whether the bot should attempt to reply to all messages even if they don't address it (either via its nick or a prefix character). If you set this to True, you almost certainly want to set supybot.reply.whenNotCommand to False.
fr: Détermine si le bot tentera de répondre à tous les messages, même si ils ne lui sont pas adressés (par son nick ou par un caractère de préfixe). Si vous définissez ceci à True, vous voudrez probablement mettre supybot.reply.whenNotCommand à False.
it: Determina se il bot tenterà di rispondere a tutti i messaggi anche se non richiamato (tramite il nick o il prefisso). Se impostato a True, si vorrà certamente impostare supybot.reply.whenNotCommand a False.
ru: Определяет, должен ли бот отвечать на любое сообщение независимо от того, адресовано ли оно ему (либо с помощью ника, либо с помощью символ-префикса). Если вы укажите True, то вы точно захотите установить и supybot.reply.whenNotCommand в False.

source: Determines whether the bot will allow you to send channel-related commands outside of that channel. Sometimes people find it confusing if a channel-related command (like Filter.outfilter) changes the behavior of the channel but was sent outside the channel itself.
fr: Détermine si le bot vous permettra d'envoyer des commandes liées à un canal en-dehors de ce canal. Parfois, certaines personnes confondent lorsqu'une commande liée à un canal (comme Filter.outfilter) changent le comportement du canal, alors que la commande est envoyée en-dehors du canal.
it: Determina se il bot permetterà di inviare comandi relativi al canale al di fuori dello stesso. Talvolta gli utenti trovano disorientante che un comando (come Filter.outfilter) modifichi il comportamento del canale ma è stato inviato fuori da questo.
ru: Определяет, будет ли бот позволять вам отправлять команды, относящиеся к каналу, за его пределами. Людей может вводить в заблуждение, если какая-то команда, которая меняет поведение канала (например, Filter.outfilter), была отправлена вне этого самого канала.

source: Determines whether the bot will unidentify someone when that person changes their nick. Setting this to True will cause the bot to track such changes. It defaults to False for a little greater security.
fr: Détermine si le bot will désidentifiera une personne lorsque celle-ci change son nick. Mettre ceci à True fera que le bot traquera ces changements. Il est par défaut à False pour améliorer légèrement la sécurité.
it: Determina se il bot de-identificherà un utente quando questo cambia nick. Impostandolo a True, il bot terrà traccia di questi cambiamenti; è su False in modo predefinito per migliorare leggermente la sicurezza.
ru: Определяет, будет ли бот идентифицировать пользователя при смене его ника. Если установить значение в True, то бот будет отслеживать такие изменения. По умолчанию для большей безопасности значение - False.

source: Determines whether the bot will always join a channel when it's invited. If this value is False, the bot will only join a channel if the user inviting it has the 'admin' capability (or if it's explicitly told to join the channel using the Admin.join command).
fr: Détermine si le bot joindra toujours les canaux sur lesquels il est invité. Si cette valeur est à False, le bot ne joindra un canal que si la personne l'invitant a la capacité 'admin' (ou si il lui a directement envoyé la commande Admin join)
it: Determina se il bot entrerà sempre in un canale in cui è stato invitato. Se impostato a False entrerà solo se l'utente che lo invita ha la capacità "admin" (o se gli è stato esplicitamente detto di farlo tramite il comando Admin.join).
ru: Определяет, будет ли бот всегда присоединятся к каналу, куда он был приглашён. Если указано False, то бот будет присоединяться к каналам по приглашению только, если приглашающий пользователь имеет привилегию 'admin' (или если боту явно дана команда присоединиться к каналу с помощью Admin.join).

source: Supybot normally replies with the full help whenever a user misuses a command. If this value is set to True, the bot will only reply with the syntax of the command (the first line of the help) rather than the full help.
fr: Supybot répond normalement avec une aide complète lorsque quelqu'un se trompe dans une commande. Si cette valeur est à True, le bot ne répondra qu'avec la syntaxe de la commande (la première ligne de l'aide), plutôt que par toute l'aide.
it: Quando un utente commette un errore inviando un comando, Supybot risponde solitamente con l'help completo. Se questo valore è impostato a True, il bot risponderà solo con la sintassi del comando (la prima riga dell'help).
ru: Обычно Supybot отвечает полной справкой в случае неправильного использования команды пользователем. Если указано True, то бот ответит только справкой о синтаксисе команды (первая строка справки) вместо полной справки.

source: Determines what prefix characters the bot will reply to. A prefix character is a single character that the bot will use to determine what messages are addressed to it; when there are no prefix characters set, it just uses its nick. Each character in this string is interpreted individually; you can have multiple prefix chars simultaneously, and if any one of them is used as a prefix the bot will assume it is being addressed.
fr: Détermine à quel caractère de préfixe le bot réagira. Un caractère de préfixe est un caractère servant à indiquer que le message est destiné au bot ; lorsqu'il n'y a pas de caractère de préfixe, vous ne pouvez qu'utiliser le nick du bot. Chaque caractère de cette chaîne sera interprété individuellement ; vous pouvez avoir plusieurs caractères simultanément, et un seul d'entre eux suffira pour s'adresser au bot.
it: Definisce il prefisso con il quale risponderà il bot. Un prefisso è un carattere che serve a determinare quali messaggi siano indirizzati ad esso; quando non c'è un prefisso viene utilizzato il suo nick. Ogni carattere è interpretato individualmente ed è possibile impostarne più di uno.
ru: Определяет символ-префиксы, на которые бот будет отзываться. Символ-префикс - это символ, который бот будет использовать для определения сообщений, адресованных ему, а если символов-префиксов не указано, то бот использует свой ник. Каждый символ в строке считывается как символ-префикс, поэтому у бота их может быть несколько, и на все он будет отзываться.

source: Determines what strings the bot will reply to when they are at the beginning of the message. Whereas prefix.chars can only be one character (although there can be many of them), this variable is a space-separated list of strings, so you can set something like '@@ ??' and the bot will reply when a message is prefixed by either @@ or ??.
fr: Détermine à quelles chaînes le bot répondra lorsqu'elles sont au début du message. Alors que prefex.chars n'est utilisé que pour un caractère seul (même si on peut en utiliser plusieurs), cette variable est une liste de chaînes séparées par des espaces, vous pouvez donc par exemple mettre '@@ ??' et le bot répondra lorsqu'un message est préfixé par @@ ou par ??.
it: Determina a quali stringhe risponderà il bot quando queste sono all'inizio del messaggio. Mentre con "prefix.chars" può essere solo un carattere (sebbene possano essercene diversi) questa variabile è una lista separata da spazi, per cui è possibile ad esempio impostare "@@ ??" e far sì che il bot risponderà sia ad un messaggio prefissato da "@@" sia da "??".
ru: Определяет строки, на которые бот будет отзываться, если те находятся в начале сообщения. Если prefix.chars может быть только одним символом (хотя их может быть несколько), то эта настройка является списком строк через пробел, поэтому вы можете указать что-то вроде '@@ ??', и бот будет отвечать на все сообщения, если у них будет в начале @@ или ??.

source: Determines whether the bot will reply when people address it by its nick, rather than with a prefix character.
fr: Détermine si le bot will répondra lorsque des gens s'adresseront à lui par si nick, au lieu de ne répondre qu'aux caractères de préfixe.
it: Determina se il bot risponderà quando gli utenti lo richiamano tramite il nick piuttosto che con un prefisso.
ru: Определяет, будет ли бот отвечать людям, если те вызывают его через его ник, а не через символ-префикс.

source: Determines whether the bot will reply when people address it by its nick at the end of the message, rather than at the beginning.
fr: Détermine si le bot répondra lorsque les personnes mettent son nick à la fin d'un message, plutôt qu'au début.
it: Determina se il bot risponderà quando gli utenti lo richiamano tramite il nick alla fine del messaggio piuttosto che all'inizio.
ru: Определяет, будет ли бот отвечать, когда люди вызывают его по нику в конце сообщения, а не в начале.

source: Determines what extra nicks the bot will always respond to when addressed by, even if its current nick is something else.
fr: Détermine à quels nicks supplémentaires le bot répondra lorsqu'on s'adressera à lui par ceux-ci, même si le nick est actuellement utilisé.
it: Determina a quali ulteriori nick risponderà il bot, anche se quello attuale è diverso.
ru: Определяет дополнительные ники, на которые бот всегда будет отзываться, даже если его текущий ник отличается.

source: The operation succeeded.
fr: Opération effectuée avec succès.
it: L'operazione è riuscita.
ru: Операция прошла успешно.

source: Determines what message the bot replies with when a command succeeded. If this configuration variable is empty, no success message will be sent.
fr: Détermine quel message le bot répondra lorsqu'une commande a été effectuée avec succès. Si cette variable de configuration est vide, aucun message de succès ne sera envoyé.
it: Determina con quale messagggio risponderà il bot quando un comando è stato effettuato con successo. Se questa variabile è vuota non verrà inviato alcun messaggio.
ru: Определяет содержание сообщения, которым бот отвечает в случае успешного выполнения команды. Если эта настройка пуста, то сообщение не будет отправлено.

source: An error has occurred and has been logged. Please contact this bot's administrator for more information.
fr: Une erreur est survenue et a été logguée. Contactez l'administrateur du bot pour plus d'informations.
it: Si è verificato un errore ed è stato registrato. Per ulteriori informazioni contattare l'amministratore del bot.
ru: Произошла ошибка, записана в журнал. Пожалуйста, свяжитесь с админом этого бота для получения доп. информации.

source: Determines what error message the bot gives when it wants to be ambiguous.
fr: Détermine quel message d'erreur le bot donnera, quand il décidera de ne pas être plus précis.
it: Determina quale messagggio di errore riporterà il bot quando non vuole essere preciso.
ru: Определяет содержание общего сообщения об ошибке, которым бот отвечает на не выполнившиеся команды.

source: An error has occurred and has been logged. Check the logs for more information.
ru: Произошла ошибка, записана в журнал. Проверьте его для дополнительной информации.

source: Determines what error message the bot gives to the owner when it wants to be ambiguous.
fr: Détermine quel message d'erreur le bot donnera au propriétaire lorsqu'il veut être ambigu.
it: Determina quale messagggio di errore riporterà il bot all'owner quando non vuole essere preciso.
ru: Определяет, какое сообщение об ошибке бот выдает владельцу, если оно неоднозначное.

source: Your hostmask doesn't match or your password is wrong.
fr: Votre masque d'hôte ne correspond pas, ou votre mot de passe est incorrect.
it: La tua hostmask non corrisponde o la password è errata.
ru: Ваша маска хоста не совпадает, или ваш пароль неверный.

source: I can't find %s in my user database. If you didn't give a user name, then I might not know what your user is, and you'll need to identify before this command might work.
fr: Je ne peux trouver %s dans ma base de données d'utilisateurs. Si vous ne m'avez pas donné un nom d'utilisateur, je ne peux savoir qui est cet utilisateur, et vous devrez vous identifier avant que cette commande fonctionne.
it: Non trovo %s nel database degli utenti. Se non fornisci un nome utente non posso sapere quale sia e dovrai identificarti prima di utilizzare questo comando.
ru: Я не могу найти %s в мой базе данных пользователей. Если вы не указали имя пользователя, то возможно я вас не знаю, и вам необходимо идентифицироваться, прежде чем эта команда сможет быть выполнена.

source: Determines what error message the bot replies with when someone tries to accessing some information on a user the bot doesn't know about.
fr: Détermine quel message d'erreur est envoyé lorsque quelqu'un essaye d'accéder à une information sur une personne que le bot ne connait pas.
it: Determina con quale messagggio di errore risponderà il bot quando qualcuno prova ad accedere a informazioni riguardanti un utente di cui il bot non sa nulla.
ru: Определяет содержание сообщения об ошибке, которым бот отвечает, если кто-то пытается получить какую-либо информацию о пользователе, неизвестном боту.

source: You must be registered to use this command. If you are already registered, you must either identify (using the identify command) or add a hostmask matching your current hostmask (using the "hostmask add" command).
fr: Vous devez être enregistré(e) pour utiliser cette commande. Si vous êtes déjà enregistré(e), vous devez vous identifier (en utilisant la commande 'identify') ou ajouter un masque d'hôte correspondant à votre masque d'hôte courant (en utilisant la commande 'hostmask add').
it: Per utilizzare questo comando devi essere registrato. Se lo sei già devi identificarti (tramite il comando "identify") o aggiungere una hostmask che corrisponda a quella attuale (tramite il comando "hostmask add").
ru: Вы должны быть зарегистрированы для использования этой команды. Если вы уже зарегистрированы, то вы должны идентифицироваться, используя команду identify, или добавить хост-маску, совпадающую с вашей текущей, используя команду "hostmask add".

source: Determines what error message the bot replies with when someone tries to do something that requires them to be registered but they're not currently recognized.
fr: Détermine quel message d'erreur le bot renvoie lorsque quelqu'un essaye de faire quelque chose qui nécessit d'être enregistré, alors qu'il n'est pas reconnu.
it: Determina con quale messagggio risponderà il bot quando si prova a fare qualcosa per cui bisogna essere registrati ma non si è attualmente riconosciuti.
ru: Определяет содержание сообщение об ошибке, которым бот отвечает, когда кто-то пытается выполнить команду, требующую регистрации, но бот его не помнит.

source: You don't have the %s capability. If you think that you should have this capability, be sure that you are identified before trying again. The 'whoami' command can tell you if you're identified.
fr: Vous n'avez pas la capacité %s. Si vous pensez que vous l'avez, assurez-vous d'être identifié(e) et réessayez. La commande 'whoami' vous dit si vous êtes identifié(e).
it: Non hai la capacità %s; se pensi di averla assicurati di essere identificato prima di riprovare. Il comando "whoami" ti dirà se lo sei.
ru: У вас нет привилегии %s. Если вы считаете, что у вас должна быть такая привилегия, убедитесь, что в своей идентификации, прежде чем повторить попытку. Команда 'whoami' может сказать вам, идентифицированы ли вы.

source: You're missing some capability you need. This could be because you actually possess the anti-capability for the capability that's required of you, or because the channel provides that anti-capability by default, or because the global capabilities include that anti-capability. Or, it could be because the channel or supybot.capabilities.default is set to False, meaning that no commands are allowed unless explicitly in your capabilities. Either way, you can't do what you want to do.
fr: Il vous manque une capacité. Ceci peut être dû au fait que vous possédez actuellement une anti-capacité quant à la commande que vous tentez d'utiliser, ou que le canal fourni cette anti-capacité par défaut, ou parce que les capacités globales incluent cette anti-capacité. Cela peut également être du au fait que supybot.capabilities.default est défini à False, ce qui signifie qu'une commande n'est autorisée par défaut (elles doivent être autorisées une par une par un administrateur). En clair, vous ne pouvez pas le faire.
it: Ti manca qualche capacità necessaria. Questo potrebbe essere dovuto al fatto che possiedi una anti-capacità per quella richiesta o perché il canale fornisce quella anti-capacità in modo predefinito o, ancora, perché le capacità globali includono tale anti-capacità. Oppure supybot.capabilities.default è impostata a False, per cui non è permesso l'uso di alcun comando a meno che espressamente specificato nelle tue capacità (da un amministratore). In ogni caso non ti è permesso fare ciò che intendevi.
ru: Вам не хватает некоторых необходимых вам привилегий. Это может быть вызвано тем, что у вас есть антипривилегия к требуемой, или потому, что канал предоставляет эту антипривилегию по умолчанию, или потому, что глобальные привилегии предоставляют эту антипривилегию. Или это может быть связано с тем, что для канала или supybot.capabilities.default установлено значение False, что означает, что никакие команды не разрешены, если это явно не соответствует вашим возможностям. В любом случае вы не можете делать то, что хотите.

source: Determines what generic error message is given when the bot is telling someone that they aren't cool enough to use the command they tried to use, and the author of the code calling errorNoCapability didn't provide an explicit capability for whatever reason.
fr: Détermine le message d'erreur générique qui est donné par le bot pour dire à quelqu'un qu'il ou elle n'a pas les capacités requises pour utiliser une commande qu'il ou elle essaye d'utiliser, si l'auteur du code appelant errorNoCapability ne fourni pas d'information explicite sur la raison de ce refus.
it: Determina quale messaggio di errore generico fornire quando il bot dice a qualcuno di non avere accesso ad un certo comando e l'autore del codice che richiama errorNoCapability non ha fornito un'informazione esplicita sul motivo.
ru: Определяет содержание общего сообщения об ошибке, когда бот сообщает кому-либо, что он недостаточно крут, чтобы использовать эту команду, а автор кода, вызвавшего ошибку errorNoCapability, не предоставил явную информацию по какой-либо причине.

source: That operation cannot be done in a channel.
fr: Cette opération ne peut être faite sur un canal.
it: L'operazione non può essere eseguita in un canale.
ru: Эта операция не может быть выполнена в канале.

source: Determines what error messages the bot sends to people who try to do things in a channel that really should be done in private.
fr: Détermine quel message d'erreur le bot envoie aux personnes qui tentent de faire quelque chose sur un canal, alors que cela doit être fait en privé.
it: Determina quale messaggio di errore invierà il bot a chi tenta di fare qualcosa in canale e che dovrebbe invece fare in privato.
ru: Определяет содержание сообщения об ошибке, которое бот отправляет людям, пытающимся сделать то, что должны делать в личной переписке.

source: This may be a bug. If you think it is, please file a bug report at <https://github.com/progval/Limnoria/issues>.
ru: Возможно, что вы столкнулись ошибкой. Если это так, то, пожалуйста, сообщите о ней в <https://github.com/progval/Limnoria/issues>.

source: Determines what message the bot sends when it thinks you've encountered a bug that the developers don't know about.
fr: Détermine quel message le bot envoie quand il pense que l'on a rencontré un bug que les développeurs ne connaissent pas.
it: Determina quale messaggio invierà il bot quando pensa tu abbia trovato un bug di cui gli sviluppatori non sono a conoscenza.
ru: Определяет содержание сообщения, которое отправит бот, если он посчитает, что вы столкнулись с ошибкой, неизвестной разработчикам.

source: $Type #$id: $text (added by $username at $at)
ru: $Type #$id: $text (добавлено пользователем $username в $at)
