Repository: progval/Limnoria
Catalog: plugins/Alias/locales/*.po
Languages: fi, fr, hu, it

source: Returns the channel the msg came over or the channel given in args. If the channel was given in args, args is modified (the channel is removed).
fi: Palauttaa kanavan, jolta viesti tuli tai kanavan, joka on annettu parametreissä. Jos kanava annetaan parametreissä, parametriä muokataan (kanava poistetaan).
fr: Retourne le canal duquel vient le message ou le canal donné en argument. Si le canal était donné en argument, args est modifié (le canal est supprimé).
hu: Kiírja a csatorna nevét, ahonnan az üzenet jött, vagy a paraméterként megadott csatornát. Ha a csatorna meg volt adva paraméterként, a paraméterek módosulnak (a csatorna eltávolításra kerül).
it: Restituisce il canale da dove proviene il messaggio o il canale fornito come argomento. Se il canale è stato dato come argomento, quest'ultimo viene modificato (il canale viene rimosso).

source: at least
fi: vähintään
fr: au moins
hu: legalább
it: almeno

source: <an alias,%s %n> Alias for %q.
fi: <alias,%s %n> Alias %q:lle.
fr: <un alias,%s %n> Alias pour %q.
hu: <egy álnév,%s %n Álnév %q-ra.
it: <un alias,%s %n> Alias per %q.

source: argument
fi: parametri
hu: paraméter
it: argomento

source: <alias> Locks an alias so that no one else can change it.
fi: <alias> Lukitsee aliaksen, niin ettei kukaan muu voi muuttaa sitä.
fr: <alias> Vérouille un alias pour que personne d'autre ne puisse le changer.
hu: <álnév> Lezár egy álnevet, hogy senki más ne változtathassa meg.
it: <alias> Blocca un alias affinché nessun altro possa modificarlo.

source: There is no such alias.
fi: Tuollaista aliasta ei ole.
fr: Cet alias n'existe pas.
hu: Nincs ilyen álnév.
it: Non c'è nessun alias.

source: <alias> Unlocks an alias so that people can define new aliases over it.
fi: <alias> Poistaa lukituksen aliaksesta, jotta ihmiset vouvat määrittää uusia aliaksia sen päälle.
fr: <alias> Déverrouille un alias de façon à ce que des gens puissent le redéfinir.
hu: <álnév> Feloldja egy álnév lezárását, hogy az emberek új álnevekkel írhassák felül.
it: <alias> Sblocca un alias affinché chiunque possa ridefinirne di nuovi.

source: That name isn't valid. Try %q instead.
fi: Tuo nimi ei ole kelvollinen. Yritä sen sijaan %q:ta.
fr: Ce nom n'est pas valide. Essayez plutôt %q.
hu: Az a név nem érvényes. Próbáld meg %q-t inkább.
it: Nome non valido. Prova %q invece.

source: <name> <command> Defines an alias <name> that executes <command>. The <command> should be in the standard "command argument [nestedcommand argument]" arguments to the alias; they'll be filled with the first, second, etc. arguments. $1, $2, etc. can be used for required arguments. @1, @2, etc. can be used for optional arguments. $* simply means "all remaining arguments," and cannot be combined with optional arguments.
fi: <nimi> <alias> Määrittää aliaksen <nimi>, joka suorittaa <komennon>. <Aliaksen> pitäisi olla tavallinen "komento parametri [sisäkkäinen komento parametrit]" parametrejä aliakselle; ne täytetään ensimmäinen, toinen, jne. Parametrit. $1, $2, jne. ovat vaadittava parametrejä. @1, @2, jne. ovat valinnaisia parametrejä. $* tarkoittaa yksinkertaisesti "kaikki jäljellä olevat parametrit," ja johon ei voida yhdistää vaihtoehtoisia parametrejä.
fr: <nom> <alias> Défini un alias <nom> qui exécute <alias>. L'<alias> peut être dans le standard "commande argument [commandeimbriquee argument]". Les arguments donnés à l'alias doivent être donnés dans l'ordre. Vous pouvez utiliser $1, $2, etc pour symboliser les arguments obligatoires qui seront donnés à l'alias, et @1, @2, etc pour symboliser ceux optionnels. $* signifie simplement *tous* les arguments restants, et ne peut être combiné avec des arguments optionnels.
hu: <név> <álnév> Meghatároz egy <név> nevű álnevet, amely futtatja <álnév> parancsot. Az <álnév>-nek a szabványos "parancs paraméter [beágyazottparancs paraméter]" álnév paraméterei formában kell lennie; ezek ki lesznek töltve az első, második stb. paraméterekkel. $1, $2 stb. használható kötelező paraméterekhez. @1, @2 stb. használható választható paraméterekhez. $* azt jelenti, "az összes hátralévő paraméter," és nem kombinálható választható paraméterekkel.
it: <nome> <comando> Definisce un <nome> che esegue <comando>. <comando> deve essere nello standard "comando argomento [comando_nidificato argomento]"; gli argomenti dati devono essere riportati in sequenza. Per gli argomenti richiesti è possibile utilizzare $1, $2, ecc., mentre @1, @2, ecc. per quelli opzionali. $* significa semplicemente "tutti gli argomenti rimanenti" e non può essere combinato con quelli opzionali.

source: <name> Removes the given alias, if unlocked.
fi: <nimi> Poistaa annetun aliaksen jos se ei ole lukittu.
fr: <nom> Supprime l'alias donné, si il n'est pas verrouillé.
hu: <név> Eltávolítja a megadott álnevet, ha nincs lezárva.
it: <nome> Rimuove l'alias specificato, se questo non è bloccato.

source: You've attempted more nesting than is currently allowed on this bot.
fr: Vous avez essayé d’utiliser plus d’imbrication que ce qui est actuellement autorisé sur ce bot.
