Repository: progval/Limnoria
Catalog: plugins/Network/locale/*.po
Languages: it

source: [--ssl] <network> [<host[:port]>] [<password>] Connects to another network (which will be represented by the name provided in <network>) at <host:port>. If port is not provided, it defaults to 6667, the default port for IRC. If password is provided, it will be sent to the server in a PASS command. If --ssl is provided, an SSL connection will be attempted.
it: [--ssl] <rete> [<host[:porta]>] [<password>] Si connette a un'altra rete (rappresentata dal nome dato a <rete>) su <host:porta>. Se la porta non è fornita usa la 6667, quella predefinita per IRC. Se viene specificata la password sarà inviata al server tramite il comando PASS. Se --ssl è specificato, sarà richiesta una connessione SSL.

source: I'm already connected to %s.
it: Sono già connesso a %s.

source: A server must be provided if the network is not already registered.
it: Se la rete non è già registrata è necessario fornire un server.

source: Connection to %s initiated.
it: Connessione a %s iniziata.

source: [<network>] [<quit message>] Disconnects from the network represented by the network <network>. If <quit message> is given, quits the network with the given quit message. <network> is only necessary if the network is different from the network the command is sent on.
it: [<rete>] [<messaggio di uscita>] Si disconnette dalla rete (rappresentata dal nome dato a <rete>). Se <messaggio di uscita> è specificato, esce con tale messaggio. <rete> è necessaria solo se la rete è differente da quella sulla quale è inviato il comando.

source: Disconnection to %s initiated.
it: Disconnessione a %s iniziata.

source: [<network>] [<quit message>] Disconnects and then reconnects to <network>. If no network is given, disconnects and then reconnects to the network the command was given on. If no quit message is given, uses the configured one (supybot.plugins.Owner.quitMsg) or the nick of the person giving the command.
it: [<rete>] [<messaggio di uscita>] Si disconnette da <rete> e si riconnette. <rete> è necessaria solo se la rete è differente da quella sulla quale è inviato il comando. Se non viene specificato un messaggio di uscita, utilizza quello configurato in supybot.plugins.Owner.quitMsg o il nick di chi ha dato il comando.

source: <network> <command> [<arg> ...] Gives the bot <command> (with its associated <arg>s) on <network>.
it: <rete> <comando> [<argomento> ...] Invia <comando> al bot (con i suoi argomenti) su <rete>.

source: is an op on %L
it: è un op su %L

source: is a halfop on %L
it: è un halfop su %L

source: is voiced on %L
it: ha il voice su %L

source: is also on %L
it: è anche su %L

source: is on %L
it: è su %L

source: isn't on any non-secret channels
it: non è in alcun canale non segreto

source: <unknown>
it: <sconosciuto>

source: identified
it: identificato

source: %s (%s) has been%s on server %s since %s (idle for %s) and %s.%s
it: %s (%s) è%s sul server %s dalle %s (inattivo da %s) ed %s.%s

source: There is no %s on %s.
it: Non c'è nessun %s su %s.

source: [<network>] <nick> Returns the WHOIS response <network> gives for <nick>. <network> is only necessary if the network is different than the network the command is sent on.
it: [<rete>] <nick> Restituisce la risposta di WHOIS per <nick> sulla <rete> specificata. <rete> è necessario solo se la rete è differente da quella sulla quale è inviato il comando.

source: takes no arguments Returns the networks to which the bot is currently connected.
it: non necessita argomenti Restituisce le reti alle quali è attualmente connesso il bot.

source: %.2f seconds.
it: %.2f secondi.

source: [<network>] Returns the current latency to <network>. <network> is only necessary if the message isn't sent on the network to which this command is to apply.
it: [<rete>] Riporta l'attuale latenza di <rete>. <rete> è necessaria solo se la rete è differente da quella sulla quale è inviato il comando.

source: Latency check (from %s).
it: Verifica di latenza (da %s).

source: [<network>] Returns the current network driver for <network>. <network> is only necessary if the message isn't sent on the network to which this command is to apply.
it: [<rete>] Riporta l'attuale driver di rete per <rete>. <rete> è necessaria solo se la rete è differente da quella sulla quale è inviato il comando.

source: [<network>] Returns the time duration since the connection was established.
it: [<rete>] Riporta da quanto tempo è connesso il bot.

source: I've been connected to %s for %s.
it: Sono connesso a %s da %s.
