Repository: progval/Limnoria
Catalog: plugins/Topic/locales/*.po
Languages: fi, fr

source: Value must include $topic, otherwise the actual topic would be left out.
fi: Asetusarvon täytyy sisältää $topic tai muuten itse aihe jätetään pois.
fr: La valeur doit inclure $topic, sinon, le topic actuel serait laissé tel quel.

source: Determines what separator is used between individually added topics in the channel topic.
fi: Määrittää mitä erotinta käytetään erikseen lisättyjen aiheiden välissä kanavan aiheessa.
fr: Détermine quel séparateur est utilisé entre les différents topics dans le topic du canal.

source: Determines what format is used to add topics in the topic. All the standard substitutes apply, in addition to "$topic" for the topic itself.
fi: Määrittää mitä muotoa käytetään, kun lisätään aiheita aiheeseen. Kaikki peru muunnokset ovat voimassa, "$topic" tarkoittaa aihetta itseään.
fr: Détermine quel format est utilisé pour ajouter des topics dans le topic. Tous les substituts standard s'appliquent, en plus de "$topic" pour le topic lui-même.

source: Determines whether the bot will recognize the TOPICLEN value sent to it by the server and thus refuse to send TOPICs longer than the TOPICLEN. These topics are likely to be truncated by the server anyway, so this defaults to True.
fi: Määrittää tunnistaako botti TOPICLEN-arvon, jonka palvelin on lähettänyt sille ja näin kieltäytyy asettamasta pidempiä aiheita, kuin TOPICLEN. Kyseiset aiheet tulisivat muutenkin palvelimen lyhentämiksi, joten tämän asetusarvo on oletuksena True.
fr: Détermine si le bot reconnaitra la valeur TOPICLEN envoyée par le serveur et refusera d'envoyer des topics plus longs que TOPICLEN. De toutes manière, les topics trop longs seront tronqués par le serveur, don cç vaut par défaut True.

source: Determines what the default topic for the channel is. This is used by the default command to set this topic.
fi: Määrittää mikä on oletus aihe kanavalle. 'Default' komento käyttää tätä asettaakseen aiheen.
fr: Détermine quel est le topic par défaut du canal. C'est utilisé par la commande 'default'.

source: Determines whether the bot will set the topic every time it joins, or only if the topic is empty.
fr: Détermine si le bot définira le topic à chaque fois qu’il rejoint le salon, ou seulement si le topic est vide.

source: Determines the number of previous topics to keep around in case the undo command is called.
fi: Määrittää edellisten aiheiden määrän, jotka säilytetään siltä varalta, että 'undo' komentoa käytetään.
fr: Détermine le nombre de topics précédents à garder pour le cas où la commande 'undo' est appelée.

source: Determines the capabilities required (if any) to make any topic changes, (everything except for read-only operations). Use 'channel,capab' for channel-level capabilities. Note that absence of an explicit anticapability means user has capability.
fi: Määrittää valtuudet, jotka (jos mitkään) vaaditaan aiheen vaihtamiseen, (=kaikki, paitsi vain-luku komennot). Käytä valtuutta 'channel,valtuus' kanava-tason valtuuksia varten. Huomaa, että anti-valtuuden poissaolo tarkoittaa, että käyttäjällä on valtuus.
fr: Détermine les capacités requises (s'il y en a) pour changer le topic (c'est à dire tout ce qui n'est pas une opération en lecture seule). Utilisez #canal,capacité pour les capacités de canaux. Notez qu'en l'absence d'une anticapacité explicite, l'utilisateur a cette capacité.

source: I'm not currently in %s.
fi: En juuri nyt ole kanavalla %s.
fr: Je ne suis pas actuellement sur %s.

source: I can't change the topic, I'm not (half)opped and %s is +t.
fi: En voi vaihtaa aihetta, koska en ole kyseisellä kanavalla puolioperaattori ja kanavalla %s on tila +t.
fr: Je ne peux changer le topic, je ne suis pas halfopé, et %s a le mode +t.

source: The topic must not include %q.
fi: %q ei saa olla aiheessa.
fr: Le topic ne doit pas inclure %q.

source: topic number
fi: aiheen numero
fr: numéro de topic

source: There are no topics in %s.
fi: Kanavalla %s ei ole aiheita.
fr: Il n'y a pas de topic sur %s.

source: That topic is too long for this server (maximum length: %i; this topic: %i).
fi: Määrittämäsi aihe on liian pitkä tälle palvelimelle (maksimi pituus on %i; tämän aiheen pituus on %i).
fr: Ce topic est trop long pour ce serveur (longueur maximum : %i ; ce topic : %i).

source: [<channel>] Returns the topic for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa <kanavan> aiheen. <Kanava> on vaadittu vain ellei viestiä lähetetä kanavalla itsellään.
fr: [<canal>] Retourne le topic du <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <topic> Adds <topic> to the topics for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <aihe> Lisää <aiheen> <kanavan> aiheisiin. <Kanava> on vaadittu vain, ellei viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <topic> Ajoute le <topic> aux topics du <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <topic> Adds <topic> to the topics for <channel>. If the topic is too long for the server, topics will be popped until there is enough room. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <aihe> Lisää <aiheen> <kanavan> aiheisiin. Jos aihe on liian pitkä palvelimelle, aihetta kutistetaan kunnes sille on tarpeeksi tilaa. <Kanava> on vaadittu vain, ellei viestiä lähetetä kanavalla itsellään.
fr: [<canal>] <topic> Ajoute le topic <topic> aux topics du <canal>. Si le topic est trop long pour le serveur, les topics les plus vieux seront supprimés jusqu'à ce qu'il y ai assez de place. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <number> <topic> Replaces topic <number> with <topic>.
fi: [<kanava>] <numero> <aihe> Korvaa aiheen <numero> <aiheella>.
fr: [<canal>] <nombre> <topic> Remplace le topic <nombre> par le <topic>.

source: [<channel>] <topic> Adds <topic> to the topics for <channel> at the beginning of the topics currently on <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <aihe> Lisää <aiheen> <kanavan> aiheisiin <kanavalla> silloisten aiheiden alkuun. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <topic> Ajoute le <topic> aux topics du <canal>, au début des topics actuellement sur le <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] Shuffles the topics in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Sekoittaa aiheet <kanavalla>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Mélance les topics sur le <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: I can't shuffle 1 or fewer topics.
fi: Yhtä tai vähempää aihetta ei voida sekoittaa.
fr: Je ne peux mélanger les topics que si il y en a au moins deux.

source: [<channel>] <number> [<number> ...] Reorders the topics from <channel> in the order of the specified <number> arguments. <number> is a one-based index into the topics. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <numero> [<numero> ...] Järjestää aiheet <kanavalla> järjestyksessä, joka on määritetty <numero> parametreillä. <Numero> on yksi-indexinen aiheisiin. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <nombre> [<nombre> ...] Remet les topics du <canal> dans l'ordre spécifié par les arguments <nombre>. <nombre> est un index dans les topics. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: I cannot reorder 1 or fewer topics.
fi: En voi uudelleen järjestää yhtä tai vähempää aihetta.
fr: Je ne peux réordonner les topics s'il y en a moins de deux.

source: All topic numbers must be specified.
fi: Kaikki numerot täytyy määrittää.
fr: Tous les nombres de topics doivent être spécifiés.

source: Duplicate topic numbers cannot be specified.
fi: Aiheen numeroiden kaksoiskappaleita ei voida määrittää.
fr: Les numéros de topics ne peuvent être en double.

source: [<channel>] Returns a list of the topics in <channel>, prefixed by their indexes. Mostly useful for topic reordering. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa listan aiheista <kanavalla>, etuliitettyinä indekseihinsä. Enimmäkseen hyödyllinen aiheen uudelleenjärjestämisessä. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Retourne la liste des topics sur le <canal>, préfixés par leur index. Généralement utile pour réordonner les topics. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <number> Returns topic number <number> from <channel>. <number> is a one-based index into the topics. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <nombre> Retourne le topic numéro <nombre> du canal. <nombre> est un index dans les topics. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <number> <regexp> Changes the topic number <number> on <channel> according to the regular expression <regexp>. <number> is the one-based index into the topics; <regexp> is a regular expression of the form s/regexp/replacement/flags. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <nombre> <regexp> Change le topic <nombre> sur le <canal>, en accord avec l'expression régulière <regexp>. <nombre> est un index parmis les topics ; <regexp> est une expression régulière de la forme s/regexp/replacement/flags. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] [<number>] <topic> Sets the topic <number> to be <text>. If no <number> is given, this sets the entire topic. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [<numero>] <aihe> Asettaa aiheen <numero> <tekstiksi>. Jos <numeroa> ei ole annettu, tämä asettaa koko aiheen. <Kanava> on vaadittu vain, ellei viestiä lähetetä kanavalla itsellään.
fr: [<canal>] [<nombre>] <topic> Définit le topic <nombre>. Si le <nombre> n'est pas donné, il s'agit du topic entier. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <number> Removes topic <number> from the topic for <channel> Topics are numbered starting from 1; you can also use negative indexes to refer to topics starting the from the end of the topic. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <numero> Poistaa aiheen <numero> <kanavan> aiheesta. Aiheet on numeroitu alkaen numerosta 1; voit käyttää negatiivisia lukuja saadaksesi ne viittaamaan aiheisiin, jotka alkavat lopusta. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <nombre> Supprime le topic <nombre> des topics du <canal>. Les topics sont numérotés à partir de 1 ; vous pouvez également utiliser des indexs négatifs pour compter à partir de la fin. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] Locks the topic (sets the mode +t) in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Lukitsee aiheen (asettaa tilan +t) <kanavalla>. <Kanava> on vaadittu vain, ellei viestiä lähetetä kanavalla itsellään.
fr: [<canal>] Verrouille le topic (défini le mode +t) sur le <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: lock the topic
fi: lukitse aihe
fr: verrouiller le topic

source: [<channel>] Unlocks the topic (sets the mode -t) in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<channel>] Avaa aiheen (asettaa tilan -t) <kanavalla>. <Kanava> on vaadittu vain, ellei viestiä lähetetä kanavalla itsellään.
fr: [<canal>] Déverrouille le topic (défini le mode -t) sur le <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: unlock the topic
fi: avaa aiheen
fr: déverrouiller le topic

source: [<channel>] Restores the topic to the last topic set by the bot. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Palauttaa aiheen viimeiseksi aiheeksi, jonka botti on asettanut. <Kanava> on vaadittu vain, ellei viestiä lähetetä kanavalla itsellään.
fr: [<canal>] Restaure le topic tel qu'il était la dernière fois que le bot l'a défini. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: I haven't yet set the topic in %s.
fi: En ole vielä asettanut aihetta kanavalla %s.
fr: Je n'ai encore jamais définit le topic sur %s.

source: [<channel>] Restores the topic to the one previous to the last topic command that set it. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] Restaure le topic à l'état dans lequel il était avant la dernière utilisation de la commande 'topic. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: There are no more undos for %s.
fi: Kanavalle %s ei ole enempää kumouksia.
fr: Il n'y a plus rien à défaire sur %s

source: [<channel>] Undoes the last undo. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Kumoaa viimeisen kumouksen. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Défait le dernier 'undo'. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: There are no redos for %s.
fr: Il n'y a plus rien à refaire sur %s

source: [<channel>] <first topic number> <second topic number> Swaps the order of the first topic number and the second topic number. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <ensimmäisen aiheen numero> <toisen aiheen numero> Vaihtaa ensimmäisen ja toisen aiheen paikat. <Kanava> on vaadittu vain, ellei viestiä lähetetä kanavalla itsellään.
fr: [<canal>] <nombre du premier topic> <nombre du deuxième topic> Inverse les deux topics donnés. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: I refuse to swap the same topic with itself.
fi: Kieltäydyn vaihtamasta aiheen paikkaa sen itsensä kanssa.
fr: Je refuse d'échanger un topic avec lui-même.

source: [<channel>] Saves the topic in <channel> to be restored with 'topic default' later. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] Enregistre le topic du <canal> pour être restauré avec 'topic default' par la suite. <canal> n'est nécessaire que si vous n'exécutez pas la commande dans le canal lui-même.

source: [<channel>] Sets the topic in <channel> to the default topic for <channel>. The default topic for a channel may be configured via the configuration variable supybot.plugins.Topic.default.
fi: [<kanava>] Asettaa <kanavan> aiheen <kanavan> oletusaiheeksi. Kanavan oletusaihe voidaan määrittää asetuksen supybot.plugins.Topic.default arvolla.
fr: [<canal>] Définit le topic du <canal> pour correspondre à celui par défaut défini pour le <canal>. Le topic par défaut pour un canal peut être configuré via la variable supybot.plugins.Topic.default. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: There is no default topic configured for %s.
fi: Kanavalle %s ei ole määritetty oletusaihetta.
fr: Il n'y a pas de topic par défaut configuré pour %s.

source: [<channel>] <separator> Sets the topic separator for <channel> to <separator> Converts the current topic appropriately.
fi: [<kanava>] <eroittaja> Asettaa <kanavan> erottimen <erottimeksi>, muuntaa nykyisen aiheen sen mukaisesti.
fr: [<canal>] <separateur> Définir le séparateur de topic du <canal> pour être <séparateur>. Convertit le topic actuel de manière appropriée. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: This plugin allows you to use many topic-related functions, such as Add, Undo, and Remove.
fi: Tämä plugini sallii monien aiheeseen liittyvien functioiden käytön, kuten lisäämisen (add), kumoamisen (undo) ja poistamisen (remove).

source: Check if the user has any of the required capabilities to manage the channel topic. The list of required capabilities is in requireManageCapability channel config. Also allow if the user is a chanop. Since they can change the topic manually anyway.
fi: Tarkista onko käyttäjällä valtuudet, jotka on vaadittu kanavan aiheen hallintaan. Lista vaadituista valtuuksista on kanava-asetusarvossa requireManageCapability Salli myös jos käyttäjä on kanavaoperaattori, koska hän voisi vaihtaa aiheen muutenkin manuaalisesti.

source: [<channel>] Saves the topic in <channel> to be restored with @topic default later. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] Tallentaa aiheen <kanavalla>, jotta se voidaan palauttaa "@topic default"—komennolla myöhemmin. <Kanava> on vaadittu vain, ellei viestiä lähetetä kanavalla itsellään.
