Repository: progval/Limnoria
Catalog: plugins/Time/locale/*.po
Languages: fi

source: Determines the format string for timestamps. Refer to the Python documentation for the time module to see what formats are accepted. If you set this variable to the empty string, the timestamp will not be shown.
fi: Määrittää muotoketjun aikaleimoille. Katso Python documentaatiosta aikamoduulin kohdalta nähdäksesi, mitkä muodot hyväksytään. Jos asetat tämän tyhjäksi merkkiketjuksi, aikaleimaa ei näytetä.

source: [<years>y] [<weeks>w] [<days>d] [<hours>h] [<minutes>m] [<seconds>s] Returns the number of seconds in the number of <years>, <weeks>, <days>, <hours>, <minutes>, and <seconds> given. An example usage is "seconds 2h 30m", which would return 9000, which is '3600*2 + 30*60'. Useful for scheduling events at a given number of seconds in the future.
fi: [<vuosia>y] [<viikkoja>w] [<days>d] [<hours>h] [<minutes>m] [<seconds>s] Palauttaa annettujen <vuosien>, <viikkojen>, <päivien>, <tuntien>, <minuuttien>, ja <sekuntejen> määrän sekunteina. Esimerkki käyttö on "seconds 2h 30m", joka palauttaisi 9000, joka on '3600*2 + 30*60'. Hyödyllinen ajastamaan tapahtumia annettujen sekuntien päästä tulevaisuudessa.

source: <time string> Returns the number of seconds since epoch <time string> is. <time string> can be any number of natural formats; just try something and see if it will work.
fi: <aika merkkiketju> Palauttaa sen määrän sekunteja ajanlaskun alusta, kuin <aikamerkkiketju> on. <Aika merkkiketju> voi olla mikä tahansa määrä luonnollisia muodostelmia; kokeile vain jotakin ja katso toimiiko se.

source: That's right now!
fi: Se on juuri nyt!

source: <time string> Returns the number of seconds until <time string>.
fi: <aika merkkiketju> Palauttaa sekuntien määrän <aika merkkiketjuun>.

source: [<seconds since epoch>] Returns the ctime for <seconds since epoch>, or the current ctime if no <seconds since epoch> is given.
fi: [<sekunteja ajanlaskun alkamisen jälkeen>] Palauttaa ctimen <sekunteja ajanlaskun alkamisen jälkeen>, tai nykyisen ctimen, jos <sekunteja ajanlaskun alkamisen jälkeen> on annettu.

source: number of seconds since epoch
fi: sekuntien määrä ajanlaskun alkamisen jälkeen

source: [<format>] [<seconds since epoch>] Returns the current time in <format> format, or, if <format> is not given, uses the configurable format for the current channel. If no <seconds since epoch> time is given, the current time is used.
fi: [<muoto>] [<sekunteja ajanlaskun alkamisen jälkeen>] Palauttaa nykyisen ajan <muodon> muodossa, tai, jos <format> ei ole annettu käyttää muokattavaa muotoa nykyiselle kanavalle. Jos <sekunteja ajanlaskun alkamisen jälkeen> ei ole annettu, käytetään nykyistä aikaa.

source: <seconds> Returns a pretty string that is the amount of time represented by <seconds>.
fi: <sekunteja> Palauttaa nätin merkkiketjun, joka on <sekunteilla> esitetty.

source: <region>/<city> Takes a city and its region, and returns the locale time.
fi: <alue>/<kaupunki> Ottaa kaupungin ja sen alueen, ja palauttaa paikallisen ajan.

source: Python-tz is required by the command, but is not installed on this computer.
fi: Python-tz on vaadittu tämän komennon käyttämiseen, mutta se ei ole asennettuna tälle tietokoneelle.

source: Unknown timezone
fi: Tuntematon aikavyöhyke
