Repository: progval/Limnoria
Catalog: plugins/Misc/locale/*.po
Languages: de, fr

source: Determines whether the bot will list private plugins with the list command if given the --private switch. If this is disabled, non-owner users should be unable to see what private plugins are loaded.
de: Legt fest ob der Bot private Plugins mit dem list Befehl auflisten soll, wenn man den --private Schalter angibt. Falls das deaktiviert ist, ist es nicht Inhabern unmöglich zu sehen ob private Plugins geladen sind.
fr: Détermine si le bot listera les plugins privés dans la commande 'list', si l'option --private est donné. Si cette variable est désactivée, les utilisateurs non-owner ne pourront pas voir quels plugins privés sont chargés.

source: Determines whether the bot will list unloaded plugins with the list command if given the --unloaded switch. If this is disabled, non-owner users should be unable to see what unloaded plugins are available.
fr: Détermine si le bot listera les plugins déchargés dans la commande 'list', si l'option --unloaded est donné. Si cette variable est désactivée, les utilisateurs non-owner ne pourront pas voir quels plugins déchargés sont présents.

source: Determines the format string for timestamps in the Misc.last command. Refer to the Python documentation for the time module to see what formats are accepted. If you set this variable to the empty string, the timestamp will not be shown.
de: Legt das Format der Zeichenkette für Zeitstempel im Misc.last Befehl fest. Schau in die Python Dokumentation für das time Modul um zu sehen welche Formate unterstützt sind. Falls du diese Variable auf eine leere Zeichenkette setzt wird kein Zeitstempel angezeigt.
fr: Détermine la chaîne de formattage pour les timestamps de la commande Misc.last. Référez-vous à la documentation de Python sur le module 'time' pour voir quels formats sont acceptés. Si vous définissez cette variable pour être une chaîne vide, le timestamp ne sera pas affiché.

source: Determines whether or not the timestamp will be included in the output of last when it is part of a nested command
de: Legt fest ob der Zeitstempel mit in der Ausgabe stehen soll, wenn der letzte Befehl teil eines verschachtelten Befehls war.
fr: Détermine si le timestamp sera inclu dans la sortie de 'last' lorsqu'il est dans une commande imbriquée.

source: Determines whether or not the nick will be included in the output of last when it is part of a nested command
de: Legt fest ob der Nick mit in der Ausgabe stehen soll, wenn der letzte Befehl teil eines verschachtelten Befehls war.
fr: Détermine si le nick est inclu dans la sortie de 'last' lorsqu'il est dans une commande imbriquée.

source: You've given me %s invalid commands within the last minute; I'm now ignoring you for %s.
de: Du hast mir %s nicht zulässige Befehle innerhalb der letzten Minute gegeben. Ich werde dich für %s ignorieren.
fr: Vous m'avez donné %s commandes invalides dans la dernière minute, je vous ignore maitenant pendant %s.

source: The %q plugin is loaded, but there is no command named %q in it. Try "list %s" to see the commands in the %q plugin.
de: Das %q Plugin ist geladen, aber es besitzt keinen Befehl mit dem Namen %q. Versuche "list %s" um die Befehle des %q Plugins zu sehen.
fr: Le plugin %q est chargé, mais il n'a pas de commande appelée %q. Essayez "list %s" pour voir les commandes dans le plugin %q.

source: command
fr: commande

source: [--private] [--unloaded] [<plugin>] Lists the commands available in the given plugin. If no plugin is given, lists the public plugins available. If --private is given, lists the private plugins. If --unloaded is given, it will list available plugins that are not loaded.
fr: [--private] [--unloaded] [<plugin>] Liste les commandes disponibles dans le plugin donné. Si aucun plugin n'est donné, liste les plugins publics. Si --private est donné, il liste les plugins privés. Si --unloaded est donné, il liste les plugins disponibles qui ne sont pas chargés.

source: --private and --unloaded are uncompatible options.
fr: --private et --unloaded ne sont pas des options compatibles.

source: There are no private plugins.
de: Es gibt keine privaten Plugins.
fr: Il n'y a pas de plugin privé.

source: There are no public plugins.
de: Es gibt keine öffentlichen Plugins.
fr: Il n'y a pas de plugin privé.

source: That plugin exists, but has no commands. This probably means that it has some configuration variables that can be changed in order to modify its behavior. Try "config list supybot.plugins.%s" to see what configuration variables it has.
de: Dieses Plugin existiert, hat aber keine Befehle. Das heißt womöglich das es einige Konfigurationsvariablen hat, die verändert werden können um das Verhalten zu beeinflussen. Probiere "config list supybot.plugins.%s" um zu sehen welche Konfigurationsvariablen es hat.
fr: Ce plugin existe, mais n'a pas de commande. Cela signifie probablement qu'il a des variables de configuration qui peuvent être changés pour modifier son comportement. Essayez "config list supybot.plugins.%s" pour voir quelles variables de configuration il a.

source: <string> Searches for <string> in the commands currently offered by the bot, returning a list of the commands containing that string.
de: <Zeichenkette> Sucht nach <Zeichenkette> in den Befehlen die der Bot momentan anbietet, gibt eine Liste der Befehle zurück in denen die Zeichenkette vorkommt.
fr: <chaîne> Recherche la <chaîne> dans les commandes actuellement fournies par le bot et retourne une list des commandes contenant cette chaîne.

source: No appropriate commands were found.
de: Kein passender Befehl gefunden.
fr: Aucune commande appropriée n'a été trouvée.

source: [<plugin>] [<command>] This command gives a useful description of what <command> does. <plugin> is only necessary if the command is in more than one plugin.
de: [<Plugin>] [<Befehl>] Gibt eine nützliche Beschreibung was der <Befehl> tut. <Plugin> wird nur benötigt, falls es den Befehl in mehr wie einem Plugin gibt.
fr: [<plugin>] [<commande>] Cette commande donne une description utile de ce que fait la <commande>. <plugin> n'est nécessaire que si la commande est présente dans plus d'un plugin.

source: That command exists in the %L plugins. Please specify exactly which plugin command you want help with.
de: Den Befehl gibt es in diesen %L Plugins. Bitte gibt genau an mit welchen Plugin Befehl du Hilfe benötigst.
fr: Cette commande existe dans les plugins %L. Veuillez spécifier dans quel plugin se trouve la commande pour laquelle vous cherchez de l'aide.

source: There is no command %q.
de: Es gibt keinen Befehl %q.
fr: Il n'y a pas de commande %q.

source: takes no arguments Returns the version of the current bot.
de: hat keine Argumente Gibt die momentane Bot Version aus.
fr: ne prend pas d'argument Retourne la version actuelle du bot

source: The newest versions available online are %s.
de: Die neuste online Version ist %s.
fr: Les dernières versions disponibles en ligne sont %s.

source: %s (in %s)
fr: %s (dans %s)

source: I couldn't fetch the newest version from the Limnoria repository.
de: Ich konnte mir die neuste Version nicht aus dem Limnoria Verzeichnis holen.
fr: Je ne peux récupérer la dernière version sur le dépôt de Limnoria.

source: The current (running) version of this Supybot is %s. %s
de: Die momentane (laufende) Version von Supybot ist %s. %s
fr: La version de ce Supybot est %s. %s

source: takes no arguments Returns a URL saying where to get Limnoria.
de: hat keine Argumente Gibt eine URL zurück die dir sagt wo man Limnoria bekommt.
fr: ne prend pas d'argument Retourne une URL disant où trouver Limnoria.

source: My source is at https://github.com/ProgVal/Limnoria
de: Mein Quellcode ist auf https://github.com/ProgVal/Limnoria
fr: Ma source est disponible sur https://github.com/ProgVal/Limnoria

source: [<nick>] If the last command was truncated due to IRC message length limitations, returns the next chunk of the result of the last command. If <nick> is given, it takes the continuation of the last command from <nick> instead of the person sending this message.
de: [<nick>] Falls die Ausgabe des letzten Befehls abgeschnitten wurde, wegen der IRC Nachrichtenlänge beschränkung, wird der nexte Teil der Ausgabe des letzten Befehls ausgegben. Falls <nick> angegeben wird, wird die AUsgabe des letzten Befehls von <nick> weitergeführt, anstatt der Person die den Befehl sendete.
fr: [<nick>] Si la dernière commande était tronquée par les limitations de taille des messages sur IRC, retourne le morceau suivant résultant de la dernière commande. Si le <nick> est donné, continue la dernière commande du <nick> plutôt que de la personne envoyant ce message.

source: %s has no public mores.
de: %s hat keine öffentlichen Nachrichten mehr.
fr: %s n'a pas de 'more' public.

source: Sorry, I can't find any mores for %s
de: Sorry, Ich kann nicht mehr für %s finden
fr: Désolé, je ne peux trouver de 'more' pour %s

source: more message
de: mehr Nachricht
fr: autre message

source: more messages
de: mehr Nachrichten
fr: autres messages

source: You haven't asked me a command; perhaps you want to see someone else's more. To do so, call this command with that person's nick.
de: Du hast mir keinen Befehl geben; eventuell willst du mehr Nachrichten einer anderen Person sehen. Um das zu ereichen, rufe diesen Befehl auf mit dem Nicknamen der Person auf.
fr: Vous ne m'avez donné aucune commande. Peut-être que vous voulez voir celle de quelqu'un d'autre. Pour cela, appelez cette commande en ajoutant le nick de cette personne.

source: That's all, there is no more.
de: Das ist alles, mehr ist nicht da.
fr: C'est tout, il n'y a plus de 'more'

source: [--{from,in,on,with,without,regexp} <value>] [--nolimit] Returns the last message matching the given criteria. --from requires a nick from whom the message came; --in requires a channel the message was sent to; --on requires a network the message was sent on; --with requires some string that had to be in the message; --regexp requires a regular expression the message must match; --nolimit returns all the messages that can be found. By default, the channel this command is given in is searched.
de: [--{from,in,on,with,without,regexp} <value>] [--nolimit] Gibt die letzte Nachricht aus, die auf die gegeben Kriterien passt. --from benötigt den Nick von dem die Nachricht kam; --in benötigt den Kanal in den die Nachricht gesendet wurde; --on benötigt das Netzwerk in dem die Nachricht gesendet wurde; --with benötigt eine Zeichenkette die in der Nachricht vorkommt; --regexp benötigt einen regulären Ausdruck auf der auf die Nachricht zutrifft; --nolimit zeigt alle Nachrichten die gefunden wurden. Voreinstellung: Der Kanal in dem der Befehl gegeben wird, wird durchsucht.
fr: [--{from,in,on,with,without,regexp} <valeur>] [--nolimit] Retourne le dernier message correspondant aux critères donnés. --from requiert le nick de la personne qui a envoyé le message ; --in requiert le canal sur lequel a été envoyé le message ; --with requiert une chaîne qui doit être dans le message --regexp requiert une expression régulière à laquelle le message doit correspondre ; --nolimit retourne tous les messages qui peuvent être trouvés. Par défaut, recherche dans les logs du canal sur lequel est envoyée cette commande.

source: The regular expression timed out.
fr: L'expression régulière a pris trop de temps à être évaluée.

source: I couldn't find a message matching that criteria in my history of %s messages.
de: I konnte keine Nachricht in meiner Geschichte von %s Nachrichten finden die auf die Kriterien passt.
fr: Je ne peux trouver de message correspondant à ce critère dans mon historique de %s messages.

source: <nick> <text> Tells the <nick> whatever <text> is. Use nested commands to your benefit here.
de: <nick> <text> Sagt <nick> den Inhalt von <text>. Benutze verschachtelte Befehle um nutzen daraus zu ziehen.
fr: <nick> <texte> Dit le <texte> au <nick>. Utile si vous utilisez des commandes imbriquées.

source: Dude, just give the command. No need for the tell.
de: Junge, gib mir einfach den Befehl.
fr: Mec, contentes-toi de me donner la commande. Pas besoin d'utiliser 'tell'.

source: You just told me, why should I tell myself?
de: Das hast du mir gerade gesagt, wieso sollte ich es mir selbst sagen?
fr: Vous venez de me le dire, pourquoi devrais-je me le dire moi-même ?

source: I haven't seen %s, I'll let you do the telling.
de: Ich habe %s nicht gesehen, sag es ihm selbst.
fr: Je n'ai pas vu %s, je vous laisse lui dire.

source: %s wants me to tell you: %s
de: %s will dir folgendes sagen: %s
fr: %s veut que je vous dise : %s

source: takes no arguments Checks to see if the bot is alive.
de: hat keine Argumente Überprüft ob der Bot noch am Leben ist.
fr: ne prend pas d'argument Vérifie si le bot est encore en vie.

source: [<channel>] <beginning> [--match-case] Returns the nick of someone on the channel whose nick begins with the given <beginning>. <channel> defaults to the current channel.
fr: [<canal>] <lettres> [--match-case] Retourne le nick de quelqu'un dans le salon dont le nick commence par les <lettres> indiquées. <channel> correspond par défaut au salon actuel.

source: I'm not even in %s.
fr: Je ne suis pas dans %s.

source: No such nick.
fr: Ce nick n'existe pas.

source: [--private] [<plugin>] Lists the commands available in the given plugin. If no plugin is given, lists the public plugins available. If --private is given, lists the private plugins.
de: [--private] [<Plugin>] Listet die Befehl auf die das gegebene Plugin anbietet. Falls kein Plugin angegeben wird, werden alle verfügbaren öffentliche Befehle aufgelistet. Falls --private angegeben wird, werden alle privaten Plugins aufgelistet.
