Repository: progval/Limnoria
Catalog: plugins/Factoids/locale/*.po
Languages: fi

source: Value must include $value, otherwise the factoid's value would be left out.
fi: Arvon täytyy sisältää $value, muutoin factoidin arvo jätettäisiin ulos.

source: Determines what separator must be used in the learn command. Defaults to 'as' -- learn <key> as <value>. Users might feel more comfortable with 'is' or something else, so it's configurable.
fi: Määrittää mitä komentoa käytetään erottajana "learn" komennossa. Oletuksena 'as' -- learn <avain> as <arvo>. Käyttäjistä saattaa käyttäjästä saattaa olla mukavampaa käyttää 'is'iä tai jotakin muuta, joten se on säädettävissä.

source: Determines whether the bot will reply with the single matching factoid if only one factoid matches when using the search command.
fi: Määrittää vastaako botti yhden komennon täsmäävään factoidiin, jos vain yksi täsmää "search" komentoa käytettäessä.

source: If you try to look up a nonexistent factoid, this setting make the bot try to find some possible matching keys through several approximate matching algorithms and return a list of matching keys, before giving up.
fi: Jos sinä yrität etsiä olematonta factoidia, tämä asetus saa botin yrittämään löytää mahdollisesti täsmääviä avaimia muutaman tarkan täsmäusalgoritmin läpi ja palauttaa listan täsmäävistä avaimista ennen, kuin luovuttaa.

source: $key could be $value.
fi: $key voisi olla $value.

source: [<channel>] <key> %s <value> Associates <key> with <value>. <channel> is only necessary if the message isn't sent on the channel itself. The word '%s' is necessary to separate the key from the value. It can be changed to another word via the learnSeparator registry value.
fi: [<kanava>] <avain> %s <arvo> Liittää <avaimen> <arvoon>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään. Sana '%s' on vaadittu erottamaan avain arvosta. Se voidaan vaihtaa toiseksi sanaksi learnSeparator rekisteriarvolla.

source: Try to typo-match input to possible factoids. Assume first letter is correct, to reduce processing time. First, try a simple wildcard search. If that fails, use the Damerau-Levenshtein edit-distance metric.
fi: Yritä typo-täsmätä mahdollisia factoideja. Oleta, että ensinmäinen kirjain on oikein, vähentääksesi suoritusaikaa. Ensiksi, yritä yksinkertaista jokerimerkki hakua. Jos se epäonnistuu, käytä Damerau-Levenshtein muokkaus-etäisyys metriä.

source: That's not a valid number for that key.
fi: Tuo ei ole kelvollinen numero tuolle avaimelle.

source: No factoid matches that key.
fi: Mikään factoidi ei täsmää tuota avainta.

source: [<channel>] [--raw] <key> [<number>] Looks up the value of <key> in the factoid database. If given a number, will return only that exact factoid. If '--raw' option is given, no variable substitution will take place on the factoid. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [--raw] <avain> [<numero>] Etsii <avaimen> arvoa factoidi tietokannasta. Jos numero on annettu, palauttaa vain juuri sen factoidin. Jos '--raw' asetus on annettu, muuttujan korvike ei vaikuta factoidissa. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: key id
fi: avaimen id

source: [<channel>] <oldkey> <newkey> [<number>] Adds a new key <newkey> for factoid associated with <oldkey>. <number> is only necessary if there's more than one factoid associated with <oldkey>. The same action can be accomplished by using the 'learn' function with a new key but an existing (verbatim) factoid content.
fi: [<kanava>] <vanha avain> <uusi avain> [<numero>] Lisää uudenavaimen <uusi avain> factoidiin, joka on liitetty <vanhalla avaimella>. <numero> on vaadittu vain, jos vain yksi factoid on liitetty <vanhaan avaimeen>. Sama toiminto voidaan suorittaa 'learn' toiminnolla, mutta uusi avain tulee olemassa olevan (verbatim) factoidin sisällön kautta.

source: This key-factoid relationship already exists.
fi: Tämä avain-factoidi suhde on jo olemassa.

source: This key has more than one factoid associated with it, but you have not provided a number.
fi: Tähän avaimeen on liitetty useampi, kuin yksi factoidi, mutta sinä et antanut numeroa.

source: [<channel>] [--plain] [--alpha] [<number>] Returns a list of top-ranked factoid keys, sorted by usage count (rank). If <number> is not provided, the default number of factoid keys returned is set by the rankListLength registry value. If --plain option is given, rank numbers and usage counts are not included in output. If --alpha option is given in addition to --plain, keys are sorted alphabetically, instead of by rank. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] [--plain] [--alpha] [<numero>] Palauttaa factoidien top-listan. käyttömäärän (rank) perusteella. Jos <numero> ei ole annettu palauttaa factoideja rankListLength rekisteriarvon määrittämän määrän. Jos asetus --plain on annettu, ranking numeroita ja käyttömääriä ei sisällytetä ulostuloon. Jos --alpha asetus on annettu --plain :in lisäksi, avaimet lajitellaan aakkosjärjestyksessä, rankingin sijasta. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <key> Locks the factoid(s) associated with <key> so that they cannot be removed or added to. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <avain> Lukitsee factoid(it), jotka on liitetty <avaimeen>, jotta niitä ei voida poistaa, eikä lisätä. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <key> Unlocks the factoid(s) associated with <key> so that they can be removed or added to. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <avain> Avaa factoid(it), jotka on liitetty <avaimeen>, jotta niitä voidaan lisätä tai poistaa. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: [<channel>] <key> [<number>|*] Removes a key-fact relationship for key <key> from the factoids database. If there is more than one such relationship for this key, a number is necessary to determine which one should be removed. A * can be used to remove all relationships for <key>. If as a result, the key (factoid) remains without any relationships to a factoid (key), it shall be removed from the database. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <avain> [<numero>|*] Poistaa avain-factoidi suhteen <avaimelle> factoidi tietokannasta. jos avaimelle on useampi kuin yksi suhde, numero on vaadittu määrittämään mikä pitäisi poistaa/ *:teä voi käyttää poistamaan kaikki suhteet <avaimelle>. Jos tuloksena, avain (factoidi) jää ilman factoidia (avain), se poistetaan tietokannasta. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: There is no such factoid.
fi: Tuollaista factoidia ei ole-

source: Invalid factoid number.
fi: Epäkelvollinen factoidin numero.

source: %s factoids have that key. Please specify which one to remove, or use * to designate all of them.
fi: %s factoidilla on tuo avain. Ole hyvä ja määritä mikä poistetaan, tai käytä * poistaaksesi ne kaikki.

source: [<channel>] Returns a random factoid from the database for <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<Kanava>] Palauttaa satunnaisen factoidin <kanavan> tietokannasta. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.

source: I couldn't find a factoid.
fi: En voinut löytää factoidia.

source: [<channel>] <key> Gives information about the factoid(s) associated with <key>. <channel> is only necessary if the message isn't sent in the channel itself.
fi: [<kanava>] <avain> Antaa tiedot factod(eista), jotka on liitetty <avaimella>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.

source: #%i was added by %s at %s, and has been recalled %n
fi: #%i:inlisäsi %s %s, aja on kutsuttu %n

source: time
fi: aika

source: [<channel>] <key> <number> <regexp> Changes the factoid #<number> associated with <key> according to <regexp>.
fi: [<kanava>] <avain> <numero> <säännöllinen lauseke> Vaihtaa factoidin #<numeroa>, joka on liitetty <avaimeen> <säännöllisen lausekkeen> mukaan.

source: I couldn't find any key %q
fi: En voinut löytää yhtään avainta %q

source: [<channel>] [--values] [--{regexp} <value>] [<glob> ...] Searches the keyspace for keys matching <glob>. If --regexp is given, its associated value is taken as a regexp and matched against the keys. If --values is given, search the value space instead of the keyspace.
fi: [<kanava>] [--values] [--{regexp} <arvo>] [<glob> ...] Etsii avainavaruudesta avaimia, jotka täsmäävät <glob>. Jos --regexp on annettu, liittää arvon, joka on otettu säännöllisestä lausekkeesta ja täsmätty avaimia vastaan. Jos --values on annettu, etsii arvoavaruudesta avainavaruuden sijaan.

source: No keys matched that query.
fi: Yksikään avain ei täsmännyt hakuun.

source: More than 100 keys matched that query; please narrow your query.
fi: Yli 100 avainta täsmäsi tuohon hakuun; ole hyvä ja kavenna hakuasi.
