Repository: progval/Limnoria
Catalog: plugins/Seen/locale/*.po
Languages: de, fi, fr

source: %s was last seen in %s %s ago: %s
de: %s wurde zuletzt in %s vor %s gesehen: %s
fi: %s nähtiin viimeeksi kanavalla %s %s sitten: %s
fr: %s a été vu pour la dernière fois sur %i il y a %s : %s

source: %s (%s ago)
de: %s (vor %s)
fi: %s (%s sitten)
fr: %s (il y a %s)

source: %s could be %L
de: %s könnte %L sein
fi: %s voisi olla %L
fr: %s doit être %L

source: or
de: oder
fi: tai
fr: ou

source: I haven't seen anyone matching %s.
de: Ich habe niemanden gesehen der auf %s passt.
fi: En ole nähnyt kenenkään täsmäävän %s.
fr: Je n'ai vu personne correspondant à %s.

source: I have not seen %s.
de: Ich habe %s nicht gesehn.
fi: En ole nähnyt %s:ää.
fr: Je n'ai pas vu %s.

source: [<channel>] <nick> Returns the last time <nick> was seen and what <nick> was last seen saying. <channel> is only necessary if the message isn't sent on the channel itself.
fi: [<kanava>] <nimimerkki> Palauttaa viimeisen kerran, kun <nimimerkki> nähtiin ja mitä <nimimerkin> nähtiin sanovan viimeksi. <Kanava> on vaadittu vain jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <nick> Retourne la dernière fois que le <nick> a été vu et la dernière fois que <nick> a parlé. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] [--user <name>] [<nick>] Returns the last time <nick> was seen and what <nick> was last seen doing. This includes any form of activity, instead of just PRIVMSGs. If <nick> isn't specified, returns the last activity seen in <channel>. If --user is specified, looks up name in the user database and returns the last time user was active in <channel>. <channel> is only necessary if the message isn't sent on the channel itself.
de: [<Kanal>] [--user <Name>] [<Nick>] Gibt zurück wann <Nick> zuletzt gesehen wurde und was dieser Tat. Dies beinhaltet jede Art von Aktivität, anstatt nur PRIVMSGs. Falls <Nick> nicht angegen wurde, wird die letzte gesehene Aktivität im <Kanal> ausgegeben. Falls --user angegeben wird, wird in der Benutzerdatenbank nachgeschaut und die Zeit ausgegeben als der Benutzer zuletzte Aktiv war im <Kanal>. <Kanal> ist nur nötig, falls die Nachricht nicht im Kanal selbst gesendet wurde.
fi: [<kanava>] [--user <nimimerkki>] [<nimimerkki>] Palauttaa viimeisen kerran, jolloin <nimimerkki> nähtiin viimeeksi ja mitä <nimimerkki> nähtiin viimeeksi tekemässä. Tämä sisältää kaikenlaisen aktiivisuuden, sen sijaan, että sisältäisi vain PRIVMSGitä. Jos <nimimerkki> ei ole määritetty, palauttaa viimeisen aktiivisuuden, joka tapahtui <kanavalla>. Jos --user on määritetty, etsii nimeä käyttäjätietokannasta ja palauttaa viimeisen kerran, kun käyttäjä oli aktiivinen <kanavalla>. <Kanava> on on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] [--user <nom>] [<nick>] Retourne la dernière fois que le <nick> a été vu et ce quand il a fait quelque chose pour la première fois. Cela inclue toute forme d'activité, et pas uniquement envoyer des messages. Si le <nick> n'est pas donné, retourne la dernière activité vue sur le <canal>. Si --user est spécifié, recherche le nom dans la base de données des utilisateurs la dernière fois que celui en question a été vu actif sur le <canal. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: Someone was last seen in %s %s ago: %s
de: Jemand wurde zuletzt in %s gesehen, vor %s: %s
fi: Joky nähtiin viimeeksi kanavalla %s %s sitten: %s
fr: Quelqu'un a été vu pour la dernière fois sur %s il y a %s : %s

source: I have never seen anyone.
de: Ich habe noch niemals jemanden gesehen.
fi: Minä en ole nähnyt ketään.
fr: Je n'ai jamais vu personne.

source: [<channel>] Returns the last thing said in <channel>. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] Gibt das zuletzt gesagte im <Kanal> aus. <Kanal> ist nur nötig, falls die Nachricht nicht im Kanal selbst gesendet wurde.
fi: [<kanava>] Palauttaa viimeisen asian, joka sanottiin <kanavalla>. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Retourne la dernière chose dite sur le <canal>. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <name> Returns the last time <name> was seen and what <name> was last seen saying. This looks up <name> in the user seen database, which means that it could be any nick recognized as user <name> that was seen. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] <Name> Gibt an wann <Name> zum letzten mal gesehen wurde und was <Name> zuletzt sagte. Der <Name> wird in der Gesehen-Datenbank nachgeschaut, dies bedeutet, dass es jeder Nick sein kann der vom Benutzer <Name> gesehen wurde. <Kanal> ist nur nötig, falls die Nachricht nicht im Kanal selbst gesendet wurde.
fi: [<kanava>] <nimi> Palauttaa viimeisen kerran, kun <nimi> nähtiin ja mitä <nimi> nähtiin viimeksi sanomassa. Tämä etsii <nimeä> käyttäjän näkemistietokannasta, mikä tarkoittaa, että se voi olla mikä tahansa nimimerkki. joka on tunnistettu käyttäjä<nimeksi> joka on nähty. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] <nom> Retourne la dernière fois que <nom> a été vu et la dernière fois que <nom> a été vu parler. Cela recherche <nom> dans la base de données des utilisateurs vus, ce qui signifit que si le nick n'était pas reconnu comme l'utilisateur <nom>, il n'est pas considéré comme vu. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.

source: [<channel>] <nick> Returns the messages since <nick> last left the channel.
de: [<Kanal>] <Nick> Gibt die Nachrichten zurück, die seit dem verlassen von <Nick> im Kanal gesendet wurden.
fi: [<kanava>] <nimimerkki> Palauttaa sen jälkeiset viestit, kun <nimimerkki> viimeksi poistui kanavalta.
fr: [<canal>] <nick> Retourne les messages depuis que <nick> est parti du canal.

source: You must be in %s to use this command.
fi: Sinun täytyy olla %s käyttääksesi tätä komentoa.
fr: Vous devez être sur %s pour utiliser cette commande.

source: I couldn't find in my history of %s messages where %r last left the %s
de: Ich konnte in meiner Vergangenheit von %s Nachrichten nichts finden, wo %r zuletzt %s verlassen hat.
fi: En voinut löytää %s viestin historiasta milloin %r viimeksi lähti kanavalta %s
fr: Je ne peux pas trouver dans mon historique de %s messages, où %r a quitté il y a %s

source: Either %s didn't leave, or no messages were sent while %s was gone.
de: Entweder ist %s nicht gegangen, oder keine Nachrichten wurde gesendet während %s weg war.
fi: Joko %s ei lähtenyt, tai yhtään viestiä ei lähetetty silloin, kun %s oli poissa.
fr: Soit %s n'est jamais parti, soit aucun message n'a été envoyé depuis qu'il est parti.

source: [<channel>] <nick> Returns the last time <nick> was seen and what <nick> was last seen saying. <channel> is only necessary if the message isn't sent on the channel itself. <nick> may contain * as a wildcard.
de: [<Kanal>] <Nick> Gibt an wann <Nick> zum letzten Mal gesehen wurde und was dieser zuletzt sagte. <Kanal> ist nur nötig, falls die Nachricht nicht im Kanal selbst gesendet wurde. <Nick> kann * als Platzhalter beinhalten.
