Repository: progval/Limnoria
Catalog: plugins/Karma/locales/*.po
Languages: fr, it

source: Determines whether the bot will output shorter versions of the karma output when requesting a single thing's karma.
fr: Détermine si le bot donnera comme sortie une version plus courte du karma lorsqu'on lui demandera un seul karma.
it: Determina se il bot mostrerà una versione più corta del karma quando viene richiesto per un singolo oggetto.

source: Determines whether the bot will reply with a success message when something's karma is increased or decreased.
fr: Détermine si le bot répondra avec un message de succès si un karma est augmenté ou diminué.
it: Determina se il bot risponderà con un messaggio di successo quando viene aumentato o diminuito il karma di qualcosa.

source: Determines how many highest/lowest karma things are shown when karma is called with no arguments.
fr: Détermine combien de plus haut/bas karmas sont affichés lorsque karma est appelé sans argument.
it: Determina quanti karma più/meno vengono mostrati quando richiamato senza argomenti.

source: Determines how many karma things are shown when the most command is called.
fr: Détermine combien de karmas sont affichés lorsque la commande « most » est appelée.
it: Determina quanti karma vengono mostrati richiamando il comando "most".

source: Determines whether users can adjust the karma of their nick.
fr: Détermine si les utilisateurs peuvent ajuster le karma de leur nick.
it: Determina se gli utenti possano modificare il karma del loro nick.

source: Determines whether the bot will increase/decrease karma without being addressed.
fr: Détermine si le bot augmentera/diminuera le karma sans que l'on s'adresse à lui.
it: Determina se il bot aumenterà o diminuirà il karma senza essere richiamato.

source: %(thing)s's karma is now %(karma)i
fr: Le karma de %(thing)s est maintenant %(karma)i

source: You're not allowed to adjust your own karma.
fr: Vous n'êtes pas autorisé à modifier votre propre karma.
it: Non ti è permesso di modificare il tuo karma.

source: [<channel>] [<thing> ...] Returns the karma of <thing>. If <thing> is not given, returns the top N karmas, where N is determined by the config variable supybot.plugins.Karma.rankingDisplay. If one <thing> is given, returns the details of its karma; if more than one <thing> is given, returns the total karma of each of the things. <channel> is only necessary if the message isn't sent on the channel itself.
fr: [<canal>] [<objet> ...] Retourne le karma de l'<objet>. Si l'<objet> n'est pas donné, retourne les trois premiers et derniers karmas. Si une <chose> est donnée, retourne les détails de son karma ; si plus d'une <chose> est donnée, retourne le karma total de chacune de ces choses. Le <canal> n'est nécessaire que si la commande n'est pas envoyée sur le canal lui-même.
it: [<canale>] [<oggetto> ...] Riporta il karma di <oggetto>. Se <oggetto> non è fornito, restituisce i primi N karma, dove N è determinato dalla variabile supybot.plugins.Karma.rankingDisplay. Se viene specificato un <oggetto>, riporta i dettagli del suo karma; se ne vengono indicati più di uno, riporta il numero totale di karma di ciascuno degli oggetti. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: %s has neutral karma.
fr: %s a un karma neutre.
it: %s ha un karma neutro.

source: Karma for %q has been increased %n and decreased %n for a total karma of %s.
fr: Le karma de %q a été augmenté %n fois et diminué %n fois, pour un karma total de %s.
it: Il karma per %q è stato aumentato di %n e diminuito di %n per un totale di %s.

source: time
fr: <empty>
it: volta

source: I didn't know the karma for any of those things.
fr: Je ne connais le karma d'aucune de ces choses.
it: Non conosco il karma di nessuno di questi oggetti.

source: I have no karma for this channel.
fr: Je n'ai pas de karma pour ce canal.
it: Non ho karma per questo canale.

source: You (%s) are ranked %i out of %i.
fr: Vous (%s) êtes #%i sur %i
it: %s, sei valutato %i su %i.

source: Highest karma: %L. Lowest karma: %L.%s
fr: Plus haut karma : %L. Plus bas karma : %L.%s
it: Karma più alto: %L. Karma più basso: %L.%s

source: [<channel>] {increased,decreased,active} Returns the most increased, the most decreased, or the most active (the sum of increased and decreased) karma things. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] {increased,decreased,active} Retourne le plus augmenté (increased), le plus descendu (decreased), ou le plus actif (la somme des montées et descentes) des karmas. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] {increased,decreased,active} Riporta il karma maggiormente aumentato (increased), diminuito (decreased) , o più attivo (active) (la somma di aumentato e diminuito). <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <name> Resets the karma of <name> to 0.
fr: [<canal>] <nom> Redéfinit le karma de <nom> à 0.
it: [<cannle>] <nome> Azzera i karma di <nome>.

source: [<channel>] <filename> Dumps the Karma database for <channel> to <filename> in the bot's data directory. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <nom de fichier> Exporte la base de données des Karma du <canal> dans le <nom de fichier> dans le répertoire de données du bot. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] <nomefile> Esporta il database dei karma di <canale> in <nomefile> nella directory dei dati del bot. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: [<channel>] <filename> Loads the Karma database for <channel> from <filename> in the bot's data directory. <channel> is only necessary if the message isn't sent in the channel itself.
fr: [<canal>] <nom de fichier> Charge la base de données des Karma du <canal> du <nom de fichier> dans le répertoire de données du bot. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] <filename> Carica il database dei karma di <canale> da <nomefile> nella directory dei dati <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.
