Repository: progval/Limnoria
Catalog: plugins/Conditional/locales/*.po
Languages: fr

source: <condition> <ifcommand> <elsecommand> Runs <ifcommand> if <condition> evaluates to true, runs <elsecommand> if it evaluates to false. Use other logical operators defined in this plugin and command nesting to your advantage here.
fr: <condition> <commande1> <commande2> Exécute la <commande1> si la <condition> est évaluée à true, lance la <commande2> si elle est évaluée à false. Utilisez d'autres opérateurs logiques définis dans ce plugin et l'imbrication de commandes à votre avantage.

source: <cond1> [<cond2> ... <condN>] Returns true if all conditions supplied evaluate to true.
fr: <condition1> [<condition2> ... <conditionN>] Retourne True si toutes les conditions sont évaluées à true.

source: <cond1> [<cond2> ... <condN>] Returns true if any one of conditions supplied evaluates to true.
fr: <condition1> [<condition2> ... <conditionN>] Retourne True si une au moins des conditions est évaluée à true.

source: <cond1> [<cond2> ... <condN>] Returns true if only one of conditions supplied evaluates to true.
fr: <condition1> [<condition2> ... <conditionN>] Retourne True si une seule des conditions est évaluée à true.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if they are equal.
fr: <élément1> <élément2> Fait une comparaison de chaîne entre <élément1> et <élément2>. Retourne true si ils sont égaux.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if they are not equal.
fr: <élément1> <élément2> Fait une comparaison de chaîne entre <élément1> et <élément2>. Retourne true si ils sont inégaux.

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is greater than <item2>.
fr: <élément1> <élément2> Fait une comparaison de chaîne entre <élément1> et <élément2>. Retourne true si <élément1> est plus grand que <élément2>

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is greater than or equal to <item2>.
fr: <élément1> <élément2> Fait une comparaison de chaîne entre <élément1> et <élément2>. Retourne true si <élément1> est plus grand ou égal à <élément2>

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is less than <item2>.
fr: <élément1> <élément2> Fait une comparaison de chaîne entre <élément1> et <élément2>. Retourne true si <élément1> est plus petit que <élément2>

source: <item1> <item2> Does a string comparison on <item1> and <item2>. Returns true if <item1> is less than or equal to <item2>.
fr: <élément1> <élément2> Fait une comparaison de chaîne entre <élément1> et <élément2>. Retourne true si <élément1> est plus petit ou égal à <élément2>

source: [--case-insensitive] <item1> <item2> Determines if <item1> is a substring of <item2>. Returns true if <item1> is contained in <item2>. Will only match case if --case-insensitive is not given.
fr: [--case-insensitive] <élément1> <élément2> Détermine si <élément1> est une sous-chaîne de <élément2>. Retourne true si <élément1> est contenu dans <élément2>.Ne prendra la casse en compte que si --case-insensitive n’est pas donné.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if they are equal.
fr: <élément1> <élément2> Fait une comparaison numérique entre <élément1> et <élément2>. Retourne true si ils sont égaux.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if they are not equal.
fr: <élément1> <élément2> Fait une comparaison numérique entre <élément1> et <élément2>. Retourne true si ils sont inégaux.

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is greater than <item2>.
fr: <élément1> <élément2> Fait une comparaison numérique entre <élément1> et <élément2>. Retourne true si <élément1> est plus grand que <élément2>

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is greater than or equal to <item2>.
fr: <élément1> <élément2> Fait une comparaison numérique entre <élément1> et <élément2>. Retourne true si <élément1> est plus grand ou égal à <élément2>

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is less than <item2>.
fr: <élément1> <élément2> Fait une comparaison numérique entre <élément1> et <élément2>. Retourne true si <élément1> est plus petit que <élément2>

source: <item1> <item2> Does a numeric comparison on <item1> and <item2>. Returns true if <item1> is less than or equal to <item2>.
fr: <élément1> <élément2> Fait une comparaison numérique entre <élément1> et <élément2>. Retourne true si <élément1> est plus petit ou égal à <élément2>
