Repository: progval/Limnoria
Catalog: plugins/Google/locales/*.po
Languages: es, fi, it

source: The Google plugin has the functionality to watch for URLs that match a specific pattern. (We call this a snarfer) When supybot sees such a URL, it will parse the web page for information and reply with the results.
es: El plugin de Google tiene la funcionalidad de ver para las direcciones URL que coinciden con un patrón específico. (A esto le llamamos una Snarfer) Cuando Supybot ve un enlace, será analizar la página web de información y respuesta con los resultados.
fi: Google lisäosalla on toiminnallisuus vahtia URL-osoitteita, jotka täsmäävät tiettyyn kuvioon. (Me kutsumme tätä kaappaajaksi) Kun supybot näkee sellaisen URL-osoitteen, se jäsentää verkkosivun tiedot ja vastaa tuloksilla.
it: Il plugin Google ha la funzione di leggere gli URL che corrispondono ad un modello specifico (viene chiamato snarfer). Quando supybot vede un URL, analizza la pagina web per ottenere informazioni e rispondere con dei risultati.

source: Do you want the Google search snarfer enabled by default?
es: ¿Quieres que la búsqueda Snarfer Google activado por defecto?
fi: Tahdotko Google haku kaappaajan olevan oletuksenä käytössä?
it: Vuoi che lo snarfer per la ricerca in Google sia abilitato di default?

source: Value must be 1 <= n <= 8
es: El valor debe ser 1 <= n <= 8
fi: Arvon täytyy olla 1 <= n <= 8
it: Il valore deve essere compreso tra 1 e 8 (incluso)

source: Determines the URL that will be sent to Google for the Referer field of the search requests. If this value is empty, a Referer will be generated in the following format: http://$server/$botName
es: Determina la dirección URL que se enviará a Google para el campo de referencia de las solicitudes de búsqueda. Si este valor está vacío, una Árbitro será generado en el siguiente formato: http: // servidor $ / $ botName
fi: Määrittää URLin, joka lähetetään Googlelle hakupyyntöjen Referer kenttään. Jos tämä arvo on tyhjä, Referer luodaan seuraavassa muodossa: http://$palvelin/$botinNimi
it: Determina l'URL che sarà inviato a Google come Referer per le ricerche. Se questo valore è vuoto, verrà generato un Referer nel seguente formato: http://$server/$botName

source: Determines the base URL used for requests.
es: Determina la URL base que se utiliza para peticiones.
fi: Märittää perus URL-osoitteen, jota käytetään hakupyynnöille.

source: Determines whether the search snarfer is enabled. If so, messages (even unaddressed ones) beginning with the word 'google' will result in the first URL Google returns being sent to the channel.
es: Determina si la búsqueda es Snarfer habilitado. Si es así, los mensajes (incluso sin dirección) comienza con la palabra 'Google' dará lugar a la primera URL Google devuelve está enviando al canal.
fi: Määrittää onko haku kaappaaja käytössä. Jos niin, viestit (jopa botille osoittamattomat), jotka alkavat sanalla 'google' tuovat ensinmäisen URLin jonka Google haku palauttaa kanavalle.
it: Determina se lo snarfer per la ricerca è abilitato. In caso lo sia, i messaggi (anche quelli non diretti) che iniziano con la parola "google" invieranno in canale il primo URL che Google restituisce.

source: Determines whether the word 'google' in the bot's output will be made colorful (like Google's logo).
es: Determina si la palabra "Google" en el salida del bot se hará colorido (como el logotipo de Google).
fi: Määrittää tehdäänkö sana 'google' botin ulostulossa värikkääksi (kuten Googlen logo).
it: Determina se la parola "google" nell'output del bot sarà colorata (come il logo di Google).

source: Determines whether results are bolded.
es: Determina si los resultados están en negrita.
fi: Määrittää korostetaanko viestit.
it: Determina se i risultati saranno in grassetto.

source: Determines whether results are sent in different lines or all in the same one.
es: Determina si los resultados se envían en diferentes líneas o todos en el mismo.
fi: Määrittää lähetetäänkö tulokset eri vai samoilla riveillä.

source: Determines the maximum number of results returned from the google command.
es: Determina el número máximo de resultados devueltos desde el comando google.
fi: Määrittää maksimi numeron tuloksia, jotka palaavat Google komennolla.
it: Determina il numero massimo di risultati restituiti dal comando google.

source: Determines what default language is used in searches. If left empty, no specific language will be requested.
es: Determina el idioma por defecto se utiliza en búsquedas. Si se deja vacío, se solicitará ningún lenguaje específico.
fi: Määrittää mitä oletuskieltä käytetään hauissa. jos jätetty tyhjäksi, yhtään tiettyä kieltä ei pyydetä.
it: Determina la lingua predefinita usata nelle ricerche. Se lasciata vuota, non sarà richiesta nessuna lingua specifica.

source: Determines what level of search filtering to use by default. 'active' - most filtering, 'moderate' - default filtering, 'off' - no filtering
es: Determina el nivel de filtrado de búsqueda qué usar de forma predeterminada. "Activo" - más filtrado, "moderado" - Filtrado por defecto, "Off" - sin filtrado
fi: Määrittää minkälaista suodatusta käytetään oletuksena. 'active' - eniten suodatusta, 'moderate' - oletus suodatus, 'off' - ei suodatusta.
it: Determina quale livello di filtraggio usare in modo predefinito. "active": filtra tutto; "moderate": filtro predefinito; "off": filtro disattivato.

source: This is a simple plugin to provide access to the Google services we all know and love from our favorite IRC bot.
es: Este es un sencillo plugin para proporcionar acceso a los servicios que Google todos conocemos y amamos de nuestro bot de IRC favorito.

source: Perform a search using Google's AJAX API. search("search phrase", options={}) Valid options are: smallsearch - True/False (Default: False) filter - {active,moderate,off} (Default: "moderate") language - Restrict search to documents in the given language (Default: "lang_en")
es: Realice una búsqueda usando API AJAX de Google. Búsqueda ("frase de búsqueda", las opciones = {}) Las opciones válidas son: smallsearch - True / False (predeterminado: False) Filtro - {activa, moderada off} (por defecto: "moderado") idioma - Restringir la búsqueda a los documentos en el idioma que tenga (Por defecto: "lang_en")

source: We broke The Google!
es: Rompimos El Google!

source: No matches found.
es: No se encontró ninguna coincidencia.
fi: Osumia ei löytynyt.
it: Nessun risultato trovato.

source: [--snippet] <search> Does a google search, but only returns the first result. If option --snippet is given, returns also the page text snippet.
es: [--snippet] <Búsqueda> ¿Tiene una búsqueda en Google, pero sólo devuelve el primer resultado. Si se da la opción --snippet, devuelve también el fragmento de texto de la página.
fi: [--snippet] <haku> Tekee google haun, mutta palauttaa vain ensinmäisen tuloksen. Jos --snippet on annettu, palauttaa myös pätkän sivun tekstistä.
it: [--snippet] <ricerca> Effettua una ricerca su Google restituendo solo il primo risultato. Se l'opzione --snippet è specificata, riporta anche un frammento di testo della pagina.

source: Google found nothing.
es: Google no encontró nada.
fi: Google ei löytänyt mitään.
it: Google non ha trovato nulla.

source: <search> [--{filter,language} <value>] Searches google.com for the given string. As many results as can fit are included. --language accepts a language abbreviation; --filter accepts a filtering level ('active', 'moderate', 'off').
es: <Búsqueda> [- {filtro, idioma} <valor>] Busca en google.com para la cadena dada. Como muchos resultados como la capacidad es están incluidos. --language acepta una abreviatura del idioma; --filter acepta un nivel de filtrado ("activa", "moderado", "off").
fi: <haku> [--{suodatin,kieli} <arvo>] Hakee google.com :ista annetulla merkkiketjulla. Niin monta tulosta, kuin mahtuu sisällytetään. --language hyväksyy kieli lyhenteen; --filter hyväksyy suodatus tason ('active', 'moderate', 'off').
it: <ricerca> [--{filter,language} <valore>] Ricerca la data stringa su google.com fornendo tutti i risultati possibili. --language accetta un'abbreviazione di lingua; --filter un livello di filtraggio ('active', 'moderate', 'off').

source: <url> Returns a link to the cached version of <url> if it is available.
es: <url> Devuelve un enlace a la versión en caché de <url> si está disponible.

source: Google seems to have no cache for that site.
es: Google parece no tener memoria caché para ese sitio.

source: <search string> <search string> [<search string> ...] Returns the results of each search, in order, from greatest number of results to least.
es: <Concepto de búsqueda> <Concepto de búsqueda> [<cadena de búsqueda> ...] Devuelve los resultados de cada búsqueda, en orden, de mayor número de los resultados a menos.

source: <source language> [to] <target language> <text> Returns <text> translated from <source language> into <target language>.
es: <idioma fuente> [a] <idioma de destino> <texto> Devuelve <texto> traducidos de <idioma fuente> a <destino idioma>.

source: <expression> Uses Google's calculator to calculate the value of <expression>.
es: <expresión> Utiliza la calculadora de Google para calcular el valor de <expresión>.

source: <phone number> Looks <phone number> up on Google.
es: <número de teléfono> Mirar <número de teléfono> en Google.

source: Google's phonebook didn't come up with anything.
es: Guía de teléfonos de Google no llegó a nada.

source: en
it: it
